[
  {
    "name": "Alien Presence",
    "ability_source": "universal_monster_rule",
    "description": "The creature’s mere presence can have deleterious effects for those nearby. It can activate this ability as part of the action of making an attack or as a move action, but it can activate it only once per round. It usually has a range of 30 feet. This aura functions as frightful presence , but instead of imposing the shaken condition on creatures that fail their Will saves, it imposes the listed condition. The duration is 5d6 rounds unless the ability says otherwise. Once an opponent has been exposed to a creature’s alien presence (whether or not the opponent succeeds at its saving throw), it cannot be affected by the same creature’s alien presence for 24 hours. This is an emotion, fear, mind-affecting, and sensedependent effect.",
    "types": {
      "aura": 1
    },
    "format": "alien presence (240 ft., DC 25, sickened 2d4 rounds).",
    "id": "abilities.alien_presence"
  },
  {
    "name": "Amorphous",
    "ability_source": "universal_monster_rule",
    "description": "The creature’s body is malleable and shapeless. It does not take double damage from critical hits, but it is affected by critical hit effects normally.",
    "types": {
      "defensive": 1
    },
    "format": "amorphous.",
    "id": "abilities.amorphous"
  },
  {
    "name": "Amphibious",
    "ability_source": "universal_monster_rule",
    "description": "The creature has the aquatic subtype or water breathing, but it can breathe air and survive on land.",
    "types": {
      "other": 1
    },
    "format": "amphibious.",
    "id": "abilities.amphibious"
  },
  {
    "name": "Attach",
    "ability_source": "universal_monster_rule",
    "description": "The creature can attempt a special attack against KAC as a standard action. If it succeeds, it deals no damage, but the creature adheres to its target. Once attached, the creature gains a +4 bonus to its AC (from cover) and a +2 circumstance bonus to melee attacks, but it can attack only the creature to which it is attached. An attached creature can’t move on its own (though it moves with its target), take actions that require two hands, or make attacks of opportunity. An attached creature can be removed with a successful Strength check (DC = 10 + 1-1/2 × the creature’s CR) made as a move action, or it can remove itself from its target as a move action.",
    "types": {
      "melee": 1
    },
    "format": "attach +6.",
    "id": "abilities.attach"
  },
  {
    "name": "Aura",
    "ability_source": "universal_monster_rule",
    "description": "Unless an aura says otherwise, a target is affected by an aura automatically, with no action required on the creature’s part, whenever the target is within the aura’s listed range (either when the target enters the aura on its turn or when it begins its turn in the aura, whichever comes first). If the aura deals damage, it damages a target only the first time the target is in the aura each round, regardless of how many times within the round the target enters and leaves the aura. A creature can suppress its aura for 1 round as a move action unless noted otherwise.",
    "types": {
      "aura": 1
    },
    "format": "radiation (30 ft., Fortitude DC 17)",
    "id": "abilities.aura"
  },
  {
    "name": "Blindsense",
    "ability_source": "universal_monster_rule",
    "description": "The creature has a specific imprecise nonvisual sense that operates effectively without vision. This specific sense is indicated in parentheses. For more information on blindsense, see page 262 of the Starfinder Core Rulebook .",
    "types": {
      "sense": 1
    },
    "format": "blindsense (vibration) 60 ft.",
    "id": "abilities.blindsense"
  },
  {
    "name": "Blindsight",
    "ability_source": "universal_monster_rule",
    "description": "Blindsight is a more precise version of blindsense. This ability operates out to a specified range. A creature with blindsight typically perceives using a specific type of sense, indicated in parentheses. See page 262 of the Starfinder Core Rulebook for more information.",
    "types": {
      "sense": 1
    },
    "format": "blindsight (life) 60 ft.",
    "id": "abilities.blindsight"
  },
  {
    "name": "Breath Weapon",
    "ability_source": "universal_monster_rule",
    "description": "As a standard action, the creature can exhale a cone or line of energy or another magical effect. A breath weapon attack usually deals damage, and it is often energy-based. A breath weapon usually allows a target to attempt a Reflex saving throw for half damage, though some breath weapons require a successful Fortitude or Will save instead. A creature is immune to its own breath weapon and the breath weapons of others of its kind unless otherwise noted. Each breath weapon also indicates how often it can be used.",
    "types": {
      "offensive": 1
    },
    "format": "breath weapon (60-ft. cone, 8d6 F, Reflex DC 18 half, usable every 1d4 rounds)",
    "id": "abilities.breath_weapon"
  },
  {
    "name": "Change Shape",
    "ability_source": "universal_monster_rule",
    "description": "The creature has the ability to assume the appearance of a specific creature or type of creature, but it retains most of its own physical qualities. If the form assumed has any of the following abilities, the creature gains them while in that form: blindsight (scent), darkvision, low-light vision, and swim 30 feet. The creature can retain its own breathing ability, or it can assume the ability to breathe in any environment the assumed shape can breathe in (including the no breath ability, which enables it to survive in the vacuum of space). If the ability does not specify what the creature can change shape into, it can assume the form of any creature of the humanoid type, but it can’t mimic a specific humanoid. Change shape grants a +10 bonus to Disguise checks to appear as a creature of the type and subtype of the new form, and the DC of the creature’s Disguise check is not modified as a result of altering major features or disguising itself as a different race or creature type. A creature can assume a form that is one size category smaller or larger than its original form and become that size. Unless otherwise stated, it can remain in an alternate form indefinitely. Some creatures can transform into unique forms with special modifiers and abilities. These creatures adjust their ability scores, as noted in their description.",
    "types": {
      "other": 1
    },
    "format": "change shape (humanoid)",
    "id": "abilities.change_shape"
  },
  {
    "name": "Compression",
    "ability_source": "universal_monster_rule",
    "description": "The creature can move through an area as small as one-quarter of its space without squeezing or one-eighth its space when squeezing.",
    "types": {
      "other": 1
    },
    "format": "compression.",
    "id": "abilities.compression"
  },
  {
    "name": "Construct Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Constructs are immune to the following effects, unless the effect specifies that it works against constructs. Bleed, death effects, disease, mind-affecting effects, necromancy effects, paralysis, poison, sleep, and stunning. Ability damage, ability drain, energy drain, exhaustion, fatigue, negative levels, and nonlethal damage. Any effect that requires a Fortitude save (unless the effect works on objects or is harmless).",
    "types": {
      "immunity": 1
    },
    "format": "construct immunities.",
    "id": "abilities.construct_immunities"
  },
  {
    "name": "Create Darkness",
    "ability_source": "universal_monster_rule",
    "description": "As a standard action, the creature can create a 20-foot-radius area of darkness centered on itself, which negates the effects of all nonmagical light sources in that area. This darkness lasts for a number of minutes equal to the creature’s CR, and the creature can dismiss the effect as a standard action. The darkness doesn’t move with the creature. Unless otherwise noted, any magic source of light can increase the light level in the area as normal.",
    "types": {
      "offensive": 1
    },
    "format": "create darkness.",
    "id": "abilities.create_darkness"
  },
  {
    "name": "Crush",
    "ability_source": "universal_monster_rule",
    "description": "When ending a flying or jumping movement, the creature can land on targets that are at least three size categories smaller than itself. Targets are automatically knocked prone, take the listed damage, and are pinned. Each crushed target can attempt to escape the pin normally on its turn, and the pin ends automatically if the crushing creature moves out of the target’s square. A crushed target does not take damage from the crush more than once, unless the crushing creature moves fully off that creature and then back onto it.",
    "types": {
      "offensive": 1
    },
    "format": "crush (4d6+8 B).",
    "id": "abilities.crush"
  },
  {
    "name": "Darkvision",
    "ability_source": "universal_monster_rule",
    "description": "The creature can see out to the listed range with no light source at all. See page 263 of the Starfinder Core Rulebook .",
    "types": {
      "sense": 1
    },
    "format": "darkvision 60 ft.",
    "id": "abilities.darkvision"
  },
  {
    "name": "Dependency",
    "ability_source": "universal_monster_rule",
    "description": "The creature is dependent on a substance, a sense, or something else to either survive or function normally. If the creature is dependent on something to live (such as water), it can survive without that thing for a number of minutes equal to 5 times its Constitution modifier. Beyond this limit, the creature runs the risk of negative effects, such as suffocation or death. A creature that is dependent on something to function normally (such as a creature with blindsight and no visual sense) usually gains a negative condition when it loses that thing.",
    "types": {
      "weakness": 1
    },
    "format": "blindsight dependency.",
    "id": "abilities.dependency"
  },
  {
    "name": "Detect Alignment",
    "ability_source": "universal_monster_rule",
    "description": "The creature can detect the alignment of another creature. This functions as detect magic , but rather than determining which creatures and objects in the area are magical, the creature can determine one other creature’s alignment.",
    "types": {
      "sense": 1
    },
    "format": "detect alignment.",
    "id": "abilities.detect_alignment"
  },
  {
    "name": "Distraction",
    "ability_source": "universal_monster_rule",
    "description": "The creature can nauseate targets that it damages. A living creature that takes damage from a creature with the distraction ability is nauseated for 1 round; the target can negate the effect with a successful Fortitude save at the listed DC.",
    "types": {
      "offensive": 1
    },
    "format": "distraction (DC 15).",
    "id": "abilities.distraction"
  },
  {
    "name": "Earth Glide",
    "ability_source": "universal_monster_rule",
    "description": "When the creature burrows, it can pass through dirt, stone, or almost any other sort of earth except metal as easily as a fish swims through water. If protected against fire damage, it can even glide through lava. Its burrowing leaves behind no tunnel or hole, nor does it create any ripple or other sign of its presence.",
    "types": {
      "other": 1
    },
    "format": "earth glide.",
    "id": "abilities.earth_glide"
  },
  {
    "name": "Elemental Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Elementals are immune to the following effects, unless the effect specifies that it works against elemental creatures: Bleed, critical hits, paralysis, poison, sleep effects, and stunning.Flanking—elementals are unflankable.",
    "types": {
      "immunity": 1
    },
    "format": "elemental immunities.",
    "id": "abilities.elemental_immunities"
  },
  {
    "name": "Energy Drain",
    "ability_source": "universal_monster_rule",
    "description": "A successful energy drain attack inflicts one or more negative levels (as described in the ability). If an attack that includes an energy drain scores a critical hit, it inflicts twice the listed number of negative levels. Unless otherwise specified in the draining creature’s description, it gains 5 temporary Hit Points for each negative level it inflicts on an opponent. These temporary Hit Points last for a maximum of 1 hour. Negative levels from energy drain remain until 24 hours have passed or until they are removed with magic or technology. If a negative level isn’t removed before 24 hours have passed, the affected target must attempt a Fortitude saving throw (the exact DC is given in the creature’s stat block). On a success, the negative level goes away. On a failure, the negative level becomes permanent. A separate saving throw is required for each negative level. See page 252 of the Starfinder Core Rulebook for more about negative levels.",
    "types": {
      "melee": 1,
      "offensive": 1
    },
    "format": "energy drain (2 levels, DC 22).",
    "id": "abilities.energy_drain"
  },
  {
    "name": "Engulf",
    "ability_source": "universal_monster_rule",
    "description": "As a standard action, the creature can move up to its speed, moving into or through the space of any creatures that are at least one size smaller than itself without penalty. Every creature in the engulfing creature’s path is automatically engulfed, with no attack roll needed. A targeted creature can attempt a Reflex saving throw to avoid being engulfed; if it attempts this save, it can’t make an attack of opportunity against the engulfing creature due to that creature’s movement. On a successful save, the target is pushed back or aside (target’s choice) as the engulfing creature continues to move. An engulfed creature gains the pinned condition, takes the listed damage at the beginning of each turn it is engulfed, is in danger of suffocating if it doesn’t have environmental protections, and is trapped within the engulfing creature’s body until it is no longer pinned. An engulfed creature moves with the engulfing creature; this movement does not provoke attacks of opportunity against the engulfed creature. A creature can engulf one creature that is one size smaller than itself, up to two creatures that are two sizes smaller, or up to four creatures that are three sizes smaller.",
    "types": {
      "offensive": 1
    },
    "format": "engulf (1d6+8 F, DC 13).",
    "id": "abilities.engulf"
  },
  {
    "name": "Fast Healing",
    "ability_source": "universal_monster_rule",
    "description": "The creature regains the listed number of Hit Points at the start of its turn. Unless otherwise noted, the creature can never exceed its maximum Hit Points. Fast healing does not restore Hit Points lost from starvation, thirst, or suffocation, nor does it allow a creature to regrow or reattach lost body parts, unless otherwise stated. Fast healing continues to function until a creature dies, at which point the effects of fast healing end immediately.",
    "types": {
      "defensive": 1
    },
    "format": "fast healing 5.",
    "id": "abilities.fast_healing"
  },
  {
    "name": "Ferocious Charge",
    "ability_source": "universal_monster_rule",
    "description": "When the creature charges, it can attempt a trip combat maneuver in place of the normal melee attack. In addition, the creature can charge without taking the normal charge penalties to its attack roll or AC. If the creature has another ability that allows it to charge without taking these penalties (such as the charge attack ability from the soldier’s blitz fighting style), it also gains the ability to charge through difficult terrain.",
    "types": {
      "offensive": 1
    },
    "format": "ferocious charge.",
    "id": "abilities.ferocious_charge"
  },
  {
    "name": "Ferocity",
    "ability_source": "universal_monster_rule",
    "description": "When the creature is brought to 0 Hit Points, it can fight on for 1 more round. It can act normally until the end of its next turn; if it has 0 Hit Points at that point, it dies. If it would lose further Hit Points before this, it ceases to be able to act and dies.",
    "types": {
      "defensive": 1
    },
    "format": "ferocity.",
    "id": "abilities.ferocity"
  },
  {
    "name": "Fly",
    "ability_source": "universal_monster_rule",
    "description": "The source of the creature’s fly speed (whether extraordinary, supernatural, or from another source such as an item) is noted before its maneuverability. Unless otherwise noted, a creature whose ability to fly is extraordinary can’t fly in a vacuum.",
    "types": {
      "speed": 1
    },
    "format": "fly 60 ft. (Ex, perfect).",
    "id": "abilities.fly"
  },
  {
    "name": "Frightful Presence",
    "ability_source": "universal_monster_rule",
    "description": "The creature’s presence unsettles its foes. It can activate this ability as part of the action of making an attack or as a move action, but it can activate it only once per round. It usually has a range of 30 feet. Opponents within the range must succeed at a Will save or become shaken. The duration is 5d6 rounds unless the ability says otherwise. Once an opponent has been exposed to a creature’s frightful presence (whether or not the opponent succeeds at its saving throw), it cannot be affected by the same creature’s frightful presence for 24 hours. This is an emotion, fear, mind-affecting, and sense-dependent effect.",
    "types": {
      "aura": 1
    },
    "format": "frightful presence (30 ft., Will DC 22).",
    "id": "abilities.frightful_presence"
  },
  {
    "name": "Gaze",
    "ability_source": "universal_monster_rule",
    "description": "Opponents that look at a creature with a gaze ability are in danger of being charmed, paralyzed, turned to stone, or subjected to another negative effect. Each opponent within the gaze’s listed range must attempt a saving throw (usually Fortitude or Will) at the beginning of its turn. On a successful save, the effect is negated. An opponent can give itself an advantage against this ability in one of two ways. Looking Obliquely: An opponent that avoids looking directly at the creature’s gaze (either by following the creature’s shadow or by tracking it in a reffective surface) or that looks at the creature through a camera or heads‑up display gains a +4 circumstance bonus to the saving throw. However, the creature with the gaze ability gains concealment against that opponent. Blocking Its Vision: By completely blocking or covering its own visual sensors, an opponent doesn’t need to attempt a save against the gaze. However, the creature with the gaze ability gains total concealment against that opponent. Gaze abilities can affect ethereal opponents but not opponents without visual sensors. A creature is immune to the gaze abilities of others of its kind unless otherwise noted. Allies of a creature with a gaze ability can still be affected, but they are always considered to be looking obliquely at the creature. The creature can also veil its eyes, thus negating its gaze ability.",
    "types": {
      "offensive": 1
    },
    "format": "paralyzing gaze (60 ft., Will DC 14).",
    "id": "abilities.gaze"
  },
  {
    "name": "Grab",
    "ability_source": "universal_monster_rule",
    "description": "If the creature hits with the indicated attack (usually a claw or bite attack), it deals the normal damage. If the attack roll result equals or exceeds the target’s KAC + 4, the creature also automatically grapples the foe. (If it equals or exceeds the target’s KAC + 13, the creature instead pins the target.) The creature does not need to have a spare limb free to perform this grapple as long as it can make the listed attack, and it can potentially grapple more than one target if it has more than one attack with the grab ability. The creature can maintain the grab either with another successful grab attack or by performing the grapple combat maneuver normally.",
    "types": {
      "melee": 1
    },
    "format": "claw +8 (1d6+4 plus grab).",
    "id": "abilities.grab"
  },
  {
    "name": "Immunity",
    "ability_source": "universal_monster_rule",
    "description": "The creature takes no damage from the listed source. Creatures can be immune to certain types of damage, types of afflictions, conditions, spells (based on school, level, or save type), and other effects. A creature that is immune to critical hits doesn’t take double damage or suffer critical hit effects. A creature that is immune to a listed source doesn’t suffer from its effects or from any secondary effects that it would trigger.",
    "types": {
      "immunity": 1
    },
    "format": "acid, paralysis.",
    "id": "abilities.immunity"
  },
  {
    "name": "Integrated Weapons",
    "ability_source": "universal_monster_rule",
    "description": "The creature’s weapons are manufactured weapons, not natural weapons, and they are integrated into its frame. A creature can’t be disarmed of these weapons, though they can be removed and used if the creature is dead.",
    "types": {
      "defensive": 1
    },
    "format": "integrated weapons.",
    "id": "abilities.integrated_weapons"
  },
  {
    "name": "Light Blindness",
    "ability_source": "universal_monster_rule",
    "description": "The creature is blinded for 1 round when first exposed to bright light, such as sunlight, and it is dazzled for as long as it remains in an area of bright light.",
    "types": {
      "weakness": 1
    },
    "format": "light blindness.",
    "id": "abilities.light_blindness"
  },
  {
    "name": "Limited Plant Benefits",
    "ability_source": "universal_monster_rule",
    "description": "Despite being a plant creature, the creature doesn’t gain the standard immunities associated with creatures of the plant type. Instead, a creature with this ability gains a +2 racial bonus on saving throws against mind-affecting effects, paralysis, poison, polymorph, sleep, and stunning effects, unless the effect specifies that it is effective against plants.",
    "types": {
      "defensive": 1
    },
    "format": "limited plant benefits.",
    "id": "abilities.limited_plant_benefits"
  },
  {
    "name": "Limited Telepathy",
    "ability_source": "universal_monster_rule",
    "description": "The creature can mentally communicate with any creatures within the listed range with which it shares a language. See page 259 of the Starfinder Core Rulebook for more details.",
    "types": {
      "language": 1
    },
    "format": "limited telepathy 30 ft.",
    "id": "abilities.limited_telepathy"
  },
  {
    "name": "Low-Light Vision",
    "ability_source": "universal_monster_rule",
    "description": "The creature can see in dim light as if it were normal light. Low-light vision is color vision, unlike darkvision. A creature with low-light vision can read as long as even the tiniest source of light is next to it. Creatures with low-light vision can see outdoors on a moonlit night as well as they can during the day, since the moon casts dim light.",
    "types": {
      "sense": 1
    },
    "format": "low-light vision.",
    "id": "abilities.low-light_vision"
  },
  {
    "name": "Mindless",
    "ability_source": "universal_monster_rule",
    "description": "The creature has no Intelligence score or modifier and is immune to mind-affecting effects. Any DCs or other statistics that rely on an Intelligence score treat the creature as having a score of 10 (+0).",
    "types": {
      "other": 1
    },
    "format": "mindless.",
    "id": "abilities.mindless"
  },
  {
    "name": "Multiarmed",
    "ability_source": "universal_monster_rule",
    "description": "The creature has the number of arms listed. This allows it to wield and hold up to that many hands’ worth of weapons and equipment. While this increases the number of items it can have at the ready, it doesn’t increase the number of attacks it can make during combat.",
    "types": {
      "other": 1
    },
    "format": "multiarmed (4).",
    "id": "abilities.multiarmed"
  },
  {
    "name": "Multiattack",
    "ability_source": "universal_monster_rule",
    "description": "In addition to its standard melee or ranged attack, the creature has a multiattack entry. When making a full attack, the creature can make all the attacks listed in the multiattack entry at the attack bonuses listed, rather than make two attacks. It can make the attacks in any order.",
    "types": {
      "multiattack": 1
    },
    "format": "bite +10 (1d4+11), 2 claws +10 (1d4+11).",
    "id": "abilities.multiattack"
  },
  {
    "name": "Natural Weapons",
    "ability_source": "universal_monster_rule",
    "description": "Natural weapons (and natural attacks), such as acid spit, bite, claw, or slam, don’t require ammunition and can’t be disarmed or sundered. In addition, a player character with this ability as a racial trait is always considered armed. They can deal 1d3 lethal damage (of the listed type, or bludgeoning if no type is specified) with unarmed strikes, and the attack doesn’t have the archaic special property. They also gain a unique Weapon Specialization with their natural weapons at 3rd level, allowing them to add 1-1/2 × their character level to their damage rolls for their natural weapons (instead of just adding their character level, as usual).",
    "types": {},
    "id": "abilities.natural_weapons"
  },
  {
    "name": "No Breath",
    "ability_source": "universal_monster_rule",
    "description": "The creature doesn’t breathe, and it is immune to effects that require breathing (such as inhaled poison). This does not give it immunity to cloud or gas attacks that don’t require breathing.",
    "types": {
      "other": 1
    },
    "format": "no breath.",
    "id": "abilities.no_breath"
  },
  {
    "name": "Ooze Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Oozes are immune to the following effects, unless the effect specifies that it works against oozes. Critical hits, paralysis, poison, polymorph, sleep, and stunning. Gaze abilities, illusions, visual effects, and other attacks that rely on sight. Flanking—oozes are unflankable.",
    "types": {
      "immunity": 1
    },
    "format": "ooze immunities.",
    "id": "abilities.ooze_immunities"
  },
  {
    "name": "Plant Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Plants are immune to the following effects, unless the effect specifies it works against plants. Mind-affecting effects, paralysis, poison, polymorph, sleep, and stunning.",
    "types": {
      "immunity": 1
    },
    "format": "plant immunities.",
    "id": "abilities.plant_immunities"
  },
  {
    "name": "Plantlike",
    "ability_source": "universal_monster_rule",
    "description": "For effects targeting creatures by type, plantlike creatures count as both their type and plants (whichever type allows an ability to affect them for abilities that affect only one type, and whichever is worse for abilities that affect both types). They also receive a +2 racial bonus to saving throws against mind-affecting effects, paralysis, poison, polymorph, sleep, and stunning, unless the effect specifies that it works against plants.",
    "types": {
      "other": 1
    },
    "format": "plantlike.",
    "id": "abilities.plantlike"
  },
  {
    "name": "Radioactive",
    "ability_source": "universal_monster_rule",
    "description": "The creature emanates radiation at the listed radiation level to the listed radius. If the radiation level is medium or stronger, the effect suffuses a larger area at a lower level as normal.",
    "types": {
      "aura": 1
    },
    "format": "radioactive (medium, 20 ft., DC 17).",
    "id": "abilities.radioactive"
  },
  {
    "name": "Regeneration",
    "ability_source": "universal_monster_rule",
    "description": "The creature regains Hit Points at the start of its turn, as with fast healing (see page 151), but it can’t die as long as its regeneration is still functioning (although creatures with regeneration still fall unconscious when their Hit Points reach 0). Certain attacks, typically those that deal acid or fire damage, cause a creature’s regeneration to stop functioning for 1 round. During this round, the creature doesn’t regain Hit Points and can die normally. The creature’s stat block describes the types of damage that suppress the regeneration. Regeneration doesn’t restore Hit Points lost from starvation, thirst, or suffocation. Creatures with regeneration can regrow lost portions of their bodies and can reattach severed body parts if they are recovered within 1 hour of severing. Severed parts that aren’t reattached wither and decompose normally. A creature usually must have a Constitution score or modifier to have this ability.",
    "types": {
      "defensive": 1
    },
    "format": "regeneration 5 (acid).",
    "id": "abilities.regeneration"
  },
  {
    "name": "Resistance",
    "ability_source": "universal_monster_rule",
    "description": "The creature ignores some damage of a certain type (acid, cold, electricity, fire, or sonic) per attack, but it does not have total immunity.",
    "types": {
      "resistance": 1
    },
    "format": "acid 10.",
    "id": "abilities.resistance"
  },
  {
    "name": "See in Darkness",
    "ability_source": "universal_monster_rule",
    "description": "The creature can see perfectly in darkness of any kind, including magical darkness.",
    "types": {
      "sense": 1
    },
    "format": "see in darkness.",
    "id": "abilities.see_in_darkness"
  },
  {
    "name": "Sense Through",
    "ability_source": "universal_monster_rule",
    "description": "The creature can sense through obstacles that would normally block the ability to perceive what is beyond them. The specific sense this ability applies to is indicated in parentheses after the sense through entry in the creature’s statistics. If the ability allows the creature to sense through only a specific material, that material is listed after the specific sense. For more information on sense through, see page 264 of the Starfinder Core Rulebook .",
    "types": {
      "sense": 1
    },
    "format": "sense through (vision).",
    "id": "abilities.sense_through"
  },
  {
    "name": "Sightless",
    "ability_source": "universal_monster_rule",
    "description": "The creature does not use any visual senses and is thus never subject to any effect that requires the creature to see a target or effect. Sightless creatures normally have some form of blindsight to compensate for their sightlessness, but if not, they are assumed to be able to operate as well as a creature with normal vision unless the creature’s description says otherwise.",
    "types": {
      "sense": 1
    },
    "format": "sightless.",
    "id": "abilities.sightless"
  },
  {
    "name": "Solar Adaptation",
    "ability_source": "universal_monster_rule",
    "description": "The creature can survive within a star despite the luminance, pressure, radiation, and convection currents. In addition, while within a star, the creature can move as if it had a supernatural fly speed equal to its fastest speed.",
    "types": {
      "other": 1
    },
    "format": "solar adaptation.",
    "id": "abilities.solar_adaptation"
  },
  {
    "name": "Spaceflight",
    "ability_source": "universal_monster_rule",
    "description": "The creature can fly through space at standard navigation and astrogation speeds using Piloting to navigate. If it uses a skill other than Piloting for skill checks to astrogate, that skill is listed in parentheses.",
    "types": {
      "other": 1
    },
    "format": "spaceflight (Mysticism).",
    "id": "abilities.spaceflight"
  },
  {
    "name": "Spell Resistance",
    "ability_source": "universal_monster_rule",
    "description": "The creature can avoid the effects of some spells and spelllike abilities that would directly affect it. To determine whether a spell or spell-like ability works against a creature with spell resistance, the caster must attempt a caster level check (1d20 + caster level). If the result equals or exceeds the creature’s spell resistance, the spell works normally, though the creature can still attempt any saving throws normally allowed. See page 265 of the Starfinder Core Rulebook for more information.",
    "types": {
      "spell_resistance": 1
    },
    "format": "18.",
    "id": "abilities.spell_resistance"
  },
  {
    "name": "Spider Climb",
    "ability_source": "universal_monster_rule",
    "description": "The creature can climb as though affected by the spell spider climb .",
    "types": {
      "speed": 1
    },
    "format": "spider climb.",
    "id": "abilities.spider_climb"
  },
  {
    "name": "Stellar Alignment",
    "ability_source": "universal_monster_rule",
    "description": "The creature is aligned to the cycles of solar systems. Creatures with stellar alignment usually have stellar revelations and zenith revelations, either ones from the solarian class or ones unique to the creature. When using stellar revelations, the creature is always considered attuned. However, it’s not always considered fully attuned, so it normally can’t always use zenith powers. When you roll initiative for the creature, roll 1d3. Once that many rounds have elapsed, the creature is considered fully attuned and gains access to its zenith powers. After it uses a zenith power, it’s no longer fully attuned, and you roll 1d3 again to see how many rounds it will take to recharge. If a creature has stellar alignment (graviton) or stellar alignment (photon), it’s considered to be attuned only in the indicated mode and can become fully attuned only in the indicated mode, as described above.",
    "types": {
      "other": 1
    },
    "format": "stellar alignment (graviton).",
    "id": "abilities.stellar_alignment"
  },
  {
    "name": "Summon Allies",
    "ability_source": "universal_monster_rule",
    "description": "The creature can attempt to summon creatures of the same creature type as itself as a full action. The summoned ally cannot summon its own allies, is worth 0 experience points, and returns to the place from which it came after 1 hour.",
    "types": {
      "spell": 1
    },
    "format": "1/day—summon allies (1 imp 60%).",
    "id": "abilities.summon_allies"
  },
  {
    "name": "Swallow Whole",
    "ability_source": "universal_monster_rule",
    "description": "If the creature hits with the indicated attack (usually a bite attack), it deals the normal damage. If the creature’s attack roll hits the target’s KAC + 4, the creature also automatically grapples the foe as part of the attack action. (If it hits the target’s KAC + 13, it instead pins the target). The creature doesn’t need to have a free limb to perform this grapple. Unless otherwise specified, a creature can swallow whole only targets that are at least one size category smaller than itself, and it has room for a single target of that size in its stomach (doubling the maximum number of creatures it can have swallowed for each additional size category by which these creatures are smaller). On the creature’s next turn after grappling or pinning the target, if the target has not escaped the grapple or pin, the target automatically takes the attack’s damage at the beginning of the creature’s turn. The creature can then make a new attack roll with the same attack. If the roll equals or exceeds the target’s KAC, the grapple or pin is maintained. If the roll equals or exceeds the target’s KAC + 4, the target is swallowed whole (no damage is dealt). Once swallowed, the target takes the listed swallow whole damage automatically at the beginning of its turn every round. The target is considered grappled as long as it is swallowed. The target can attempt to cut its way out (the interior of a creature with swallow whole has the same EAC as its exterior and a KAC equal to that of its exterior – 4) by dealing an amount of damage equal to onequarter the swallowing creature’s total Hit Points, though any attack that does not deal slashing damage deals only half its normal damage. If a target cuts its way out of the creature, the creature cannot use swallow whole again until that damage is healed. Alternatively, a target swallowed whole can attempt to climb out. The swallowed creature must succeed at both a grapple check against the creature’s internal KAC + 8 and an Athletics check to climb (DC = 10 + 1-1/2 × the creature’s CR). Each of these actions takes a full round. If both checks are successful, the target climbs back up to the creature’s mouth and can escape, ending up in an open square adjacent to the creature.",
    "types": {
      "melee": 1
    },
    "format": "bite +19 (5d4+16 P plus swallow whole)",
    "id": "abilities.swallow_whole"
  },
  {
    "name": "Swarm Attack",
    "ability_source": "universal_monster_rule",
    "description": "The creature automatically deals the listed damage to each creature whose space it occupies at the end of its turn, with no attack roll needed. Swarm attacks are not subject to a miss chance for concealment or cover.",
    "types": {
      "melee": 1
    },
    "format": "swarm attack (1d6+2 P).",
    "id": "abilities.swarm_attack"
  },
  {
    "name": "Swarm Defenses",
    "ability_source": "universal_monster_rule",
    "description": "Swarms take damage from weapons differently depending on how the weapon targets them. A swarm is immune to attacks and effects that target a single creature (including single-target spells), with the exception of mind-affecting effects if the swarm has an Intelligence score and an ability similar to a formian’s hive mind . A swarm takes half again as much damage (+50%) from effects that affect all targets in an area, such as grenades, blast and explode weapons, and many evocation spells. A swarm takes normal damage from an attack or effect that affects multiple targets (including lines and fully automatic mode attacks). For the purpose of automatic fire, the swarm counts as five targets. For example, if an automatic attack is made using 12 rounds of ammunition, it can attack a maximum of six targets, so it can damage a swarm normally. However, if two other targets are closer to the attacker than the swarm, they must be attacked first, leaving only four attacks to target the swarm, so it takes no damage.",
    "types": {
      "defensive": 1
    },
    "format": "swarm defenses.",
    "id": "abilities.swarm_defenses"
  },
  {
    "name": "Swarm Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Swarms are immune to the following effects, unless the effect specifies it works against swarms. Bleeding, critical hits, flat-footed, off-target, pinned, prone, staggered, and stunned.Combat maneuvers—swarms can’t be affected by and can’t perform combat maneuvers, unless the swarm’s description says otherwise.Flanking—swarms are unflankable.Dying—a swarm reduced to 0 Hit Points breaks up and ceases to exist as a swarm, though individual members of it might survive.",
    "types": {
      "immunity": 1
    },
    "format": "swarm immunities.",
    "id": "abilities.swarm_immunities"
  },
  {
    "name": "Swarm Mind",
    "ability_source": "universal_monster_rule",
    "description": "Members of the Swarm are bound together into a singular hive mind by a blend of exuded pheromones, imperceptible movements of antennae and limbs, electrostatic fields, and telepathic communication. All Swarm creatures with 30 feet of each other are in constant communication; if one is aware of a threat, all are. (Such awareness can spread along a “chain” of Swarm creatures under appropriate circumstances, potentially alerting distant Swarm creatures). In addition, once per round when within 30 feet of another Swarm creature, a Swarm creature can roll twice and take the better result on a saving throw against a mind-affecting effect.",
    "types": {
      "defensive": 1
    },
    "format": "Swarm mind.",
    "id": "abilities.swarm_mind"
  },
  {
    "name": "Tracking",
    "ability_source": "universal_monster_rule",
    "description": "The creature can use the Perception skill to perform the follow tracks task of the Survival skill with the listed sense. The sense is usually related to a type of signature that most creatures leave behind, such as a scent or heat trail. The creature might gain a bonus or penalty to its Perception check to follow tracks depending on the strength of the quarry’s signature, at the GM’s discretion. It is possible for stronger signatures to completely mask other signatures, making following tracks with a weaker signature very difficult.",
    "types": {
      "other": 1
    },
    "format": "tracking (scent).",
    "id": "abilities.tracking"
  },
  {
    "name": "Trample",
    "ability_source": "universal_monster_rule",
    "description": "As a full action, the creature can move up to its speed and through the space of any creatures that are at least one size smaller than itself. The creature does not need to make an attack roll; each creature whose space it moves through takes damage. A target of a trample can attempt a Reflex save with the listed DC to take half damage; if it attempts the save, it can’t make an attack of opportunity against the trampling creature due to the creature’s movement. A creature can deal trample damage to a given target only once per round.",
    "types": {
      "offensive": 1
    },
    "format": "trample (3d4+14 B, DC 16).",
    "id": "abilities.trample"
  },
  {
    "name": "Troop Attack",
    "ability_source": "universal_monster_rule",
    "description": "The creature doesn’t make standard melee attacks. Instead, it deals automatic damage to any creature within its reach or whose space it occupies at the end of its turn, with no attack roll needed. A troop threatens all creatures within its reach or within its area and resolves attacks of opportunity by dealing automatic troop damage to any foe in reach that provokes an attack of opportunity. A troop is still limited to making one such attack per round unless stated otherwise. A troop can perform grapple and sunder combat maneuvers, but no other combat maneuvers, unless the troop’s description states otherwise.",
    "types": {
      "melee": 1
    },
    "format": "troop attack (1d4+10 P).",
    "id": "abilities.troop_attack"
  },
  {
    "name": "Troop Defenses",
    "ability_source": "universal_monster_rule",
    "description": "Troops take damage from attacks differently depending on how the attack targets them. A troop takes half damage from attacks that effect a single target (such as shot from a semi-auto pistol). A troop is immune to effects that target a specific number of creatures (including single-target spells and multiple-target spells such as haste ). A troop takes half again as much damage (+50%) from effects that affect all targets in an area, such as grenades, blast and explode weapons, and many evocation spells. A troop takes normal damage from an attack or effect that affects multiple targets (including lines and fully automatic mode attacks). For the purposes of the automatic weapon special property, a troop counts as five targets. For example, if an automatic attack is made using 12 rounds of ammunition, the attack affects a maximum of six targets, so it can damage a troop normally. However, if two other targets are closer to the attacker than the troop, they must be attacked first, leaving only four attacks to target the troop, so the troop takes no damage.",
    "types": {
      "defensive": 1
    },
    "format": "troop defenses.",
    "id": "abilities.troop_defenses"
  },
  {
    "name": "Troop Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Troops are immune to the following effects, unless the effect specifies it works against swarms or troops. Pinned, prone, staggered, and stunned. Combat maneuvers—a troop can’t be subject to combat maneuvers, unless it’s affected by area effects that include such effects or the troop’s description says otherwise. Flanking—troops are unflankable. Dying—a troop reduced to 0 Hit Points breaks up and is effectively destroyed, though individual members of it might survive.",
    "types": {
      "immunity": 1
    },
    "format": "troop immunities.",
    "id": "abilities.troop_immunities"
  },
  {
    "name": "Truespeech",
    "ability_source": "universal_monster_rule",
    "description": "The creature can speak with any other creature that has a language. This ability is always active.",
    "types": {
      "language": 1
    },
    "format": "truespeech.",
    "id": "abilities.truespeech"
  },
  {
    "name": "Undead Immunities",
    "ability_source": "universal_monster_rule",
    "description": "Undead are immune to the following effects, unless the effect specifies it works against undead creatures. Bleed, death effects, disease, mind-affecting effects, paralysis, poison, sleep, and stunning. Ability damage, ability drain, energy drain, exhaustion, fatigue, negative levels, and nonlethal damage. Any effect that requires a Fortitude save (unless the effect works on objects or is harmless).",
    "types": {
      "immunity": 1
    },
    "format": "undead immunities.",
    "id": "abilities.undead_immunities"
  },
  {
    "name": "Unflankable",
    "ability_source": "universal_monster_rule",
    "description": "Flanking the creature does not grant any bonuses, and abilities that function only against a creature that is flanked do not function against it.",
    "types": {
      "defensive": 1
    },
    "format": "unflankable.",
    "id": "abilities.unflankable"
  },
  {
    "name": "Unliving",
    "ability_source": "universal_monster_rule",
    "description": "The creature has no Constitution score or modifier. Any DCs or other statistics that rely on a Constitution score treat the creature as having a score of 10 (+0). The creature is immediately destroyed when it reaches 0 Hit Points. An unliving creature doesn’t heal damage naturally, but a construct can be repaired with the right tools. Spells such as make whole can heal constructs, and magic effects can heal undead. An unliving creature with fast healing still benefits from that ability. Unliving creatures don’t breathe, eat, or sleep. They can’t be raised or resurrected, except through the use of miracle, wish, or a similar effect that specifically works on unliving creatures.",
    "types": {
      "other": 1
    },
    "format": "unliving.",
    "id": "abilities.unliving"
  },
  {
    "name": "Void Adaptation",
    "ability_source": "universal_monster_rule",
    "description": "Numerous creatures are inured to the void of outer space. A creature with void adaptation has the following abilities. Immunity to cosmic rays. Immunity to the environmental effects of vacuum. No breath.",
    "types": {
      "defensive": 1
    },
    "format": "void adaptation.",
    "id": "abilities.void_adaptation"
  },
  {
    "name": "Vortex",
    "ability_source": "universal_monster_rule",
    "description": "A vortex ability works identically to the whirlwind ability , except the creature gains a swim speed instead of a fly speed, it can form only in a liquid (such as in water), it cannot leave a liquid medium, and it always blocks all vision within it and line of sight past it. In addition, carried creatures must have a swim speed in order to attempt a Reflex save to escape.",
    "types": {
      "offensive": 1
    },
    "format": "vortex (4d6+8 B, DC 15, 1/day).",
    "id": "abilities.vortex"
  },
  {
    "name": "Vulnerability",
    "ability_source": "universal_monster_rule",
    "description": "The creature takes half again as much damage (+50%) when it takes damage of a specific type. Creatures with a vulnerability to an effect that doesn’t deal damage instead take a –4 penalty to saves against spells and effects that cause or use the listed vulnerability (such as enchantments). Some creatures might suffer additional effects, as noted in their stat blocks.",
    "types": {
      "weakness": 1
    },
    "format": "vulnerable to fire.",
    "id": "abilities.vulnerability"
  },
  {
    "name": "Water Breathing",
    "ability_source": "universal_monster_rule",
    "description": "The creature can breathe water. It can’t breathe air unless it has the amphibious special ability.",
    "types": {
      "other": 1
    },
    "format": "water breathing.",
    "id": "abilities.water_breathing"
  },
  {
    "name": "Whirlwind",
    "ability_source": "universal_monster_rule",
    "description": "The creature can transform into a whirlwind as a standard action. Unless otherwise specified, the creature can remain in whirlwind form for a number of rounds equal to half its CR. If the creature has a fly speed, it retains that in its whirlwind form. If it does not have a fly speed, it gains an extraordinary fly speed (with average maneuverability) equal to its base speed. A creature in whirlwind form can move freely into and through other creatures’ spaces, and it does not provoke attacks of opportunity as a result of its movement. The base of a creature in whirlwind form occupies a 5-foot square. The whirlwind is twice as wide at its top as its base and has a height equal to four times the width of its base; this doesn’t change the size category of the creature. If a creature is Large or larger, it can vary the size of its whirlwind form up to a maximum of a base equal to its normal space as a swift or move action. A creature in whirlwind form does not threaten any spaces around it, and it cannot make its normal attacks. If a creature in whirlwind form enters the space of another creature, that creature must succeed at a Fortitude save with the listed DC or take the whirlwind’s listed damage. If the whirlwind covers all of the creature’s space, the creature must also succeed at a Reflex save or be picked up by the whirlwind and carried along with it. A carried creature is flat.footed, grappled, and off-target, and it automatically takes the whirlwindfs damage at the beginning of its turn. If the carried creature can fly, it can attempt a Reflex save as a move action, escaping on a successful save. If a carried creature does not escape, it can attempt a Fortitude save; if it succeeds, it can take any remaining actions it has on its turn (other than movement). On a failed save, the carried creature is unable to act until its next turn or until the whirlwind releases it. A creature in whirlwind form can carry up to two creatures of its size, with the total number it can carry doubling for every size category the affected creatures are smaller than the whirlwind. The creature in whirlwind form can eject a carried creature at any time during its turn, dropping the carried creature in a space of its choice adjacent to its position at the time of ejection. At the GMfs discretion, if the whirlwind is in contact with dirt, gases, water, or other material that can be easily drawn into it, the whirlwind blocks all vision within it (including darkvision) and blocks line of sight through it.",
    "types": {
      "offensive": 1
    },
    "format": "whirlwind (4d6+8 B, DC 15, 1/day).",
    "id": "abilities.whirlwind"
  },
  {
    "name": "Adaptive Defense",
    "ability_source": "alien_abilities",
    "description": [
      "When a tekhoinos takes acid, electricity, fire, or sonic damage, it gains resistance 10 to that damage type. This resistance does not apply to the triggering attack, and it lasts for 1 hour or until the tekhoinos takes damage of another of those types, triggering a new resistance. This resistance stacks with other sources of energy resistance."
    ],
    "types": {
      "defensive": 1
    },
    "format": "adaptive defense",
    "id": "abilities.adaptive_defense"
  },
  {
    "name": "Pattern Bind",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a tekhoinos can force a creature within 100 feet to repeat its actions unless it succeeds at a DC 19 Will saving throw. Whatever full, standard, or move actions the creature takes on its turn after being subjected to this effect, the target must repeat on the following turn. The creature must take the same actions in the same order (for example, moving its speed and casting a specific spell) and must act against the same target or targets. However, the creature doesn’t have to make exactly the same choices (such as moving the same number of squares or choosing the same command for the",
      "command",
      "spell). If the target is unable to repeat an action, it is unable to act and its turn ends immediately. A creature that is affected by pattern bind can’t delay, and if it readies an action on the first turn it is affected, it must ready the same action on its following turn using the same trigger. Whether or not a creature succeeds at its saving throw against this ability, it is immune to further instances of this effect for 24 hours."
    ],
    "types": {
      "offensive": 1
    },
    "format": "pattern bind",
    "id": "abilities.pattern_bind"
  },
  {
    "name": "Telekinetic Blast",
    "ability_source": "alien_abilities",
    "description": [
      "A tekhoinos’s telekinetic blast has a range increment of 50 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "telekinetic blast +21 (2d8+10 B; critical knockdown)",
    "id": "abilities.telekinetic_blast"
  },
  {
    "name": "Blood Drain",
    "ability_source": "alien_abilities",
    "description": [
      "If a void zombie hits a living creature with its feeding tendril, it drains that creature’s blood, dealing 2 Strength damage before the tendril detaches."
    ],
    "types": {
      "melee": 1
    },
    "format": "feeding tendril +8 (1d6+5 P plus blood drain)",
    "id": "abilities.blood_drain"
  },
  {
    "name": "Susceptible to Salt Water",
    "ability_source": "alien_abilities",
    "description": [
      "A splash of salt water deals 1d6 damage to a void zombie, and full immersion in salt water deals 4d6 damage per round."
    ],
    "types": {
      "weakness": 1
    },
    "format": "susceptible to salt water",
    "id": "abilities.susceptible_to_salt_water"
  },
  {
    "name": "Language Assimilation",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite ambassador can spend 1 minute accessing a planet’s infosphere to learn any language commonly spoken on that planet. Alternatively, the anacite can learn a language by spending 1 day listening to it and reading it. An anacite ambassador can store knowledge of up to four languages at a time in this way, and it can choose which language to replace when it wants to learn a new one."
    ],
    "types": {
      "other": 1
    },
    "format": "language assimilation",
    "id": "abilities.language_assimilation"
  },
  {
    "name": "Light Dependency",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite ambassador can acquire power from dim or brighter light, and it can store power generated in this way. The anacite can operate in darkness for 2 hours. After this time, the anacite gains the sickened condition until it returns to an area of dim or brighter light."
    ],
    "types": {
      "weakness": 1
    },
    "format": "light dependency",
    "id": "abilities.light_dependency"
  },
  {
    "name": "Retractable Laser",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite ambassador’s retractable laser has a range increment of 90 feet. When not in use, this weapon is folded inside the anacite’s arm and hidden from sight. A creature unaware of the anacite’s hidden weapon must succeed at a DC 24 Perception check to find its compartment. The anacite can deploy or retract this weapon as a swift action or as part of making an attack or full attack. The weapon is mounted and leaves the anacite’s hands free, and the anacite can’t be disarmed of it. While deployed, the laser can be sundered as an item with a level equal to the anacite’s CR."
    ],
    "types": {
      "defensive": 1,
      "ranged": 1
    },
    "format": "retractable laser +15 (1d6+6 F; critical burn 1d4)",
    "id": "abilities.retractable_laser"
  },
  {
    "name": "Shortwave",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite can communicate wirelessly. This acts as telepathy, but only with other creatures with this ability or constructs with the technological subtype."
    ],
    "types": {
      "languages": 1
    },
    "format": "up to four others; shortwave 100 ft.",
    "id": "abilities.shortwave"
  },
  {
    "name": "Reconfigure",
    "ability_source": "alien_abilities",
    "description": [
      "Anacite laborers are capable of adapting and improving their designs. An anacite laborer has a number of built-in abilities equal to its CR divided by 3 (minimum 1), chosen from the list below. An anacite laborer can change these abilities by spending 1 uninterrupted hour for each ability it wants to change. The anacite laborer must also have access to an appropriate workspace for the duration. An ability can be gained only once unless stated otherwise. In addition, modifications other than those listed here might exist.",
      "Advanced treads that increase its base speed to 60 feet.A sensor that grants blindsight (vibration) 120 feet.Elongated arms that extend its reach by 5 feet.A modified chassis that grants a burrow, climb, or swim speed equal to its base speed. This ability can be taken multiple times. Its effects do not stack. Each time it is taken, it applies to a new movement type.Reinforced systems granting resistance 10 against a single energy type (acid, cold, electricity, fire, or sonic). This ability can be taken multiple times. Its effects do not stack. Each time it is taken, it applies to a new energy type.Specialized plating that increases its AC by 2."
    ],
    "types": {
      "other": 1
    },
    "format": "reconfigure",
    "id": "abilities.reconfigure"
  },
  {
    "name": "Sunlight Dependency",
    "ability_source": "alien_abilities",
    "description": [
      "Anacites are solar-powered constructs, although they can function at reduced capacity away from light. In areas of darkness, they gain the sickened condition."
    ],
    "types": {
      "weakness": 1
    },
    "format": "sunlight dependency",
    "id": "abilities.sunlight_dependency"
  },
  {
    "name": "Automatic Laser",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite predator drone’s automatic laser can fire in automatic mode each round at up to five targets. The weapon has a range increment of 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "integrated automatic laser +20 (4d4+10 F; critical 2d4 burn)",
    "id": "abilities.automatic_laser"
  },
  {
    "name": "Electric Ray",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite predator drone’s electric ray has a range increment of 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "integrated electric ray +20 (3d6+10 E; critical 2d6 arc)",
    "id": "abilities.electric_ray"
  },
  {
    "name": "Target Lock",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, an anacite predator drone can lock on to a target within 60 feet that it can see. The anacite can have only one locked target at a time. Against the anacite’s attacks, a locked target gains no benefit from concealment less than total concealment, and a locked target reduces its bonus to AC due to cover by 2."
    ],
    "types": {
      "offensive": 1
    },
    "format": "target lock",
    "id": "abilities.target_lock"
  },
  {
    "name": "Trill",
    "ability_source": "alien_abilities",
    "description": [
      "An anacite wingbot can create a shrill trilling noise as a standard action. Any creature within 30 feet, other than anacite wingbots, must succeed at a DC 9 Fortitude saving throw or be sickened for 1d3 rounds. Whether successful or not, a creature can’t be affected by the same anacite wingbot’s trill for 24 hours."
    ],
    "types": {
      "offensive": 1
    },
    "format": "trill",
    "id": "abilities.trill"
  },
  {
    "name": "Firewall",
    "ability_source": "alien_abilities",
    "description": [
      "A barachius can summon a wall of digitally empowered divine fury within 30 feet as a standard action. This wall takes the shape of a line 10 feet high and 20 feet long; though it doesn’t need to emanate from the angel, the angel must be able to see every square the wall passes through. The wall lasts until the beginning of the angel’s next turn. An evil creature caught within or that enters one of the wall’s squares takes 2d6 damage (Will DC 17 half). An evil creature with the technological subtype takes twice this amount of damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "firewall",
    "id": "abilities.firewall"
  },
  {
    "name": "Protective Aura",
    "ability_source": "alien_abilities",
    "description": [
      "Any creature within 20 feet of a barachius (including the angel itself) gains a +2 divine bonus to its AC against attacks made by evil creatures and a +4 divine bonus to saving throws against effects created by evil creatures."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.protective_aura"
  },
  {
    "name": "Upgrade",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a barachius can touch a willing ally who is wielding a technological weapon or wearing technological armor. That creature receives a +1 divine bonus to attack rolls or to its AC (target’s choice). This bonus last for 3 rounds and cannot be dispelled."
    ],
    "types": {
      "other": 1
    },
    "format": "upgrade",
    "id": "abilities.upgrade"
  },
  {
    "name": "Comm",
    "ability_source": "alien_abilities",
    "description": [
      "Animated lashunta mind mail III can receive wireless communications (and thus commands from its allies and creator) at planetary range."
    ],
    "types": {
      "other": 1,
      "languages": 1
    },
    "format": "Common",
    "id": "abilities.comm"
  },
  {
    "name": "Fungible",
    "ability_source": "alien_abilities",
    "description": [
      "An apari constituent can change its physiology to take advantage of its opponent’s weaknesses. As a move action, it can alter the type of kinetic damage it deals with its claw attack (bludgeoning, piercing, or slashing)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "fungible",
    "id": "abilities.fungible"
  },
  {
    "name": "Hive Dependency",
    "ability_source": "alien_abilities",
    "description": [
      "An apari constituent can’t voluntarily travel more than 200 feet from the apari that spawned it. If taken beyond that range against its will, it gains the sickened condition and becomes single-minded in its focus on returning to its apari. An apari constituent can survive for only 1 hour after the apari that spawned it dies (unless it finds another apari)."
    ],
    "types": {
      "weakness": 1
    },
    "format": "hive dependency",
    "id": "abilities.hive_dependency"
  },
  {
    "name": "Reincorporate",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, an apari constituent adjacent to an apari can become part of the hive once again. The constituent’s current Hit Points are added to the apari’s, and the constituent is removed from play."
    ],
    "types": {
      "other": 1
    },
    "format": "reincorporate",
    "id": "abilities.reincorporate"
  },
  {
    "name": "Aura of Menace",
    "ability_source": "alien_abilities",
    "description": [
      "Any creature hostile to the power archon within its aura of menace must attempt a Will saving throw. A creature that fails the save takes a –2 penalty to AC, attack rolls, and saving throws for 24 hours or until it deals damage to the archon. When the effect ends for a creature, that creature can’t be affected again by the same archon’s aura for 24 hours."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.aura_of_menace"
  },
  {
    "name": "Electric Bolt",
    "ability_source": "alien_abilities",
    "description": [
      "The power archon can unleash an electric bolt as a melee attack or ranged attack. Both versions can be used to deal nonlethal damage without penalty. The ranged attack has a range increment of 30 feet."
    ],
    "types": {
      "melee": 1,
      "ranged": 1
    },
    "format": "electric bolt +13 (1d4+5 E; critical arc 1d4)",
    "id": "abilities.electric_bolt"
  },
  {
    "name": "Remote Operations",
    "ability_source": "alien_abilities",
    "description": [
      "A power archon can attempt Computers and Engineering checks at a range of 30 feet. A creature targeted by the archon or a creature attending or observing the archon’s target can discern what the archon is doing with a successful DC 15 Perception check."
    ],
    "types": {
      "other": 1
    },
    "format": "remote operations",
    "id": "abilities.remote_operations"
  },
  {
    "name": "Brighten",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, a tritidair can shed bright light in a 20-foot radius, normal light for an additional 20 feet, and dim light for another 20 feet. The tritidair can shut this light off as a move action, and the light goes out if the azata falls unconscious or dies."
    ],
    "types": {
      "other": 1
    },
    "format": "brighten",
    "id": "abilities.brighten"
  },
  {
    "name": "Light Ray",
    "ability_source": "alien_abilities",
    "description": [
      "A tritidair’s light ray has a range increment of 90 feet. This attack’s damage is good-aligned, so it ignores the energy resistance of evil dragons, evil outsiders, and evil undead."
    ],
    "types": {
      "ranged": 1
    },
    "format": "light ray +16 (1d10+8 E & F; critical blind [DC 18, 1d3 rounds])",
    "id": "abilities.light_ray"
  },
  {
    "name": "Starlight Form",
    "ability_source": "alien_abilities",
    "description": [
      "By focusing and using every action to move for 1 minute, a tritidair can shift its form to starlight—a massless state of pure energy in which the azata can only move and can’t be harmed. While in this form, a tritidair moves at standard navigation and astrogation rates, like a starship, and it uses Mysticism in place of Piloting to astrogate. A tritidair in this form can pass through material objects, provided it begins and ends its turn outside such an object. In addition, a tritidair can enter a star or gas giant and exit another star or gas giant with no restriction on the distance between those bodies. This travel is instantaneous if the tritidair employs it to move within the same system. Otherwise, this travel takes an amount of time equal to Drift travel for the same distance as if the tritidair had a Drift engine rating of 5. A tritidair in starlight form can assume its normal form as a move action, and it resumes its normal form if it somehow falls unconscious or dies."
    ],
    "types": {
      "other": 1
    },
    "format": "starlight form",
    "id": "abilities.starlight_form"
  },
  {
    "name": "Starlight Gaze",
    "ability_source": "alien_abilities",
    "description": [
      "A tritidair’s eyes sparkle with hypnotic starlight. Tritidairs wear special goggles to subdue this gaze, but a tritidair can remove these goggles as a swift action. A creature that fails its save against the gaze is fascinated for 1 round. If a creature succeeds at two saving throws against this effect, the same tritidair’s gaze can’t affect that creature for 24 hours. Azatas are immune to this gaze. This is a mind-affecting effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "starlight gaze (60 ft., DC 18)",
    "id": "abilities.starlight_gaze"
  },
  {
    "name": "Along for the Ride",
    "ability_source": "alien_abilities",
    "description": [
      "Early stage barathus are not experienced enough to helpfully combine with mature barathus but can still physically merge with them for protection. An early stage barathu can combine with a mature barathu via the latter’s combine ability. Early stage barathus that are part of a combined creature contribute their Hit Points but not adaptations."
    ],
    "types": {
      "other": 1
    },
    "format": "along for the ride",
    "id": "abilities.along_for_the_ride"
  },
  {
    "name": "Early Stage Adaptation",
    "ability_source": "alien_abilities",
    "description": [
      "An early stage barathu’s body is mutable and can adapt to many different situations. Once every 1d4 rounds as a swift action, an early stage barathu can reshape its body and adjust its chemistry to gain one of the following qualities. The adaptation lasts until the beginning of the early stage barathu’s next turn. Unlike more mature barathus, early stage barathus are not generally capable of more complex adaptations.",
      "Upper limb refinements enable the barathu to add an additional amount of damage to melee attacks equal to its Strength modifier.A toughened dermal layer grants its a +1 racial bonus to AC.Developed lower limbs grant it a base speed of 15 feet.Molecular-level modifications grant it resistance 2 against a single energy type (acid, cold, electricity, fire, or sonic).Elongated limbs extend its reach to 10 feet."
    ],
    "types": {
      "other": 1
    },
    "format": "early stage adaptation",
    "id": "abilities.early_stage_adaptation"
  },
  {
    "name": "Bodysnatch",
    "ability_source": "alien_abilities",
    "description": [
      "This ability functions as the bodysnatcher slime ability, but the autocrat can infest a Medium, Large, or Huge creature (Fortitude DC 19 negates). The autocrat can also use any of the creature’s supernatural abilities. It takes a DC 25 Medicine check to expel an autocrat, and each failed check deals the host 2d6 damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "bodysnatch",
    "id": "abilities.bodysnatch"
  },
  {
    "name": "Neural Integration",
    "ability_source": "alien_abilities",
    "description": [
      "This ability functions as the bodysnatcher slime ability, but the skill bonus is +19."
    ],
    "types": {
      "languages": 1
    },
    "format": "See neural integration",
    "id": "abilities.neural_integration"
  },
  {
    "name": "Share Body",
    "ability_source": "alien_abilities",
    "description": [
      "This ability functions as the bodysnatcher slime ability, but the autocrat leaves the host only after taking 70 or more damage."
    ],
    "types": {
      "defensive": 1
    },
    "format": "share body;",
    "id": "abilities.share_body"
  },
  {
    "name": "Defensive Ball",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, a bolida can roll its body into a nearly impenetrable defensive ball. While rolled up this way, a bolida can only uncurl itself as a move action, take the total defense action, or use its rolling charge ability. If the bolida takes the total defense action, its bonus to AC is increased to +5."
    ],
    "types": {
      "defensive": 1
    },
    "format": "defensive ball;",
    "id": "abilities.defensive_ball"
  },
  {
    "name": "Rolling Charge",
    "ability_source": "alien_abilities",
    "description": [
      "A bolida that is rolled up in a defensive ball can charge without taking the normal charge penalties to the attack roll or its AC, and it gains a +5 circumstance bonus to AC against attacks of opportunity during its movement. It can’t make a melee attack at the end of its movement, but it can instead attempt either a bull rush or reposition combat maneuver against its target with a +4 circumstance bonus to the attack roll. A bolida can’t use this ability again until it takes a 10-minute rest to recover Stamina Points."
    ],
    "types": {
      "offensive": 1
    },
    "format": "rolling charge",
    "id": "abilities.rolling_charge"
  },
  {
    "name": "Otherworldly Mind",
    "ability_source": "alien_abilities",
    "description": [
      "Any non-plant creature attempting to read a cerebric fungus’s mind with a divination spell or similar effect must succeed at the listed Will save or be overwhelmed by its alien thoughts. A creature that fails takes 1d6 damage and is confused for 1d3 rounds, and the divination effect immediately ends."
    ],
    "types": {
      "defensive": 1
    },
    "format": "otherworldly mind (DC 18);",
    "id": "abilities.otherworldly_mind"
  },
  {
    "name": "Star Shriek",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a cerebric fungus can unleash a shrill scream in tones that are difficult for minds to process. Each non-plant creature within 30 feet must succeed at the listed Will save or be nauseated for 1 round. This is a sonic, mind-affecting effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "star shriek (DC 18)",
    "id": "abilities.star_shriek"
  },
  {
    "name": "Unsettling Appearance",
    "ability_source": "alien_abilities",
    "description": [
      "A cerebric fungus constantly scans the minds of those around it, projecting around itself a confusing collage of images gleaned from their thoughts. Each creature within 60 feet that can see the fungus must succeed at the listed Will save or be off-target while within the aura’s radius. A creature that succeeds at a save against a cerebric fungus’s unsettling appearance is immune to this effect for 24 hours. This is a mind-affecting effect."
    ],
    "types": {
      "aura": 1
    },
    "format": "unsettling appearance (60 ft., DC 18)",
    "id": "abilities.unsettling_appearance"
  },
  {
    "name": "Applied Knowledge",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day before attempting a skill check or saving throw against a creature, a contemplative can use its bonus for the skill associated with that creature’s type (such as Life Science for an ooze or Mysticism for an outsider) in place of its normal bonus."
    ],
    "types": {
      "offensive": 1
    },
    "format": "applied knowledge",
    "id": "abilities.applied_knowledge"
  },
  {
    "name": "Atrophied",
    "ability_source": "alien_abilities",
    "description": [
      "A contemplative’s limbs are practically vestigial. A contemplative can manipulate most tools and one-handed weapons (including small arms) without difficulty. A contemplative can’t properly wield a two-handed weapon without dedicating its telekinetic powers to supporting the weapon, and even then it takes a –4 penalty to attack rolls. It also can’t use its spell-like abilities or fly until it is no longer wielding that weapon."
    ],
    "types": {
      "weakness": 1
    },
    "format": "atrophied",
    "id": "abilities.atrophied"
  },
  {
    "name": "Empathic Bond",
    "ability_source": "alien_abilities",
    "description": [
      "Damai Guardians have an empathic connection with each other that lasts for life. If a Guardian spends 1 round concentrating while thinking about another specific Guardian, she can learn that individual’s relative position and general condition, as per the status spell. Additionally, when she uses this ability, the Guardian learns the other individual’s general emotional state and its intensity, such as whether the target is mildly content, moderately worried, intensely distraught, or similar."
    ],
    "types": {
      "other": 1
    },
    "format": "empathic bond",
    "id": "abilities.empathic_bond"
  },
  {
    "name": "Scrappy",
    "ability_source": "alien_abilities",
    "description": [
      "Generations of living together in underground shelters and under the constant threat of enormous creatures have taught damais to work together against all odds. Once per day, as long as an ally is within 10 feet, a damai can reroll a failed attack roll or saving throw."
    ],
    "types": {
      "defensive": 1
    },
    "format": "scrappy",
    "id": "abilities.scrappy"
  },
  {
    "name": "Bristle",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, an adolescent defrex can flare its spines. Until the start of the defrex’s next turn, any adjacent creature that attacks the defrex takes 1d6+7 piercing damage. If the defrex is flat-footed, the attacker can avoid this damage with a successful DC 15 Reflex save."
    ],
    "types": {
      "defensive": 1
    },
    "format": "bristle;",
    "id": "abilities.bristle"
  },
  {
    "name": "Sabotaging Compulsion",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a flashfire demon can compel a creature to covertly commit sabotage. If the target fails a DC 21 Will saving throw, it begins enacting a plan dictated by the flashfire demon to cause maximum loss of sapient life with a minimum chance of detection. The compelled creature makes all efforts to avoid being discovered, including acting normally while being observed and eliminating evidence of its actions. It retains no memory of the sabotage it enacts or the demon. This effect lasts for 12 days. However, at the end of each day, as well as when the target undertakes any action that threatens its own safety, the target can attempt a new saving throw to end the effect. Once the effect ends, no flashfire demon can affect the creature with this ability for 24 hours. This is a mind-affecting effect, but non-mindless undead are not immune to it."
    ],
    "types": {
      "offensive": 1
    },
    "format": "sabotaging compulsion (DC 21)",
    "id": "abilities.sabotaging_compulsion"
  },
  {
    "name": "Invoke Mutation",
    "ability_source": "alien_abilities",
    "description": [
      "A pluprex can wrack a living creature by biting it. The creature bitten must attempt a DC 21 Fortitude save. On a success, the creature is merely sickened for 1 round. On a failure, the victim’s body undergoes several swift and painful mutations that twist limbs, alter organs, and distort features into a hideous countenance, giving it the overburdened condition for 1 minute. After this minute elapses, the creature becomes accustomed to its twisted new body, but it gains the encumbered condition permanently. This is a curse effect; its effects do not stack."
    ],
    "types": {
      "melee": 1,
      "offensive": 1,
      "multiattack": 1
    },
    "format": "bite +17 (3d4+19 P plus invoke mutation)",
    "id": "abilities.invoke_mutation"
  },
  {
    "name": "Irradiate Dead",
    "ability_source": "alien_abilities",
    "description": [
      "Undead creatures created by a pluprex are radioactive, emitting low radiation in a 20-foot radius. Once per day as a standard action, a pluprex can touch an undead creature it has created to enhance that creature’s radioactive aura, permanently increasing that creature’s radioactivity to medium. A pluprex cannot enhance radiation in this way to a higher level. Alternatively, the pluprex can give any undead creature a medium radioactive aura by touching it, but such auras last for only 24 hours before fading."
    ],
    "types": {
      "other": 1
    },
    "format": "irradiate dead",
    "id": "abilities.irradiate_dead"
  },
  {
    "name": "Radiation Aura",
    "ability_source": "alien_abilities",
    "description": [
      "A pluprex emits medium radiation in a 20-foot radius. Once per day as a swift action, a pluprex can instead emit high radiation for 1 minute."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.radiation_aura"
  },
  {
    "name": "Irradiation",
    "ability_source": "alien_abilities",
    "description": [
      "A creature bitten by a prexian mutantspawn or wounded by a melee weapon a mutantspawn carries must succeed at a DC 20 Fortitude save or be exposed to a sudden pulse of supernatural radiation. This functions as medium radiation that affects only the mutantspawn’s target."
    ],
    "types": {
      "melee": 1
    },
    "format": "numbing taclash +20 (5d4 S plus irradiation)",
    "id": "abilities.irradiation"
  },
  {
    "name": "Twinkle",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a move action, a dessamar can teleport 40 feet. The dessamar can’t bring other creatures along, and if a solid body occupies the arrival point, the ability fails without expending its daily use. This ability otherwise functions as the",
      "dimension door",
      "spell."
    ],
    "types": {
      "offensive": 1
    },
    "format": "twinkle",
    "id": "abilities.twinkle"
  },
  {
    "name": "Cargo Cavity",
    "ability_source": "alien_abilities",
    "description": [
      "A dhalochar has a sizable cavity within its body. This space can comfortably fit eight Large or smaller creatures (or four Huge creatures). Any creature inside is protected from the external environment, no matter how hostile, and can breathe as normal. A dhalochar has control over what enters and what leaves its cargo cavity. Entering or leaving a willing dhalochar requires a full action, during which the dhalochar cannot move. Creatures cannot enter an uncooperative dhalochar, but they can try to escape from inside as if they were attempting to escape being grappled.",
      "Alternatively, some dhalochars have this cavity replaced with a device capable of generating minor passages to Hell. This grants them the ability to cast 6th-level",
      "planar binding",
      "as a spell-like ability once per hour (to a maximum number of times per day equal to the dhalochar’s Constitution modifier—nine times per day for most dhalochars), except they can call only devils. Called devils aren’t trapped by this ability, and they aren’t forced to do the dhalochar’s bidding, though they are usually friendly to the dhalochar."
    ],
    "types": {
      "other": 1
    },
    "format": "cargo cavity",
    "id": "abilities.cargo_cavity"
  },
  {
    "name": "Construct Form",
    "ability_source": "alien_abilities",
    "description": [
      "Despite being true devils, dhalochars have a number of immunities common to constructs. They are immune to ability damage, ability drain, death effects, disease, energy drain, exhaustion, fatigue, necromancy effects, negative levels, nonlethal damage, paralysis, sleep, and stunning."
    ],
    "types": {
      "defensive": 1
    },
    "format": "construct form;",
    "id": "abilities.construct_form"
  },
  {
    "name": "Hellfire Glare",
    "ability_source": "alien_abilities",
    "description": [
      "As an attack, a dhalochar can shoot hellfire from its eyes at a single target. This attack has a range increment of 120 feet. The glare acts as if it had the",
      "unholy",
      "fusion."
    ],
    "types": {
      "ranged": 1
    },
    "format": "hellfire glare +34 (8d8+19 F; critical burn 5d6)",
    "id": "abilities.hellfire_glare"
  },
  {
    "name": "Electrical Discharge",
    "ability_source": "alien_abilities",
    "description": [
      "A lislaroth can fire an electrical bolt as a ranged attack with a range increment of 40 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "electrical discharge +19 (3d4+10 E)",
    "id": "abilities.electrical_discharge"
  },
  {
    "name": "Possess Computer",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action that provokes attacks of opportunity, a lislaroth can convert its body and gear into digital code and merge with a computer to which it has access. This ability fails if the devil is encumbered. While possessing a computer, the devil has total cover and is immune to any effect that requires it to have a body. A lislaroth can use the Computers skill on the possessed system. The devil firsts attempts to disable and impersonate any artificial personality the system has. If the computer is destroyed, the possession ends unless the devil can use a reaction to flee to a connected system.",
      "While possessing a computer, a lislaroth can be found and rooted out as though it were a module of a computer (tier = 1/2 the devil’s CR) behind a fake shell and with feedback and firewall countermeasures. A revealed lislaroth can be forced out of a possessed computer with a successful DC 33 Computers check. A dismissal spell cast on the computer can force the lislaroth back to Hell, but if the spell would send the devil to a random plane, the devil is instead forced to end the possession. When the possession ends, the devil appears in an unoccupied space as close to the computer as possible.",
      "When it exits a computer, the lislaroth can take a reaction to leave behind a",
      "software imp",
      "of an item level equal to half the devil’s CR."
    ],
    "types": {
      "other": 1
    },
    "format": "possess computer",
    "id": "abilities.possess_computer"
  },
  {
    "name": "Technomagical Susceptibility",
    "ability_source": "alien_abilities",
    "description": [
      "Any effect that works on a construct works on a lislaroth. An effect that works on a construct and an outsider has the worst possible effect."
    ],
    "types": {
      "weakness": 1
    },
    "format": "technomagical susceptibility",
    "id": "abilities.technomagical_susceptibility"
  },
  {
    "name": "Hellstrider",
    "ability_source": "alien_abilities",
    "description": [
      "Difficult terrain doesn’t hamper a levaloch’s movement."
    ],
    "types": {
      "other": 1
    },
    "format": "hellstrider",
    "id": "abilities.hellstrider"
  },
  {
    "name": "Merciless Blow",
    "ability_source": "alien_abilities",
    "description": [
      "If a levaloch hits an entangled foe with an attack, the target takes 2d6 additional damage of the same type."
    ],
    "types": {
      "offensive": 1
    },
    "format": "merciless blow",
    "id": "abilities.merciless_blow"
  },
  {
    "name": "Phalanx",
    "ability_source": "alien_abilities",
    "description": [
      "Devils gain a +1 morale bonus to attack rolls and AC while adjacent to a levaloch."
    ],
    "types": {
      "other": 1
    },
    "format": "phalanx",
    "id": "abilities.phalanx"
  },
  {
    "name": "Darkwater Veil",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, a diaspora wyrm can alter the structure of water within a 20-foot-radius spread so that it forms nanotubes that absorb light. This field moves with the wyrm, obscuring most sight and providing total concealment. A creature that has darkvision treats the field within 5 feet as if it provides only concealment. Magical light from a source of a higher level or CR than the wyrm’s negates the effect while the two interact. The wyrm can dismiss the field as a move action, and the field ends after 1 minute if the wyrm takes no action to renew it."
    ],
    "types": {
      "defensive": 1
    },
    "format": "darkwater veil;",
    "id": "abilities.darkwater_veil"
  },
  {
    "name": "Electrocommunication",
    "ability_source": "alien_abilities",
    "description": [
      "Diaspora wyrms communicate by shaping and reading electromagnetic fields. This functions as telepathy among creatures with this ability."
    ],
    "types": {
      "languages": 1
    },
    "format": "electrocommunication 300 ft.",
    "id": "abilities.electrocommunication"
  },
  {
    "name": "Electromagnetic Blindness",
    "ability_source": "alien_abilities",
    "description": [
      "To a diaspora wyrm, a strong electromagnetic field (such as high radiation) acts like fog. Electricity damage forces the wyrm to succeed at a Fortitude saving throw (DC = 10 + the damage taken) or be blinded for 1 round. Multiple failures during the same round do not extend this duration. It can also communicate through technological communication devices and to technological constructs."
    ],
    "types": {
      "weakness": 1
    },
    "format": "electromagnetic blindness",
    "id": "abilities.electromagnetic_blindness"
  },
  {
    "name": "Tongue",
    "ability_source": "alien_abilities",
    "description": [
      "A diaspora wyrm can use its long, sticky tongue to make a melee attack that targets EAC. A creature hit by this attack becomes stuck to the wyrm’s tongue, gaining the grappled condition until it escapes, or until the diaspora wyrm releases the creature as a swift action. While a creature is grappled as a result of this attack, the diaspora wyrm can attempt reposition combat maneuvers against that creature, but only to move it toward the diaspora wyrm. If the wyrm succeeds at such a maneuver and the creature is within range of the wyrm’s bite attack at the end of the movement, the wyrm can make a bite attack as part of that maneuver. Additionally, while a creature is grappled this way, the diaspora wyrm can use its bite attack only against the grappled creature, and it can’t use its tongue attack."
    ],
    "types": {
      "melee": 1
    },
    "format": "bite +32 (6d12+24 P) tongue +32 (special)",
    "id": "abilities.tongue"
  },
  {
    "name": "Buoyant",
    "ability_source": "alien_abilities",
    "description": [
      "A diatha elder can hover as a swift action or part of a full action without needing to attempt an Acrobatics check. It can avoid falling damage as if it had perfect maneuverability."
    ],
    "types": {
      "other": 1
    },
    "format": "buoyant",
    "id": "abilities.buoyant"
  },
  {
    "name": "Detonate",
    "ability_source": "alien_abilities",
    "description": [
      "While the diatha has 20 or fewer Hit Points, its energy-dense flesh becomes unstable. If, while in this state, the diatha takes acid, electricity, fire, piercing, slashing, or sonic damage, or uses its explosive charge ability, it dies, exploding in a 10-foot-radius burst, dealing 2d6 fire damage and causes the burning condition dealing 1d4 fire damage (Reflex DC 13 for half damage and no burning condition)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "detonate",
    "id": "abilities.detonate"
  },
  {
    "name": "Explosive Charge",
    "ability_source": "alien_abilities",
    "description": [
      "While the diatha has 20 or fewer Hit Points, as a full action, the creature can move up to double its speed and make a bite attack. Its detonate ability then triggers."
    ],
    "types": {
      "offensive": 1
    },
    "format": "explosive charge",
    "id": "abilities.explosive_charge"
  },
  {
    "name": "Pounce",
    "ability_source": "alien_abilities",
    "description": [
      "When a dromaeosaurid charges, it can also make a full attack."
    ],
    "types": {
      "offensive": 1
    },
    "format": "pounce",
    "id": "abilities.pounce"
  },
  {
    "name": "Sound Imitation",
    "ability_source": "alien_abilities",
    "description": [
      "A blue dragon can mimic any voice or sound it has heard by succeeding at a Bluff check opposed by a listener’s Sense Motive check."
    ],
    "types": {
      "other": 1
    },
    "format": "sound imitation",
    "id": "abilities.sound_imitation"
  },
  {
    "name": "Cloudwalking",
    "ability_source": "alien_abilities",
    "description": [
      "A silver dragon can tread on clouds or fog as though on solid ground."
    ],
    "types": {
      "speed": 1
    },
    "format": "fly 200 ft. (Ex, clumsy); cloudwalking",
    "id": "abilities.cloudwalking"
  },
  {
    "name": "Paralyzing Breath",
    "ability_source": "alien_abilities",
    "description": [
      "Instead of a cone of cold, a silver dragon can breathe a 30-foot cone of paralyzing gas. Each creature within the cone that inhales the gas must succeed at a Fortitude save or be paralyzed for 1d6 rounds plus a number of additional rounds equal to half the dragon’s CR."
    ],
    "types": {
      "offensive": 1
    },
    "format": "paralyzing breath (30-ft cone, 1d6+7 rounds, DC 22)",
    "id": "abilities.paralyzing_breath"
  },
  {
    "name": "Obliterate",
    "ability_source": "alien_abilities",
    "description": [
      "A creature that is reduced to 0 Hit Points by a void dragon’s bite attack must spend 1 Resolve point or be immediately slain and reduced to dust."
    ],
    "types": {
      "melee": 1,
      "multiattack": 1
    },
    "format": "bite +25 (4d8+29 P plus obliterate)",
    "id": "abilities.obliterate"
  },
  {
    "name": "Suffocating Breath",
    "ability_source": "alien_abilities",
    "description": [
      "Instead of a cone of cold, a void dragon can breathe a 30-foot cone of energy that suffocates those it touches. Air-breathing creatures within the cone must succeed at a Fortitude save or begin attempting Constitution checks to avoid",
      "suffocation",
      ", even if they have environmental protections.",
      "An affected creature can attempt a new Fortitude saving throw at the beginning of each turn to shake off this effect and regain its air supply."
    ],
    "types": {
      "offensive": 1
    },
    "format": "suffocating breath (DC 25)",
    "id": "abilities.suffocating_breath"
  },
  {
    "name": "Temporal Anomaly",
    "ability_source": "alien_abilities",
    "description": [
      "On its turn, a horacalcum dragon can shorten or extend the duration of any ongoing effect within 10 feet of it (including an effect on itself); this takes no action, and the number of rounds by which the dragon can alter the duration is equal to one-fourth its CR (minimum 1). If the effect is on an unwilling target, that target can attempt a Will saving throw to negate this effect. A horacalcum dragon can shorten or extend one effect per turn, and it can affect a given effect only once."
    ],
    "types": {
      "aura": 1
    },
    "format": "temporal anomaly (10 ft., rounds, Will DC 23)",
    "id": "abilities.temporal_anomaly"
  },
  {
    "name": "Atomic Bolt",
    "ability_source": "alien_abilities",
    "description": [
      "A radiation drake’s atomic bolt has a range increment of 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "atomic bolt +19 (3d10+3 F plus radiation exposure; critical burn 2d6)",
    "id": "abilities.atomic_bolt"
  },
  {
    "name": "Radiation Exposure",
    "ability_source": "alien_abilities",
    "description": [
      "A creature that takes Hit Point damage from the radiation drake’s attacks is exposed to medium radiation. This radiation bypasses armor environmental protections."
    ],
    "types": {
      "melee": 1,
      "ranged": 1,
      "offensive": 1,
      "multiattack": 1
    },
    "format": "bite +16 (2d10+15 P plus radiation exposure)",
    "id": "abilities.radiation_exposure"
  },
  {
    "name": "Reshape Matter",
    "ability_source": "alien_abilities",
    "description": [
      "A Drift architect has extensive control over the matter in its vicinity and can deconstruct it at will. As a full action while in the Drift, a Drift architect can reshape the matter in a 30-foot cone. Each creature and unattended object in the area that is not native to the Drift must succeed at a DC 19 Fortitude save or take 6d10 acid damage; this damage ignores hardness and nonmagical damage reduction. A creature that fails this save by 5 or more is also subject to the wound critical hit effect; that creature can attempt an additional save against that effect at the same DC."
    ],
    "types": {
      "offensive": 1
    },
    "format": "reshape matter",
    "id": "abilities.reshape_matter"
  },
  {
    "name": "Traverse Space",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a Drift architect can teleport through the Drift instantaneously, appearing wherever it wishes with perfect accuracy. It can bring up to 6 willing or unconscious creatures with it, as per",
      "teleport",
      "."
    ],
    "types": {
      "other": 1
    },
    "format": "traverse space",
    "id": "abilities.traverse_space"
  },
  {
    "name": "Steal Momentum",
    "ability_source": "alien_abilities",
    "description": [
      "When a time eater hits a creature with its tentacle attack, its fly speed increases by 10 feet for 1 minute and its penalties for a full attack decreases by 1 (to a minimum of zero). These adjustments are cumulative. In addition, a creature hit by a time eater’s tentacle attack must attempt a DC 13 Will save. The first time a creature fails this save, its speeds decrease by 10 feet (to a minimum of 0). The second time, it gains the staggered condition. The third time and each time thereafter, it gains the paralyzed condition. These effects are cumulative and last for 1 minute or until the time eater is destroyed, whichever comes first. A creature that succeeds at its save is immune to further applications of that time eater’s steal momentum ability for 24 hours."
    ],
    "types": {
      "melee": 1
    },
    "format": "tentacle +11 (1d6+3 B plus steal momentum)",
    "id": "abilities.steal_momentum"
  },
  {
    "name": "Confusion",
    "ability_source": "alien_abilities",
    "description": [
      "Any creature that comes within 30 feet of a driftdead must succeed at a DC 19 Will save or be confused for 4 rounds. Once a creature has attempted this save, whether successful or not, it can’t be affected again by the same driftdead’s aura for 24 hours."
    ],
    "types": {
      "aura": 1
    },
    "format": "confusion (30 ft., Will DC 19)",
    "id": "abilities.confusion"
  },
  {
    "name": "Drift Rip",
    "ability_source": "alien_abilities",
    "description": [
      "Just as the Drift tears away chunks of planar material, a driftdead can pull apart the molecular bonds of matter, ripping apart nearby creatures. This is a ranged attack against EAC that has a range of 30 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "Drift rip +23 (5d6+13)",
    "id": "abilities.drift_rip"
  },
  {
    "name": "Spatial Incorporeality",
    "ability_source": "alien_abilities",
    "description": [
      "Within the Drift, a driftdead has a physical body, but if removed from that plane, its physical body phases out of normal reality. On the Material Plane or otherwise outside the Drift, a driftdead gains the incorporeal special ability. If returned to the Drift, a driftdead immediately loses the incorporeal special ability as its physical body is restored."
    ],
    "types": {
      "defensive": 1
    },
    "format": "spatial incorporeality;",
    "id": "abilities.spatial_incorporeality"
  },
  {
    "name": "Alert the Herd",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day at the beginning of a combat in which it isn’t surprised, a dromada can emit a deep moan that alerts its herd to nearby danger, granting allies within 50 feet who can hear it a +4 morale bonus to their initiative checks for that combat."
    ],
    "types": {
      "other": 1
    },
    "format": "alert the herd",
    "id": "abilities.alert_the_herd"
  },
  {
    "name": "Bolt",
    "ability_source": "alien_abilities",
    "description": [
      "When a dromada takes the run full action, they can move up to five times their speed, change direction once during the movement, and cross difficult terrain (though such terrain requires extra movement as normal)."
    ],
    "types": {
      "other": 1
    },
    "format": "bolt",
    "id": "abilities.bolt"
  },
  {
    "name": "Savory",
    "ability_source": "alien_abilities",
    "description": [
      "A dromada hit by a creature’s bite attack takes a –2 penalty to AC against further bite attacks from the same creature. This effect lasts 1 week and applies only once per creature."
    ],
    "types": {
      "weakness": 1
    },
    "format": "savory",
    "id": "abilities.savory"
  },
  {
    "name": "Limning Light",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a drow noble can cause all creatures and objects in a 5-foot-radius burst to shed a pale glow. Creatures outlined by the limning light take a –20 penalty to Stealth checks and don’t benefit from the concealment usually provided by darkness. If an affected creature is benefiting from an effect such as",
      "invisibility",
      ", all others within line of sight of it become aware of its location (see page 260 of the",
      "Starfinder Core Rulebook",
      "). This effect lasts for a number of minutes equal to the drow noble’s CR (11 minutes for a drow noble arms dealer). This ability has a range of 100 feet."
    ],
    "types": {
      "offensive": 1
    },
    "format": "limning light",
    "id": "abilities.limning_light"
  },
  {
    "name": "Burrowing Assault",
    "ability_source": "alien_abilities",
    "description": [
      "A dust manta monarch that takes the charge action using its burrow speed can make a full attack at the end of its movement instead of a single melee attack. It doesn’t take the normal charge penalties to its attack rolls or its AC, and its targets must succeed at a DC 19 Perception check or they are flat-footed against the attacks."
    ],
    "types": {
      "offensive": 1
    },
    "format": "burrowing assault",
    "id": "abilities.burrowing_assault"
  },
  {
    "name": "Enhanced Desert Hide",
    "ability_source": "alien_abilities",
    "description": [
      "A dust manta monarch has a tougher hide than that of a typical dust manta, granting it DR 10/— and resistance to fire 10. In addition, if a dust manta monarch is at least halfway buried in sand or any fine, similarly colored substance, it can attempt a Stealth check to hide as if it had cover or concealment."
    ],
    "types": {
      "defensive": 1
    },
    "format": "enhanced desert hide;",
    "id": "abilities.enhanced_desert_hide"
  },
  {
    "name": "Sandstorm Aura",
    "ability_source": "alien_abilities",
    "description": [
      "A dust manta monarch kicks up a magical localized sandstorm that provides concealment to anyone in a 120-foot-radius area around the dust manta monarch. The sandstorm also produces severe wind, imposing a –4 penalty to attack rolls with kinetic ranged weapons. Any creature in the area without environmental protections must hold its breath or risk",
      "suffocation",
      ". Dust mantas and dust manta monarchs are immune to this effect, and their sense through ability allows them to ignore concealment caused by the sandstorm."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.sandstorm_aura"
  },
  {
    "name": "Masked Emotions",
    "ability_source": "alien_abilities",
    "description": [
      "An embri loses its immunity to charm effects and its +2 racial bonus to saving throws against enchantment spells and effects when it isn’t wearing a mask over its face. In addition, while unmasked, it must roll twice for any Sense Motive check it attempts and take the lower result."
    ],
    "types": {
      "weakness": 1
    },
    "format": "masked emotions",
    "id": "abilities.masked_emotions"
  },
  {
    "name": "Emotionsense",
    "ability_source": "alien_abilities",
    "description": [
      "An emotivore constantly reads the surface emotions of creatures, providing the emotivore its blindsense. A creature can avoid detection by succeeding at a DC 27 Bluff check, but a creature under the influence of an emotion effect can’t avoid detection. Creatures affected by",
      "nondetection",
      "or similar effects automatically avoid detection. The emotivore can use this ability to focus on a creature it’s aware of, and if the creature fails a DC 22 Will saving throw, the emotivore learns that target’s desires, fears, and weaknesses, as well as its general disposition and attitude toward creatures within 30 feet of it. A creature’s weaknesses include physical vulnerabilities and inabilities. Unless otherwise stated, constructs and creatures with Intelligence scores of 2 or lower don’t have emotions and can’t be sensed this way."
    ],
    "types": {
      "other": 1
    },
    "format": "emotionsense",
    "id": "abilities.emotionsense"
  },
  {
    "name": "Feed",
    "ability_source": "alien_abilities",
    "description": [
      "An emotivore can feed on a creature affected by the confused, cowering, fascinated, frightened, nauseated, panicked, shaken, or sickened conditions. To do so, the emotivore must make contact with the target by touching it (targeting an unwilling creature’s EAC), hitting the target with a claw attack, or casting",
      "mind thrust",
      "on the target (which must also fail the Will save against the spell). If the emotivore’s attempt succeeds, the target must succeed at a DC 22 Will saving throw or gain 1 temporary negative level. Upon imposing a negative level, the emotivore regains 10 Hit Points or gains 10 temporary Hit Points. If the emotivore dealt no damage when using this ability, feeding also subjects the target to a",
      "suggestion",
      "spell (Will DC 22 negates) asking the target to accept the emotivore’s touch again. An emotivore can gain a number of temporary Hit Points in this way equal to one-quarter of its maximum Hit Points (usually 30). Every 24 hours, an emotivore who has temporary Hit Points loses 10 of them. An emotivore who lacks temporary Hit Points usually seeks to feed. In addition, the emotivore mastermind can use the",
      "enervation",
      "spell to feed if the spell affects a creature already subjected to strong emotions."
    ],
    "types": {
      "offensive": 1
    },
    "format": "feed",
    "id": "abilities.feed"
  },
  {
    "name": "Shaken",
    "ability_source": "alien_abilities",
    "description": [
      "On a critical hit, an emotivore’s claws can render a target shaken for 1d4 rounds (DC 18 Will save negates)."
    ],
    "types": {
      "melee": 1
    },
    "format": "claw +28 (8d6+17 S; critical shaken [see text])",
    "id": "abilities.shaken"
  },
  {
    "name": "Flashing Strikes",
    "ability_source": "alien_abilities",
    "description": [
      "This functions as the flashing strikes solarian class feature."
    ],
    "types": {
      "offensive": 1
    },
    "format": "flashing strikes",
    "id": "abilities.flashing_strikes"
  },
  {
    "name": "Perfect Alignment",
    "ability_source": "alien_abilities",
    "description": [
      "An apastra is always both fully graviton attuned and fully photon attuned."
    ],
    "types": {
      "other": 1
    },
    "format": "perfect alignment",
    "id": "abilities.perfect_alignment"
  },
  {
    "name": "Solar Manifestation",
    "ability_source": "alien_abilities",
    "description": [
      "This functions as the solar manifestation solarian class feature."
    ],
    "types": {
      "other": 1
    },
    "format": "solar manifestation (solar weapon)",
    "id": "abilities.solar_manifestation"
  },
  {
    "name": "Solar Storm",
    "ability_source": "alien_abilities",
    "description": [
      "Once a day, an apastra can give in to the gravitonic and photonic forces that rage within it, expelling this energy in a cataclysmic storm. The solar storm has a range of 60 feet and a 15-foot radius. Creatures that enter the storm or that begin their turns in it take 8d6 fire damage (Fortitude DC 21 half) and must succeed at a DC 21 Reflex save or be hurled 1d6×10 feet in a random direction and fall prone (creatures that hit a wall or other barrier take no additional damage). The storm is difficult terrain and obscures all sight beyond 5 feet. Creatures within 5 feet of an attacker while in the storm have concealment. When the apastra uses solar storm, it can maintain the storm for up to an additional 1d3 rounds. An apastra must take a full action each round to maintain the storm, and it can move the storm up to 30 feet as part of that full action. An apastra is immune to the effects of its own or any other apastra’s solar storm."
    ],
    "types": {
      "offensive": 1
    },
    "format": "solar storm",
    "id": "abilities.solar_storm"
  },
  {
    "name": "Solarian’s Onslaught",
    "ability_source": "alien_abilities",
    "description": [
      "This functions as the solarian’s onslaught solarian class feature."
    ],
    "types": {
      "offensive": 1
    },
    "format": "solarian’s onslaught",
    "id": "abilities.solarian’s_onslaught"
  },
  {
    "name": "Stellar Revelations",
    "ability_source": "alien_abilities",
    "description": [
      "An apastra can use the black hole and supernova solarian stellar revelations. It can use either stellar revelation once before that revelation needs to recharge. Once it has used each stellar revelation once, they both recharge in 1d4 rounds."
    ],
    "types": {
      "offensive": 1
    },
    "format": "stellar revelations (black hole [35-ft. radius, pull 25 ft., DC 21], supernova [15-ft. radius, 16d6 F, DC 21])",
    "id": "abilities.stellar_revelations"
  },
  {
    "name": "Throw Solar Weapon",
    "ability_source": "alien_abilities",
    "description": [
      "An apastra can throw its solar weapon at a foe as a ranged attack with a 40-foot range increment. This does not cause the weapon to be dismissed. An apastra’s thrown solar weapon returns to its hand just before its next turn."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.throw_solar_weapon"
  },
  {
    "name": "Balanced Alignment",
    "ability_source": "alien_abilities",
    "description": [
      "A periastra is always both photon attuned and graviton attuned (but not fully attuned). If subject to an effect that depends on the periastra’s stellar alignment, the periastra uses whichever attunement is most beneficial to it."
    ],
    "types": {
      "other": 1
    },
    "format": "balanced alignment",
    "id": "abilities.balanced_alignment"
  },
  {
    "name": "Graviton Crush",
    "ability_source": "alien_abilities",
    "description": [
      "A periastra can crush an enemy with gravity; this is a ranged attack with a range of 30 feet and that targets EAC. A creature hit by graviton crush must succeed at a DC 16 Fortitude saving throw or be entangled. It can attempt a new Fortitude save once per round as a move action. A periastra cannot use graviton crush two turns in a row. If the periastra makes a full attack using graviton crush, it must use graviton crush for both attacks."
    ],
    "types": {
      "ranged": 1
    },
    "format": "graviton crush +19 (5d4+9 B; critical staggered)",
    "id": "abilities.graviton_crush"
  },
  {
    "name": "Sun Hurl",
    "ability_source": "alien_abilities",
    "description": [
      "A periastra can throw balls of superheated plasma at a foe. This is a ranged attack with a range increment of 30 feet and that targets EAC. A creature hit by sun hurl must succeed at a DC 16 Reflex save or gain the burning condition (1d6 fire damage). This condition doesn’t stack with itself, but does with any other burning condition. The periastra cannot use sun hurl two turns in a row. If the periastra makes a full attack using sun hurl, it must use sun hurl for both attacks."
    ],
    "types": {
      "ranged": 1
    },
    "format": "sun hurl +19 (3d6+15 E & F; critical burn 1d6)",
    "id": "abilities.sun_hurl"
  },
  {
    "name": "Cold Inured",
    "ability_source": "alien_abilities",
    "description": [
      "An espraksa treats severe cold as cold and extreme cold as severe cold."
    ],
    "types": {
      "other": 1
    },
    "format": "cold inured",
    "id": "abilities.cold_inured"
  },
  {
    "name": "Snatch",
    "ability_source": "alien_abilities",
    "description": [
      "This functions as the grab universal creature rule, except the espraksa must hit with two talon attacks during the same turn to grab. Only one talon must hit the target’s KAC + 4 (or + 13) to trigger the free grab (or pin), but both must hit."
    ],
    "types": {
      "melee": 1
    },
    "format": "talon +10 (1d4+5 P plus snatch)",
    "id": "abilities.snatch"
  },
  {
    "name": "Demagnetization",
    "ability_source": "alien_abilities",
    "description": [
      "If a ferrofluid ooze takes fire damage, any creature to which the ooze is attached is released. In addition, until the end of the ooze’s next turn, its magnetic field aura has no effect, and it can’t use magnetic leap."
    ],
    "types": {
      "weakness": 1
    },
    "format": "demagnetization",
    "id": "abilities.demagnetization"
  },
  {
    "name": "Magnetic Field",
    "ability_source": "alien_abilities",
    "description": [
      "A ferrofluid ooze is surrounded by a constant magnetic field that interferes with nearby technological equipment. Each time a creature within the field attacks with a technological weapon, it must succeed at a Strength check (DC = 10 + 1/2 the ooze’s CR) or take a –2 penalty to its attack."
    ],
    "types": {
      "aura": 1
    },
    "format": "magnetic field (60 ft., Strength DC 16)",
    "id": "abilities.magnetic_field"
  },
  {
    "name": "Magnetic Leap",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action every 1d4 rounds, a ferrofluid ooze can move adjacent to a creature within its magnetic field that is either a technological construct or wearing or wielding technological equipment. This movement does not provoke attacks of opportunity. The ooze then automatically attaches to that creature, as per the attach universal creature rule. If the target creature is at least one size smaller, the ooze automatically engulfs the target (as per the engulf universal creature rule) instead of attaching to it."
    ],
    "types": {
      "offensive": 1
    },
    "format": "magnetic leap (attach or engulf [6d4 + 20 B])",
    "id": "abilities.magnetic_leap"
  },
  {
    "name": "Polarity Shift",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a ferrofluid magneto-cluster can shift the polarity of its magnetic field, causing it to briefly repulse magnetic objects. Each creature must attempt a DC 19 Reflex save for each technological item it is holding to avoid dropping it in an adjacent square. In addition, each creature that is a technological construct or wearing technological armor must succeed at a DC 19 Fortitude save or be knocked prone."
    ],
    "types": {
      "offensive": 1
    },
    "format": "polarity shift",
    "id": "abilities.polarity_shift"
  },
  {
    "name": "Drink Marrow",
    "ability_source": "alien_abilities",
    "description": [
      "A flayer leech has a pharyngeal proboscis that can quickly vibrate at a subsonic frequency, allowing it to easily pierce through bone and similar hardened internal structures to consume a creature’s marrow. A creature struck by a flayer leech’s bite must succeed at a DC 23 Fortitude save or be sickened for 1 minute. Further bites from the flayer leech don’t worsen this condition, only extend the duration."
    ],
    "types": {
      "melee": 1
    },
    "format": "wrist proboscis +29 (8d6+24 P plus drink marrow)",
    "id": "abilities.drink_marrow"
  },
  {
    "name": "Phonophobia",
    "ability_source": "alien_abilities",
    "description": [
      "When a flayer leech effigy is dealt sonic damage or comes within 30 feet of the source of an extremely loud noise (such as that produced by a starship thruster or the explosion of a grenade), it must attempt a DC 21 Will saving throw. If it fails, it is frightened for 1d4 rounds; if it succeeds, it gains the off‑target condition for 1d4 rounds instead."
    ],
    "types": {
      "weakness": 1
    },
    "format": "phonophobia",
    "id": "abilities.phonophobia"
  },
  {
    "name": "Rapid Strikes",
    "ability_source": "alien_abilities",
    "description": [
      "When a flayer leech effigy makes a full attack with its wrist proboscis, it makes up to three attacks instead of two, taking a –6 penalty to each attack instead of the normal –4 penalty."
    ],
    "types": {
      "offensive": 1
    },
    "format": "rapid strikes",
    "id": "abilities.rapid_strikes"
  },
  {
    "name": "Uncanny Impersonation",
    "ability_source": "alien_abilities",
    "description": [
      "A flayer leech effigy can impersonate the creature whose skin it is wearing to a striking degree. The effigy can use Disguise to disguise itself as a specific person, and the DC for the Disguise check isn’t adjusted due to being disguised as a different creature type or size category. In addition, the flayer leech effigy receives some psychic impressions when it consumes the creature’s brain, allowing it to glean minor details about the creature’s life and speak the languages it spoke. If the effigy attacks with its wrist proboscis, its disguise is automatically ruined for all who witness the attack."
    ],
    "types": {
      "other": 1
    },
    "format": "uncanny impersonation",
    "id": "abilities.uncanny_impersonation"
  },
  {
    "name": "Verminlike",
    "ability_source": "alien_abilities",
    "description": [
      "For effects targeting creatures by type, a flayer leech effigy counts as both monstrous humanoid and vermin (whichever type allows an ability to affect them for abilities that affect only one type, and whichever is worse for abilities that affect both types). The effigy also receives a +2 racial bonus to saving throws against mind-affecting effects."
    ],
    "types": {
      "other": 1
    },
    "format": "verminlike",
    "id": "abilities.verminlike"
  },
  {
    "name": "Warp Bones",
    "ability_source": "alien_abilities",
    "description": [
      "Once a flayer leech effigy has tasted a creature’s marrow, it can temporarily reshape that creature’s skeletal structure using only its mind. As a move action, an effigy can concentrate on the creatures it has wounded. Each creature that is sickened due to the effigy’s drink marrow ability must succeed at a DC 21 Fortitude save or suffer extreme pain as its bones twist and crack, gaining the nauseated condition until the end of its next turn."
    ],
    "types": {
      "offensive": 1
    },
    "format": "warp bones",
    "id": "abilities.warp_bones"
  },
  {
    "name": "Hive Mind",
    "ability_source": "alien_abilities",
    "description": [
      "Formians operate from a shared hive intelligence that allows them to communicate nearly instantaneously. While within telepathic range of at least one other formian with this ability, a formian gains a +4 bonus to initiative and to Perception checks. If one formian is aware of a combatant, all members of the hive mind within range are aware of it, and a member of the hive mind cannot be surprised unless all members within range are surprised. If one member of the hive mind succeeds at a Will save to disbelieve an illusion effect, all members of that hive mind within telepathic range also disbelieve the effect."
    ],
    "types": {
      "other": 1
    },
    "format": "hive mind",
    "id": "abilities.hive_mind"
  },
  {
    "name": "Inspire Hive",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a myrmarch can agitate the hive mind to empower all formian warriors and workers within range of its telepathy. For 10 minutes, each affected creature gains a +4 morale bonus to attack rolls, saving throws, and skill checks, as well as immunity to fear effects and temporary Hit Points equal to twice the creature’s CR. A creature can be affected by only one myrmarch’s inspire hive ability at a time."
    ],
    "types": {
      "other": 1
    },
    "format": "inspire hive",
    "id": "abilities.inspire_hive"
  },
  {
    "name": "Hive Frenzy",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a standard action, a formian queen can issue a command to all formians within range of her telepathy, stirring them into a frenzy. Each affected formian gains the benefits of haste for 1 minute."
    ],
    "types": {
      "other": 1
    },
    "format": "hive frenzy",
    "id": "abilities.hive_frenzy"
  },
  {
    "name": "Possess Formian",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, a formian queen can transfer her consciousness to the body of any formian within range of her telepathy that she has line of effect to. This ability functions like dominate person (caster level = formian queen’s CR), except that it works only on formians; for as long as the target is affected and the queen’s consciousness is outside of her body, the queen’s body is unconscious (though she is aware if any damage is done to it). An unwilling target can attempt a DC 24 Will saving throw to resist being possessed in this manner, but the queen’s offspring are usually willing. The queen receives all sensory input from the target creature; she can speak through it, and she can use her total skill bonus for Intelligence-, Wisdom-, and Charisma-based skills. If the target creature is slain or moves to a different plane from the queen’s body, the queen returns to her own body immediately; otherwise, she can return to her own body as a move action, ending the possession effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "possess formian",
    "id": "abilities.possess_formian"
  },
  {
    "name": "Telepathic Feedback",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a formian queen can unleash a blast of debilitating telepathic feedback. Each non-formian creature within range of her telepathy must succeed at a DC 24 Will save or take a –2 penalty to ability checks, attack rolls, saving throws, and skill checks for 1 minute. Creatures with telepathy or limited telepathy take a –2 penalty to the saving throw to resist a formian queen’s telepathic feedback. A creature that succeeds at its saving throw is immune to the formian queen’s telepathic feedback for 24 hours, and a creature can be affected by only one telepathic feedback at a time. This is a mind-affecting effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "telepathic feedback",
    "id": "abilities.telepathic_feedback"
  },
  {
    "name": "Mental Motivation",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, a taskmaster can inspire all other formians from the same hive within range of its telepathy, granting them a +2 morale bonus to attacks, skill checks, and saves against charm and fear effects for 1 minute. A creature can be affected by only one taskmaster’s mental motivation ability at a time."
    ],
    "types": {
      "other": 1
    },
    "format": "mental motivation",
    "id": "abilities.mental_motivation"
  },
  {
    "name": "Deadly Grasp",
    "ability_source": "alien_abilities",
    "description": [
      "When a formian warrior succeeds at a combat maneuver to maintain a grapple, it can make a melee attack with its stinger as a move action."
    ],
    "types": {
      "offensive": 1
    },
    "format": "deadly grasp",
    "id": "abilities.deadly_grasp"
  },
  {
    "name": "Able Assistant",
    "ability_source": "alien_abilities",
    "description": [
      "When supporting an ally within range of its limited telepathy through covering fire, harrying fire, or the aid another action, a formian worker provides a +4 bonus to its ally’s AC, attack roll, or skill check instead of the normal +2 bonus."
    ],
    "types": {
      "other": 1
    },
    "format": "able assistant",
    "id": "abilities.able_assistant"
  },
  {
    "name": "Peerless Bearer",
    "ability_source": "alien_abilities",
    "description": [
      "Formian workers are bred for heavy labor. A formian worker can carry 5 additional bulk beyond the normal limits for its Strength before becoming encumbered or overburdened."
    ],
    "types": {
      "other": 1
    },
    "format": "peerless bearer",
    "id": "abilities.peerless_bearer"
  },
  {
    "name": "Absolute Gravity",
    "ability_source": "alien_abilities",
    "description": [
      "A frujai colony is able to control its apparent mass through a combination of organelles and psychic commands. It gains a +4 bonus to its KAC against bull rush, reposition, and trip combat maneuvers. Furthermore, it can ignore the effect of supernatural gravity effects such as",
      "control gravity",
      "and can always behave as though natural gravity conditions were up to two steps stronger or weaker."
    ],
    "types": {
      "defensive": 1
    },
    "format": "absolute gravity;",
    "id": "abilities.absolute_gravity"
  },
  {
    "name": "Gravity Control",
    "ability_source": "alien_abilities",
    "description": [
      "A frujai colony can control gravity in a variety of ways. At the beginning of its turn, a colony selects two of the following five abilities that it can use before the beginning of its next turn. By spending 1 Resolve Point, a colony can select three of the abilities that round instead. If a colony has a sustained ability active (such as flight or gravity field) and does not select that as one of its abilities for the turn, that effect ends immediately.",
      "Flight",
      ": As a free action, the frujai colony gains an extraordinary fly speed of 40 feet (poor maneuverability). When this ability ends, the colony descends gently at a rate of 60 feet per round and takes no damage when it lands.",
      "Gravity Field",
      ": The frujai colony can create a zone of abnormal gravity as a standard action, as per",
      "control gravity",
      "(CL 19th). A colony can maintain only one such effect at a time, and the abnormal gravity field ends if it uses this ability again.",
      "Gravity Shield",
      ": The frujai colony combines levitating improvised shields with pulses of gravity to deflect attacks, gaining a +4 bonus to its AC.",
      "Gravity Thrust",
      ": The frujai colony can use its gravity thrust attack. This is a ranged attack against EAC with a maximum range of 200 feet and no range increment.",
      "Gravity Wave",
      ": As a standard action, the frujai colony can unleash a wave of force in a 60-foot cone that deals 8d6+17 bludgeoning damage to each creature in the area and pushes affected creatures 10 feet away from the colony. A target can attempt a DC 24 Reflex save to halve the damage and negate the movement."
    ],
    "types": {
      "offensive": 1
    },
    "format": "gravity control",
    "id": "abilities.gravity_control"
  },
  {
    "name": "Slough Minion",
    "ability_source": "alien_abilities",
    "description": [
      "A frujai colony can sprout frujai soldiers (see below) naturally in a process that takes several weeks, but as a full action, a colony can expend 1 Resolve Point to create a temporary frujai soldier in an adjacent space; the soldier can act immediately. A temporary soldier remains animate for 1 hour before crumbling."
    ],
    "types": {
      "offensive": 1
    },
    "format": "slough minion",
    "id": "abilities.slough_minion"
  },
  {
    "name": "Colony Guard",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever a frujai colony takes damage, all frujai soldiers within 300 feet gain a +4 morale bonus to attack rolls and a 10-foot bonus to their base speed for 1 round."
    ],
    "types": {
      "offensive": 1
    },
    "format": "colony guard",
    "id": "abilities.colony_guard"
  },
  {
    "name": "Gravity Anchor",
    "ability_source": "alien_abilities",
    "description": [
      "A frujai soldier can create violent fluctuations in gravity as a ranged attack against EAC with a 150-foot range and no range increment. If the attack hits, the soldier can attempt either a reposition or a trip combat maneuver against the target as a free action, using its gravity anchor’s attack bonus of +4 to perform the maneuver. When repositioning a creature in this way, the frujai soldier can move the target up to 10 feet from its original position."
    ],
    "types": {
      "ranged": 1
    },
    "format": "gravity anchor +22 (6d4+12 force plus reposition or trip)",
    "id": "abilities.gravity_anchor"
  },
  {
    "name": "Analyzed Strike",
    "ability_source": "alien_abilities",
    "description": [
      "A garaggakal polymath has spent centuries analyzing the species it has encountered in the Drift, and it uses this knowledge to target its prey’s most sensitive and vulnerable areas. Any creature that takes damage from the garaggakal’s bite attack must succeed at a DC 20 Fortitude save or become off-kilter (in zero gravity) or off-target for 1 round (in gravity)."
    ],
    "types": {
      "melee": 1
    },
    "format": "bite +28 (8d6+20 P plus analyzed strike)",
    "id": "abilities.analyzed_strike"
  },
  {
    "name": "Leech Life",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a garaggakal polymath can spend 1 Resolve Point to leech the life from one target within 30 feet. This deals 14d6 damage (Fortitude DC 20 half), and the garaggakal gains temporary Hit Points equal to the amount of damage dealt."
    ],
    "types": {
      "offensive": 1
    },
    "format": "leech life (DC 20)",
    "id": "abilities.leech_life"
  },
  {
    "name": "Phase Through",
    "ability_source": "alien_abilities",
    "description": [
      "A garaggakal can momentarily shift out of phase with reality. As a full action, a garaggakal can spend 1 Resolve Point to phase through up to 15 feet of solid matter. If it attempts to phase through something that is more than 15 feet thick, the attempt fails, but the action and Resolve Points are still expended. A garaggakal cannot phase through force effects, such as force fields."
    ],
    "types": {
      "other": 1
    },
    "format": "phase through",
    "id": "abilities.phase_through"
  },
  {
    "name": "Air Mastery",
    "ability_source": "alien_abilities",
    "description": [
      "Airborne creatures take a −1 penalty to attack and damage rolls against a djinni."
    ],
    "types": {
      "defensive": 1
    },
    "format": "air mastery;",
    "id": "abilities.air_mastery"
  },
  {
    "name": "Create Feast",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a standard action, a djinni can create enough luxurious food and mildly intoxicating beverages, along with potable water, to nourish up to 15 Medium creatures for a day in normal environmental conditions. If unconsumed, the food and intoxicating beverages disappear after 24 hours. The water remains."
    ],
    "types": {
      "other": 1
    },
    "format": "create feast",
    "id": "abilities.create_feast"
  },
  {
    "name": "Fabricate Item",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a full action, a djinni can create one piece of gear of an item level equal to or lower than the djinni’s CR. The object can weigh up to 10 bulk and can be of up to Medium size. If the item needs ammunition, power, or other resources to function, it appears loaded with the required materials. The item persists for a number of minutes equal to the djinni’s CR."
    ],
    "types": {
      "other": 1
    },
    "format": "fabricate item",
    "id": "abilities.fabricate_item"
  },
  {
    "name": "Create Sustenance",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a standard action, a janni can create enough plain but nutritious food and water to sustain 12 Medium creatures for a day in normal environmental conditions. The food disappears after 24 hours if uneaten, but the water remains."
    ],
    "types": {
      "other": 1
    },
    "format": "create sustenance",
    "id": "abilities.create_sustenance"
  },
  {
    "name": "Elemental Endurance",
    "ability_source": "alien_abilities",
    "description": [
      "A janni can remain on an Elemental Plane for 48 hours. Each hour it remains on such a plane thereafter, it takes 1 damage that can’t be reduced in any way until it returns to the Material Plane. This endurance resets after the janni remains on the Material Plane for 24 hours."
    ],
    "types": {
      "other": 1
    },
    "format": "elemental endurance",
    "id": "abilities.elemental_endurance"
  },
  {
    "name": "Speak with Animals",
    "ability_source": "alien_abilities",
    "description": [
      "A janni can communicate with animals and use language-dependent effects, such as telepathy, on them."
    ],
    "types": {
      "languages": 1
    },
    "format": "2 additional languages (usually elemental or planar); speak with animals",
    "id": "abilities.speak_with_animals"
  },
  {
    "name": "Water Bolt",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a marid can emit a bolt of heat-sapping water in a 60-foot line. The marid can choose whether or not this line of water deals damage. Regardless, the line ends the burning condition on any creature it hits and puts out fires in its area. If a fire is magical, it goes out only if its creator is of a CR or level equal to or lower than the marid’s CR.",
      "In addition, the marid can cause the bolt to be continuous. Doing so has no additional effect on targets already within the line, but anything that moves across the line is attacked using the original attack roll and damage. A target the line hits but doesn’t damage blocks the line as normal. If an existing blockage is removed, the line extends out to its maximum range unless blocked anew, and it can damage creatures and objects it failed to reach previously. The marid can’t damage a target more than once per round with this continuous line. If the marid moves from where the line was initiated, the line ends immediately."
    ],
    "types": {
      "ranged": 1
    },
    "format": "water bolt +20 (5d4+9 B & C; critical blind)",
    "id": "abilities.water_bolt"
  },
  {
    "name": "Water Mastery",
    "ability_source": "alien_abilities",
    "description": [
      "Waterborne creatures take a –1 penalty to attack and damage rolls against a marid."
    ],
    "types": {
      "defensive": 1
    },
    "format": "water mastery",
    "id": "abilities.water_mastery"
  },
  {
    "name": "Earth Mastery",
    "ability_source": "alien_abilities",
    "description": [
      "A shaitan gains a +1 bonus to attack and damage rolls if both it and its foe are touching the solid surface of a planet or an asteroid. If an opponent is airborne or waterborne, the shaitan takes a −2 penalty to attack and damage rolls. These modifiers apply to initiating or resisting bull rush combat maneuvers."
    ],
    "types": {
      "offensive": 1
    },
    "format": "earth mastery",
    "id": "abilities.earth_mastery"
  },
  {
    "name": "Metal Glide",
    "ability_source": "alien_abilities",
    "description": [
      "As the earth glide universal creature rule, but the shaitan can also move through metal."
    ],
    "types": {
      "other": 1
    },
    "format": "metal glide",
    "id": "abilities.metal_glide"
  },
  {
    "name": "Metalmorph",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a shaitan can touch a single metal object of no more than 1 bulk and transform it into any other metal. The transformation lasts 1 day."
    ],
    "types": {
      "offensive": 1
    },
    "format": "metalmorph",
    "id": "abilities.metalmorph"
  },
  {
    "name": "Stone Curse",
    "ability_source": "alien_abilities",
    "description": [
      "Any melee attack a shaitan makes against a foe adjacent to an earth, stone, or metal surface gains the entangle weapon special property as if from a weapon with an item level equal to the shaitan’s CR. The surface does the entangling, rather than the weapon."
    ],
    "types": {
      "offensive": 1
    },
    "format": "stone curse",
    "id": "abilities.stone_curse"
  },
  {
    "name": "Delicious",
    "ability_source": "alien_abilities",
    "description": [
      "Ghorans take a –2 penalty to attack rolls and Acrobatics checks to escape a grapple against a creature that uses the grab ability with a bite natural weapon."
    ],
    "types": {
      "weakness": 1
    },
    "format": "delicious",
    "id": "abilities.delicious"
  },
  {
    "name": "Photosynthesis",
    "ability_source": "alien_abilities",
    "description": [
      "Ghorans undergo photosynthesis to gain nutrition instead of eating (although they can eat if they so wish). A ghoran can go without light (either sunlight or UV light, such as from starships) for 3 days, after which they must attempt Constitution checks to avoid",
      "starvation",
      "."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.photosynthesis"
  },
  {
    "name": "Paralysis",
    "ability_source": "alien_abilities",
    "description": [
      "When a ghoul shock trooper deals damage to a creature with its bite or claw attack, the target must succeed at a DC 18 Fortitude saving throw or gain the paralyzed condition for 1d4+1 rounds. As a full action, the target can attempt a new saving throw to end the condition. Creatures with the elf subtype are immune to a ghoul’s paralysis."
    ],
    "types": {
      "melee": 1
    },
    "format": "bite +23 (4d6+16 P plus ghoul fever and paralysis)",
    "id": "abilities.paralysis"
  },
  {
    "name": "Hurl Debris",
    "ability_source": "alien_abilities",
    "description": [
      "The mighty strength of a giant allows it to turn nearly anything into a ranged weapon. A giant is assumed to have such debris available (either loose or readily torn from the environment without requiring an extra action) unless the GM rules otherwise. Hurled debris has a range increment equal to the giant’s Strength modifier × 5 feet. Such attacks also create difficult terrain in a 5-foot-radius area around the target, or a 10-foot-radius area for Huge and larger giants."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.hurl_debris"
  },
  {
    "name": "Lunar Aura",
    "ability_source": "alien_abilities",
    "description": [
      "Creatures within 60 feet of a moon giant are affected by its lunar aura as long as they remain within range. A creature that succeeds at its save against the aura is immune to that particular moon giant’s lunar aura for 24 hours. A moon giant can change the effect of the aura as a swift action, and the giant can choose whether to include itself as part of the same swift action. The giant can choose one of the following effects.",
      "Waning",
      ": Affected creatures fall asleep as deep slumber. The giant’s lunar aura is not limited by CR or Hit Dice.",
      "Waxing",
      ": Affected creatures gain a number of temporary Hit Points equal to the giant’s CR and gain the ability to make three attacks during a full attack, though each attack takes a –5 penalty (instead of a –4 penalty)."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.lunar_aura"
  },
  {
    "name": "Shadow Cloak",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action in any illumination other than direct sunlight, a shadow giant can cloak itself in moving shadows that grant it concealment (20% miss chance) for 1d6+6 rounds. It can use this ability three times per day."
    ],
    "types": {
      "defensive": 1
    },
    "format": "shadow cloak;",
    "id": "abilities.shadow_cloak"
  },
  {
    "name": "Disturbing Screech",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a space goblin honchohead can let out a screech that puts all non-goblinoid creatures within 30 feet on edge. Each affected creature must succeed at a DC 13 Will saving throw or gain the off-target condition for 1d4 rounds. Whether successful or not, a creature can’t be affected by the same space goblin honchohead’s disturbing screech for 24 hours. This is a mind-affecting, sense-dependent effect."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.disturbing_screech"
  },
  {
    "name": "Tinker",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, a space goblin can remove the penalties associated with the broken condition from a single piece of equipment until the start of his next turn. The item then becomes unusable for 10 minutes (and retains the broken condition after that until it is fixed)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "tinker",
    "id": "abilities.tinker"
  },
  {
    "name": "Unstable Junklaser",
    "ability_source": "alien_abilities",
    "description": [
      "A space goblin’s laser pistol is crafted from a mishmash of broken casings, leaking energy cells, and other random material. A junklaser is similar to an azimuth laser pistol, except it has a range of only 60 feet. If the wielder of a junklaser rolls a natural 1 when attacking with it, he must immediately attempt a DC 18 Engineering check. Success means that the junklaser gains the broken condition. Failure means that the gun explodes in 1d3–1 rounds, functioning as a concussion grenade I (explode [20 ft., 1d8 B, DC 10]); a result of 0 rounds means the junklaser explodes immediately—randomly determine the corner of the wielder’s square that is the center of the burst. A thrown junklaser has the same range increment as a grenade."
    ],
    "types": {
      "ranged": 1
    },
    "format": "unstable junklaser +3 (1d4 F; critical burn 1d4)",
    "id": "abilities.unstable_junklaser"
  },
  {
    "name": "Berserk",
    "ability_source": "alien_abilities",
    "description": [
      "When a cybernetic golem takes damage that reduces it to half its maximum Hit Points or fewer, and whenever it takes damage while it has half its maximum Hit Points or fewer, it must attempt a DC 15 Will saving throw. On a failure, the golem goes berserk. While berserk, the golem uses its actions to make a full attack or to move and attack. If it can’t reach or shoot a creature, it attacks objects. The golem can attempt a DC 15 Will saving throw at the end of each of its turns to end the berserk state. If the golem’s creator communicates with the golem to calm it, via comm unit or from within 60 feet, and succeeds at a DC 10 Charisma check, the golem receives a +2 circumstance bonus to this saving throw."
    ],
    "types": {
      "offensive": 1
    },
    "format": "berserk",
    "id": "abilities.berserk"
  },
  {
    "name": "Haste Circuit",
    "ability_source": "alien_abilities",
    "description": [
      "A cybernetic golem can use a swift action to gain the benefit of the",
      "haste",
      "spell. This effect lasts for 1 round, and then the circuit shuts down and must recharge for 1 round before being activated again. The golem can use its circuit up to 10 rounds per day."
    ],
    "types": {
      "offensive": 1
    },
    "format": "haste circuit",
    "id": "abilities.haste_circuit"
  },
  {
    "name": "Magic Immunity",
    "ability_source": "alien_abilities",
    "description": [
      "A cybernetic or nanotech golem is immune to any spell or spell-like ability that allows spell resistance, unless the spell specifically lists constructs in its Targets entry. In addition, certain spells and effects function differently against the golem as follows.",
      "The golem can be affected by discharge or greater discharge but has a unique reaction to the spells. If the golem fails a saving throw against either spell, it becomes confused for 1d4 rounds instead of suffering the spell’s normal effect. The golem can attempt a Fortitude save at the end of each of its turns, ending the condition on a success.Magical effects that deal cold damage slow (as the slow spell) the golem for 3 rounds (no save). If the golem has a haste circuit and it is active, this effect counters the haste circuit but has no other effect.The golem automatically fails saving throws against weapons and magical effects that deal electricity damage. However, such an effect merely breaks any slow effect on the golem and heals it for 1 Hit Point per 3 damage the effect would have dealt. Any damage that exceeds the golem’s maximum Hit Points is stored as charges for its weapons, at a rate of 1 charge per Hit Point the golem would have gained. Any additional damage is ignored."
    ],
    "types": {
      "immunity": 1
    },
    "format": true,
    "id": "abilities.magic_immunity"
  },
  {
    "name": "X-Ray Vision",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, the golem can grant itself X-ray vision, which functions like an",
      "X-ray visor",
      "."
    ],
    "types": {
      "sense": 1
    },
    "format": "X-ray vision;",
    "id": "abilities.x-ray_vision"
  },
  {
    "name": "All-Around Vision",
    "ability_source": "alien_abilities",
    "description": [
      "A nanotech golem sees in all directions at once."
    ],
    "types": {
      "sense": 1
    },
    "format": "all-around vision",
    "id": "abilities.all-around_vision"
  },
  {
    "name": "Nanite Cloud",
    "ability_source": "alien_abilities",
    "description": [
      "Nanites swarm within 5 feet of the nanotech golem, and the golem can enter an opponent’s space, provoking an attack of opportunity from that foe. At the end of each of the golem’s turns, each creature within 5 feet of the golem or sharing its space takes 8d6 piercing damage and is nauseated for 1 round. A successful DC 20 Fortitude saving throw halves the damage and negates the condition."
    ],
    "types": {
      "offensive": 1
    },
    "format": "nanite cloud",
    "id": "abilities.nanite_cloud"
  },
  {
    "name": "Nanite Scattershot",
    "ability_source": "alien_abilities",
    "description": [
      "As an attack, a nanotech golem can unleash a stream of nanite particles at a single target as a kinetic attack with a range increment of 90 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "nanite scattershot +27 (4d12+14 P)",
    "id": "abilities.nanite_scattershot"
  },
  {
    "name": "Swarmlike",
    "ability_source": "alien_abilities",
    "description": [
      "A nanotech golem is immune to critical hits, as well as entangled, flat-footed, off-kilter, off-target, pinned, prone, and staggered effects. It takes only half damage from any attack or effect that targets only one creature. Automatic fire must hit the golem as if it were three targets to deal full damage to it. In addition, the golem can move through openings 1 inch wide without squeezing, and it can squeeze to move through microscopic openings."
    ],
    "types": {
      "defensive": 1
    },
    "format": "swarmlike",
    "id": "abilities.swarmlike"
  },
  {
    "name": "Light Immunity",
    "ability_source": "alien_abilities",
    "description": [
      "A neutronium golem does not interact with visible light, so it is immune to laser weapons or any other attack based on visible light. In any area of dim, normal, or bright light, a neutronium golem is invisible."
    ],
    "types": {
      "immunity": 1
    },
    "format": true,
    "id": "abilities.light_immunity"
  },
  {
    "name": "Digital Telepathy",
    "ability_source": "alien_abilities",
    "description": [
      "A computer glitch gremlin can communicate telepathically only with digital devices and with other creatures that can do so (such as other computer glitch gremlins). This allows the glitch gremlin to attempt Computers checks to access any computer within the telepathy’s range."
    ],
    "types": {
      "languages": 1
    },
    "format": "Common; digital telepathy 30 ft.",
    "id": "abilities.digital_telepathy"
  },
  {
    "name": "Glitch Module",
    "ability_source": "alien_abilities",
    "description": [
      "When a glitch gremlin succeeds at a Computers check to access a system or hits a foe with an attack or spell, the accessed system or one random computer held or carried by the struck creature glitches. An attended computer (including any computer on a creature hit by a computer glitch gremlin’s attack or spell) negate this effect by succeeding at a DC 10 Will save. The glitch causes one of the following effects, which functions as if the system had the indicated countermeasure (DC = 16 + the number of glitch gremlins within 30 feet when the glitch was added): a fake shell countermeasure that obstructs all users, an alarm that plays a loud and potentially embarrassing audio or holographic file when accessed by any user unless the user succeeds at a Computers check as if hacking the system, or one randomly determined countermeasure that applies even to users with root access. Disabling or removing this glitch requires a Computers check as if disabling or removing a module. A disabled glitch reactivates after 1d10 minutes if not removed. A system can have no more than one glitch per module."
    ],
    "types": {
      "melee": 1,
      "offensive": 1
    },
    "format": "glitch module",
    "id": "abilities.glitch_module"
  },
  {
    "name": "Networked Technomancy",
    "ability_source": "alien_abilities",
    "description": [
      "When gathered in groups, computer glitch gremlins share their magic. As long as a computer glitch gremlin is within 30 feet of another of its kind, it gains concealment thanks to erratic holograms that falteringly appear near it and emulate the appearance of surrounding objects. Groups of computer glitch goblins can also use more potent spell-like abilities; each gremlin in the group except for one takes a standard action to prepare the spell-like ability, and the final gremlin actually uses it. Two computer glitch gremlins can use",
      "implant data",
      "or",
      "logic bomb",
      "(DC 15), four can use",
      "holographic image",
      "(3rd level, DC 16) or",
      "instant virus",
      "(DC 16), and six can use",
      "destruction protocol",
      "(DC 17)."
    ],
    "types": {
      "defensive": 1,
      "offensive": 1
    },
    "format": "networked technomancy",
    "id": "abilities.networked_technomancy"
  },
  {
    "name": "Collateral Damage",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever an attack fails to damage a hobkins, whether due to a low attack roll, a miss chance, or a failure to penetrate DR, the hobkins can redirect the attack to any target in range of the original attack (if any), including objects. The attack can’t be redirected against the original attacker, though it can be redirected against the original attacker’s gear (but not the weapon used to make the original attack). The attacker rolls a new attack and damage roll against the new target, and the attack is considered to have the penetrating weapon special quality."
    ],
    "types": {
      "other": 1
    },
    "format": "collateral damage",
    "id": "abilities.collateral_damage"
  },
  {
    "name": "Minor Levitation",
    "ability_source": "alien_abilities",
    "description": [
      "A hobkins floats about 1 inch about the ground, allowing it to ignore difficult terrain. As a move action, a hobkins can levitate up to 20 feet straight up, but at the end of the movement, unless it has found something to cling to, it returns to 1 inch above the nearest flat surface below it."
    ],
    "types": {
      "other": 1
    },
    "format": "minor levitation",
    "id": "abilities.minor_levitation"
  },
  {
    "name": "Out of Phase",
    "ability_source": "alien_abilities",
    "description": [
      "Hobkins exist slightly out of phase with the Material Plane, causing all ranged attacks against them to suffer a 50% miss chance. This ability functions as",
      "displacement",
      "."
    ],
    "types": {
      "defensive": 1
    },
    "format": "out of phase;",
    "id": "abilities.out_of_phase"
  },
  {
    "name": "Perfect Coordination",
    "ability_source": "alien_abilities",
    "description": [
      "A hobkins malefactor can use its psychic ability to orchestrate precise mayhem and destruction with other hobkins. As a full action, the malefactor can telepathically instruct up to 15 hobkins that are within 60 feet; each of the chosen gremlins gains a +2 circumstance bonus to its next skill check or attack roll, or the DC of the next spell it casts increases by 2."
    ],
    "types": {
      "other": 1
    },
    "format": "perfect coordination",
    "id": "abilities.perfect_coordination"
  },
  {
    "name": "Aura of Disaster",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever an attack against a ship glitch gremlin fails to affect the gremlin for any reason while any part of a starship is within 30 feet of the gremlin and within range of the attack (including any time the gremlin is on board a starship), the attack ricochets wildly to cause damage to the ship and its systems. A randomly determined starship system becomes one step more damaged. (If the damaged system is life support, rather than the normal effect, a 10-foot-radius of the gremlin’s choice within the ship becomes a zero-gravity environment until the life support system is patched or repaired.) In addition, spilled oil or debris falls in 1d4 5-foot-squares of the gremlin’s choice within 30 feet, creating difficult terrain or cover as the gremlin prefers."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.aura_of_disaster"
  },
  {
    "name": "Stellar Stowaway",
    "ability_source": "alien_abilities",
    "description": [
      "In starship combat, a ship glitch gremlin on board a ship can cause havoc at the end of its ship’s turn. It attempts an Engineering check against the same DC to patch a damaged starship system; if it succeeds, it causes the ship system of its choice to function as if one step more damaged until the end of starship combat. If that system is already critical, another randomly chosen system is degraded this way instead."
    ],
    "types": {
      "other": 1
    },
    "format": "stellar stowaway",
    "id": "abilities.stellar_stowaway"
  },
  {
    "name": "Balloon",
    "ability_source": "alien_abilities",
    "description": [
      "A haan can create and inflate a web balloon and attach it to an adjacent enemy with a successful melee attack against KAC. If the attack hits, the target immediately rises 30 feet off the ground in a straight line, and it continues to rise at a speed of 30 feet each round on the haan’s turn. Every round after the balloon is attached, the target can attempt a DC 14 Reflex save to cut or break free of the web balloon. If freeing itself from the balloon causes the creature to fall, it takes falling damage as normal. This ability does not function in a vacuum or zero gravity."
    ],
    "types": {
      "melee": 1
    },
    "format": "balloon +12 (see below)",
    "id": "abilities.balloon"
  },
  {
    "name": "Firespray",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a haan can spray its flammable lifting gases and light them with sparks, creating a 30-foot cone of flame. All creatures within the cone take 3d6 fire damage (Reflex DC 14 half)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "firespray",
    "id": "abilities.firespray"
  },
  {
    "name": "Death Throes",
    "ability_source": "alien_abilities",
    "description": [
      "When killed, a haeshi explodes in a frenetic wave of psychic energy that assaults the minds of creatures within 20 feet, dealing 6d6 damage (Will DC 19 half). This is a mind-affecting effect."
    ],
    "types": {
      "other": 1
    },
    "format": "death throes",
    "id": "abilities.death_throes"
  },
  {
    "name": "Sonic Bolt",
    "ability_source": "alien_abilities",
    "description": [
      "A haeshi-shaa can fire a beam of disruptive sound at a target within 100 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "sonic bolt +22 (6d4+12 So)",
    "id": "abilities.sonic_bolt"
  },
  {
    "name": "Stench Aura",
    "ability_source": "alien_abilities",
    "description": [
      "Haeshi-shaas exude a horrible stench. An affected creature must succeed at a Fortitude save with the listed DC or be sickened while within the aura’s effect. Sickened creatures become nauseated on subsequent failed saving throws."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.stench_aura"
  },
  {
    "name": "Expand",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, a shaa can spread its matter thin, increasing its size to Gargantuan and gaining a space and reach of 20 feet. A shaa can maintain this ability as long as it concentrates, but it can take only purely mental actions or its thicken ability while in this state. A shaa can return to its normal size as a move action."
    ],
    "types": {
      "offensive": 1
    },
    "format": "expand",
    "id": "abilities.expand"
  },
  {
    "name": "Thicken",
    "ability_source": "alien_abilities",
    "description": [
      "A shaa can agitate its molecules and assume a nearly impenetrable, semitransparent form. As a full action, a shaa can become solid for 1d6 rounds. In this form, the shaa is not incorporeal, gains DR 30/— and 100 temporary Hit Points, can take no actions, and is immovable. The shaa reverts to its natural form at the end of the duration and loses any remaining temporary Hit Points."
    ],
    "types": {
      "offensive": 1
    },
    "format": "thicken",
    "id": "abilities.thicken"
  },
  {
    "name": "Stardust Robes",
    "ability_source": "alien_abilities",
    "description": [
      "Three times per day as a standard action, a void hag can release the energies of the cosmos stored within her robes. Creatures within 30 feet of the void hag each take 2d6+10 force damage and are outlined in glowing motes of stellar energy for 2d4 rounds. An outlined creature takes a -20 penalty to Stealth checks and doesn’t benefit from the concealment normally provided by",
      "displacement",
      ",",
      "invisibility",
      ", or similar effects. A target that succeeds at a DC 19 Reflex saving throw halves this damage and negates the outlining effect. Other void hags are immune to this ability."
    ],
    "types": {
      "offensive": 1
    },
    "format": "stardust robes",
    "id": "abilities.stardust_robes"
  },
  {
    "name": "Atmospheric Adaptation",
    "ability_source": "alien_abilities",
    "description": [
      "Hanakans’ exposure to a variety of atmospheres has made them immune to inhaled poisons and acclimated to thin and thick atmospheres."
    ],
    "types": {
      "defensive": 1
    },
    "format": "atmospheric adaptation",
    "id": "abilities.atmospheric_adaptation"
  },
  {
    "name": "Battle Hardened",
    "ability_source": "alien_abilities",
    "description": [
      "Hobgoblins are trained for combat from an early age, and they quickly learn that a foe can do much more than just hurt you. Hobgoblins gain a +1 racial bonus to AC against combat maneuvers."
    ],
    "types": {
      "defensive": 1
    },
    "format": "battle hardened",
    "id": "abilities.battle_hardened"
  },
  {
    "name": "Furious Combatant",
    "ability_source": "alien_abilities",
    "description": [
      "When a hobgoblin lieutenant scores a critical hit against a foe, the hobgoblin can attempt an Intimidate check to demoralize that foe as a reaction."
    ],
    "types": {
      "offensive": 1
    },
    "format": "furious combatant",
    "id": "abilities.furious_combatant"
  },
  {
    "name": "Atmospheric Alteration",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action while in atmosphere, a hortus can spend 1 Resolve Point to release a mix of spores into the air. When it uses this ability, the hortus chooses a type of saving throw (Fortitude, Reflex, or Will) and whether to enhance or penalize that save. If it enhances, creatures within 20 feet gain a +2 enhancement bonus to saving throws of the chosen type for 1d4 rounds; if it penalizes, creatures within 20 feet take a –1 penalty to saving throws of the chosen type for 1d4 rounds. A creature can attempt a Fortitude save before the bonus or penalty is applied to ignore this effect. This is an inhaled poison effect."
    ],
    "types": {
      "other": 1
    },
    "format": "atmospheric alteration (DC 20)",
    "id": "abilities.atmospheric_alteration"
  },
  {
    "name": "Slightly Poisonous",
    "ability_source": "alien_abilities",
    "description": [
      "A creature that hits a hortus with a bite attack must succeed at a Fortitude save or become sickened for 1d4 rounds."
    ],
    "types": {
      "defensive": 1
    },
    "format": "slightly poisonous (DC 20);",
    "id": "abilities.slightly_poisonous"
  },
  {
    "name": "Angled Entry",
    "ability_source": "alien_abilities",
    "description": [
      "A hound of Tindalos can use",
      "interplanetary teleport",
      "or",
      "plane shift",
      "only when adjacent to a fixed angle in the physical environment. Temporary angles are insufficient, as are angles that also include curves."
    ],
    "types": {
      "other": 1
    },
    "format": "angled entry",
    "id": "abilities.angled_entry"
  },
  {
    "name": "Discern Prey",
    "ability_source": "alien_abilities",
    "description": [
      "Hounds of Tindalos can sense their prey, which is any creature that violates the laws of time and space, including trying to use magic to enter the Drift. A hound senses such creatures as if it had blindsense with a range of 120 feet, and the hound always knows the direction toward its prey. This directional sense works at any distance and across planar boundaries. If the prey is protected from divination, the hound must attempt a check, rolling 1d20 + the hound’s CR against a DC that equals 11 + the caster level or CR of the creator of the antidivination effect. On a success, the hound ignores the effect. If the check fails, the hound can’t try again and can’t sense the prey while the effect lasts."
    ],
    "types": {
      "sense": 1
    },
    "format": "discern prey;",
    "id": "abilities.discern_prey"
  },
  {
    "name": "Mind Drain",
    "ability_source": "alien_abilities",
    "description": [
      "When the thing from beyond time hits with its barbed tongue, its target must succeed at a DC 24 Fortitude saving throw or gain 1 permanent negative level."
    ],
    "types": {
      "melee": 1
    },
    "format": "tongue +29 (3d12+22 P plus mind drain) claws +29 (6d8+22 S)",
    "id": "abilities.mind_drain"
  },
  {
    "name": "Ripping Gaze",
    "ability_source": "alien_abilities",
    "description": [
      "The gaze’s damage is magical. A creature that succeeds on its save is immune to that hound’s gaze for 24 hours."
    ],
    "types": {
      "offensive": 1
    },
    "format": "ripping gaze (30 ft., 11d6 S; Fort DC 24)",
    "id": "abilities.ripping_gaze"
  },
  {
    "name": "Hardened Mantle",
    "ability_source": "alien_abilities",
    "description": [
      "An ijtikri reduces the damage they take from any critical hit by 7, to a minimum of 1 (unless reduced by other means)."
    ],
    "types": {
      "defensive": 1
    },
    "format": "hardened mantle",
    "id": "abilities.hardened_mantle"
  },
  {
    "name": "Squirt Blood",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a move action, an ikeshti brood-minder can squirt blood from one of his eyes at a foe within 30 feet, making a ranged attack (+6 for most ikeshti brood-minders) against the target’s KAC. A successful hit grants the next ally who hits that foe the benefit of harrying fire against it (",
      "Starfinder Core Rulebook",
      "247)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "squirt blood",
    "id": "abilities.squirt_blood"
  },
  {
    "name": "Discorporation",
    "ability_source": "alien_abilities",
    "description": [
      "An anhamut’s robotic body can discorporate its component nanites into a swarm of Diminutive creatures as a standard action. Reincorporating its parts into its regular form is also a standard action. While in its discorporated form, an anhamut cannot use its nanite blade, but it gains swarm immunities and can fly. In addition, a discorporated anhamut can interface directly with many forms of technology, and it counts as having a hacking kit when attempting Computers skill checks. While an anhamut is in discorporated form, its total Stealth bonus increases to +24."
    ],
    "types": {
      "other": 1
    },
    "format": "discorporation",
    "id": "abilities.discorporation"
  },
  {
    "name": "Electric Discharge",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, an anhamut can generate a powerful electric charge from its blade (or between the individual nanomachines that make up its discorporated form) and launch this charge as a ranged attack against EAC at a target within 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "electric discharge +19 (3d4+10 E)",
    "id": "abilities.electric_discharge"
  },
  {
    "name": "Inevitable Onslaught",
    "ability_source": "alien_abilities",
    "description": [
      "When an anhamut makes a full attack, it can make up to three melee attacks instead of two melee attacks. It takes a –6 penalty to these attacks instead of a –4 penalty."
    ],
    "types": {
      "offensive": 1
    },
    "format": "inevitable onslaught",
    "id": "abilities.inevitable_onslaught"
  },
  {
    "name": "Nanite Blade",
    "ability_source": "alien_abilities",
    "description": [
      "An anhamut’s sword is composed of the same nanites as the outsider itself, and functions as if it has the",
      "axiomatic",
      "and",
      "nanite",
      "weapon fusions."
    ],
    "types": {
      "melee": 1
    },
    "format": "nanite blade +21 (2d8+12 S; critical nanite burst [DC 19])",
    "id": "abilities.nanite_blade"
  },
  {
    "name": "Anharmonic Hum",
    "ability_source": "alien_abilities",
    "description": [
      "The wing membranes of an oshirokiroi vibrate with a series of anharmonic frequencies. A creature that enters or starts its turn within 30 feet of an oshirokiroi takes 3d4 sonic damage (Fortitude DC 19 half)."
    ],
    "types": {
      "aura": 1
    },
    "format": "anharmonic hum (30 ft., Fort DC 19)",
    "id": "abilities.anharmonic_hum"
  },
  {
    "name": "Sonic Burst",
    "ability_source": "alien_abilities",
    "description": [
      "An oshirokiroi’s sonic burst is a high-frequency screech that can target a single creature within 40 feet. In addition, an oshirokiroi’s sonic burst has the deafen critical hit effect (DC 19)."
    ],
    "types": {
      "ranged": 1
    },
    "format": "sonic burst +22 (6d4+12 So; critical deafen [DC 19])",
    "id": "abilities.sonic_burst"
  },
  {
    "name": "Topple",
    "ability_source": "alien_abilities",
    "description": [
      "If an irokiroi’s bite attack hits the target’s KAC + 4, the irokiroi deals its normal damage and automatically trips the target (this takes no action)."
    ],
    "types": {
      "melee": 1
    },
    "format": "bite +25 (6d4+20 P plus topple; critical bleed 2d6)",
    "id": "abilities.topple"
  },
  {
    "name": "Posture",
    "ability_source": "alien_abilities",
    "description": [
      "Izalguuns can walk on two limbs or four. As a move action, an izalguun can switch between a bipedal and a quadrupedal posture. When in its quadrupedal posture, an izalguun has a land speed of 40 feet and a reach of 5 feet. While in its bipedal posture, an izalguun has a land speed of 20 feet, a reach of 10 feet, and the multiarmed (4) universal creature rule."
    ],
    "types": {
      "other": 1
    },
    "format": "posture (bipedal)",
    "id": "abilities.posture"
  },
  {
    "name": "Powerful Leap",
    "ability_source": "alien_abilities",
    "description": [
      "When attempting an Athletics checks to jump, a jinsul is always considered to have taken a running start."
    ],
    "types": {
      "other": 1
    },
    "format": "powerful leap",
    "id": "abilities.powerful_leap"
  },
  {
    "name": "Unshakable Belief",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever a jinsul base commander is the target of a trick attack, it can attempt a Bluff or Sense Motive check in response. If the jinsul base commander’s result equals or exceeds that of the trick attack skill check, the trick attack is unsuccessful. If the jinsul’s check exceeds the trick attack check by 5 or more, the creature performing the trick attack gains the off‑target condition until the end of their next turn."
    ],
    "types": {
      "defensive": 1
    },
    "format": "unshakable belief",
    "id": "abilities.unshakable_belief"
  },
  {
    "name": "Three-Dimensional Tactics",
    "ability_source": "alien_abilities",
    "description": [
      "Kalo sharkhunters are trained to fight in three dimensions. Whenever a kalo sharkhunter is fighting underwater, in zero-g, while flying, or in other situations where she isn’t restricted to a single plane of movement, she gains a +1 bonus to attack rolls in any round in which she has moved, even if it’s just a guarded step."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.three-dimensional_tactics"
  },
  {
    "name": "Biomechanical Staff",
    "ability_source": "alien_abilities",
    "description": [
      "As a swift action or as part of a full attack, a chinjugami can manifest a staff in its grasp. The staff’s effective item level is equal to the chinjugami’s CR. The staff has the reach weapon special property and can deal either bludgeoning or piercing damage with each attack. On a critical hit, the chinjugami chooses one of two effects—the staff either sprouts entangling vines, applying the bind critical hit effect, or disrupts the target’s body, applying the bleed critical hit effect. A chinjugami can manifest only one staff at a time. If the kami loses hold of the staff, the weapon disintegrates."
    ],
    "types": {
      "melee": 1
    },
    "format": "biomechanical staff +27 (6d8+27 B or P; critical bind or bleed [see text])",
    "id": "abilities.biomechanical_staff"
  },
  {
    "name": "Merge with Ward",
    "ability_source": "alien_abilities",
    "description": [
      "A kami has a specific ward—a creature with an Intelligence of –4 or lower, an object, or a location—listed in parentheses in the kami’s stat block. As a full action, a kami adjacent to its ward can merge body and mind with that ward. While merged, the kami can observe the surrounding region with its senses as if it were using its own body, as well as via any senses its ward might have. Typically, this trait allows a kami no control over its ward, although some kami (such as the tsukumogami) are exceptions. If the kami has no control over its ward, it can take no actions while merged other than to emerge from its ward as an action. The kami can emerge adjacent to the ward, provided the kami’s body is at least one size smaller than the ward. If the ward is a location, the kami can emerge at any point within that location. If the ward is destroyed while a kami is merged with it, the kami dies. If the ward is destroyed while the kami is not merged with it, the kami loses its merge with ward and fast healing traits, and the kami becomes sickened. It can take on a new ward by spending 7 days doing so, and it regains its traits and loses the sickened condition once it does.",
      "Some kami have additional abilities and limitations relative to their wards. A chinjugami claims a massive fabricated ecosystem as its ward."
    ],
    "types": {
      "other": 1
    },
    "format": "merge with ward (space station park)",
    "id": "abilities.merge_with_ward"
  },
  {
    "name": "Revitalization Contingency",
    "ability_source": "alien_abilities",
    "description": [
      "A chinjugami that is reduced to 0 Hit Points disperses into light that merges with the chinjugami’s ward. For 7 days, the chinjugami is unconscious as it regenerates its body and mind. After that time, the chinjugami regains consciousness and can reemerge from its ward. A chinjugami can be completely destroyed only if its ward is destroyed."
    ],
    "types": {
      "defensive": 1
    },
    "format": "revitalization contingency;",
    "id": "abilities.revitalization_contingency"
  },
  {
    "name": "Permanent Merge",
    "ability_source": "alien_abilities",
    "description": [
      "A tsukumogami claims an object of no more than 2 bulk as its ward, and the kami permanently merges with its ward, animating and controlling that object as its body. The tsukumogami can appear to be its ward by remaining still, allowing it to attempt a Stealth check to hide in plain sight as if it had cover or concealment. If it succeeds, it appears to be a normal version of its ward rather than a creature. A tsukumogami can’t emerge from its ward."
    ],
    "types": {
      "other": 1
    },
    "format": "permanent merge",
    "id": "abilities.permanent_merge"
  },
  {
    "name": "Aura of Radiation",
    "ability_source": "alien_abilities",
    "description": [
      "A thasteron khefak’s aura is an emanation of low radiation."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.aura_of_radiation"
  },
  {
    "name": "Break Objects",
    "ability_source": "alien_abilities",
    "description": [
      "When attacking an object, a thasteron khefak treats that object’s hardness as if it were 15 lower."
    ],
    "types": {
      "offensive": 1
    },
    "format": "break objects",
    "id": "abilities.break_objects"
  },
  {
    "name": "Consume Objects",
    "ability_source": "alien_abilities",
    "description": [
      "A thasteron khefak can eat objects with hardness 15 or lower. A thasteron khefak deals 2 damage to the object it’s consuming per minute. A thasteron khefak is sated and stops feeding on a given day after dealing 100 damage this way."
    ],
    "types": {
      "other": 1
    },
    "format": "consume objects",
    "id": "abilities.consume_objects"
  },
  {
    "name": "Calming Presence",
    "ability_source": "alien_abilities",
    "description": [
      "Kothamas exude an aura of calm. Non-kothama creatures within 30 feet of a kothama must succeed at a Will saving throw to be able to attack, cast a spell on an unwilling target, or use an offensive ability. A creature that succeeds at the saving throw is immune to the same kothama’s calming presence for 24 hours."
    ],
    "types": {
      "aura": 1
    },
    "format": "calming presence (30 ft., Will DC 22)",
    "id": "abilities.calming_presence"
  },
  {
    "name": "Cold Radiance",
    "ability_source": "alien_abilities",
    "description": [
      "Lucandrians can cause any weapon they wield to deal half its damage as cold damage, which makes the weapon neither archaic nor nonlethal. If the weapon already deals two damage types, this effect replaces one with cold. In addition, lucandrians can grant weapons they wield the staggered critical hit effect. If the weapon has any other critical hit effects, the lucandrian chooses only one to apply on a critical hit."
    ],
    "types": {
      "offensive": 1
    },
    "format": "cold radiance",
    "id": "abilities.cold_radiance"
  },
  {
    "name": "Limited Spaceflight",
    "ability_source": "alien_abilities",
    "description": [
      "A lucandrian can fly between a moon or similar satellite and the planet it orbits, or from one satellite to another, arriving in 1d3 days. The fey always arrives at its intended destination."
    ],
    "types": {
      "other": 1
    },
    "format": "limited spaceflight",
    "id": "abilities.limited_spaceflight"
  },
  {
    "name": "Lunar Aspect",
    "ability_source": "alien_abilities",
    "description": [
      "In the light of a waxing moon or on the lighted surface of a moon, an albedo lucandrian has a +5 racial bonus to Perception. In the light of a waning moon or on the dark side of a moon, the fey has a +5 racial bonus to Stealth. If on a planet experiencing a solar eclipse, an albedo lucandrian has both bonuses."
    ],
    "types": {
      "other": 1
    },
    "format": "lunar aspect",
    "id": "abilities.lunar_aspect"
  },
  {
    "name": "Reffected Moonbeam",
    "ability_source": "alien_abilities",
    "description": [
      "When an albedo lucandrian dismisses its reflecting armor, a creature that succeeds at the saving throw is also dazzled for 1 round, and a creature that fails the saving throw is blinded for 1 round instead of dazzled. If the target fails the saving throw by 5 or more, the creature is also confused for 2 rounds."
    ],
    "types": {
      "offensive": 1
    },
    "format": "reffected moonbeam",
    "id": "abilities.reffected_moonbeam"
  },
  {
    "name": "Gravity Shot",
    "ability_source": "alien_abilities",
    "description": [
      "A perigean lucandrian uses gravity to launch a projectile, such as a small arm round, at supersonic speed with a range increment of 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "gravity shot +16 (2d8+9 P; critical staggered)",
    "id": "abilities.gravity_shot"
  },
  {
    "name": "Psychokinetic Grip",
    "ability_source": "alien_abilities",
    "description": [
      "A perigean lucandrian can use",
      "psychokinetic hand",
      "to immobilize, lift, and move a Medium or smaller creature, ignoring the weight limit of the spell. The target can attempt a DC 18 Fortitude save to negate the effect and can repeat the attempt each time the lucandrian concentrates on the spell. A creature can be lifted only up to 5 feet off the ground with this ability."
    ],
    "types": {
      "offensive": 1
    },
    "format": "psychokinetic grip",
    "id": "abilities.psychokinetic_grip"
  },
  {
    "name": "Blend with Light",
    "ability_source": "alien_abilities",
    "description": [
      "A lurker in light is invisible in areas of bright light."
    ],
    "types": {
      "other": 1
    },
    "format": "blend with light",
    "id": "abilities.blend_with_light"
  },
  {
    "name": "Daylight Door",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day, a lurker in light can cast",
      "dimension door",
      ", though it can transport only itself and objects of up to 5 total bulk. The start and end points of the teleport must be in areas of bright light; if the destination lacks sufficient light, the spell fails, but this ability is not expended for the day."
    ],
    "types": {
      "other": 1
    },
    "format": "daylight door",
    "id": "abilities.daylight_door"
  },
  {
    "name": "Illumine",
    "ability_source": "alien_abilities",
    "description": [
      "A lightweaver wields exquisite control over local illumination. Twice per day as a move action, a lightweaver can create a 60-foot area of bright light centered on itself that lasts for 1d6 minutes."
    ],
    "types": {
      "other": 1
    },
    "format": "illumine",
    "id": "abilities.illumine"
  },
  {
    "name": "Ritual Leap",
    "ability_source": "alien_abilities",
    "description": [
      "Lightweavers are able to transport a starship’s power core or other large power source through a rip in space by completing a gruesome ritual at the power source’s location. To conduct the ritual, three lightweavers slaughter one humanoid creature and spend two hours completing the rite, during which the lightweavers vivisect their victim and replace its organs with radioactive crystals. Once the ritual is complete, the lightweavers can transport the starship’s power core as",
      "interplanetary teleport",
      "."
    ],
    "types": {
      "other": 1
    },
    "format": "ritual leap",
    "id": "abilities.ritual_leap"
  },
  {
    "name": "Evisceration",
    "ability_source": "alien_abilities",
    "description": [
      "A mi-go is capable of performing swift surgical operations upon targets that are helpless or that the mi-go currently has grappled. Against such a target, any hit with the mi-go’s claw counts as a critical hit that has the severe wound critical hit effect with a save DC of 20. If the mi-go actually scores a critical hit against such a target, the mi-go rolls the damage three times instead of twice, and the save DC increases to 22."
    ],
    "types": {
      "offensive": 1
    },
    "format": "evisceration",
    "id": "abilities.evisceration"
  },
  {
    "name": "Mi-Go Technology",
    "ability_source": "alien_abilities",
    "description": [
      "Mi-go use Life Science in place of Engineering to craft technological and hybrid items. These are technological or hybrid biotech items that work like their typical counterparts, except that Life Science is also used to repair them. Species other than mi-go can use Engineering or Life Science to identify this gear, which is alien tech."
    ],
    "types": {
      "other": 1
    },
    "format": "mi-go technology",
    "id": "abilities.mi-go_technology"
  },
  {
    "name": "Moon Pulse",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a moonflower titan can emit a pulse of bright light and psychic static from its body. Each creature within a 50-foot spherical spread originating from the moonflower’s space must attempt a DC 22 Fortitude save. Those that fail are blinded, deafened, and unable to use any other sense for 1d4 rounds. Other than the blinding affect, this ability is a mind-affecting effect. A creature that is immune to mind-affecting effects but in the area and able to see the moonflower can be blinded by this effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "moon pulse",
    "id": "abilities.moon_pulse"
  },
  {
    "name": "Pod Spawn",
    "ability_source": "alien_abilities",
    "description": [
      "A Small or larger living creature that dies while enclosed in a digestive pod is digested, its body completely destroyed in 1 hour. Another hour later, the pod sprouts into a new moonflower. This new moonflower has features that bear a minor resemblance to the digested creature. Any equipment the digested creature carried remains inside the new moonflower. A Huge creature transforms into a moonflower titan instead of a moonflower."
    ],
    "types": {
      "other": 1
    },
    "format": "pod spawn",
    "id": "abilities.pod_spawn"
  },
  {
    "name": "Root Tremor",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, a moonflower titan can thrust its roots and tentacles into the ground, causing a violent tremor. Each creature within a 50-foot-radius spread originating in the moonflower’s space must attempt a DC 22 Reflex saving throw. Those that fail take 10d6 bludgeoning damage and fall prone. Creatures that succeed take half the damage and remain standing."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.root_tremor"
  },
  {
    "name": "Skewer",
    "ability_source": "alien_abilities",
    "description": [
      "When a morlamaw successfully deals damage with their tusk to a creature that isn’t adjacent to them, they can move that creature 5 feet into an adjacent square. This movement doesn’t provoke attacks of opportunity."
    ],
    "types": {
      "melee": 1
    },
    "format": "tusk +17 (3d4+9 P plus skewer)",
    "id": "abilities.skewer"
  },
  {
    "name": "Decompression Gaze",
    "ability_source": "alien_abilities",
    "description": [
      "The dead stare of a nihili makes those around the undead feel like their own lungs are starting to violently collapse, mimicking the nihili’s demise. A living creature that can see and breathe that begins its turn within 15 feet of a nihili must succeed at a DC 15 Fortitude save or take 1d4+3 bludgeoning damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "decompression gaze (15 ft., DC 21, 3d8+11 B)",
    "id": "abilities.decompression_gaze"
  },
  {
    "name": "Gravity Well",
    "ability_source": "alien_abilities",
    "description": [
      "A nihili generates a field of gravity that functions in a 5-foot aura around itself (including 5 feet above the nihili), exerting a downward force toward the nihili’s feet. This allows the nihili to function as if constantly under the effect of",
      "spider climb",
      ". Any creature entering this aura from an area of zero-g must succeed at a DC 15 Reflex saving throw or be knocked prone."
    ],
    "types": {
      "aura": 1
    },
    "format": "gravity well (5 ft., DC 21)",
    "id": "abilities.gravity_well"
  },
  {
    "name": "Gore",
    "ability_source": "alien_abilities",
    "description": [
      "A nuar can charge without taking the normal charge penalties to the attack roll or its AC. If the nuar has another ability that allows it to charge without taking these penalties (such as the charge attack ability from the soldier’s blitz attack fighting style), the nuar also gains the ability to charge through difficult terrain."
    ],
    "types": {
      "offensive": 1
    },
    "format": "gore",
    "id": "abilities.gore"
  },
  {
    "name": "Knockdown",
    "ability_source": "alien_abilities",
    "description": [
      "When a nuar enforcer scores a critical hit with a melee weapon that has no other critical effects, the attack gains the knockdown critical effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "knockdown",
    "id": "abilities.knockdown"
  },
  {
    "name": "Maze Mind",
    "ability_source": "alien_abilities",
    "description": [
      "Nuars have a naturally strong sense of direction and an instinctive understanding of complex patterns. As a result, they very rarely get lost. A nuar can attempt a special level-based Wisdom check (1d20 + CR or level + Wisdom bonus) instead of using his total bonus in the Piloting skill to navigate or his total bonus in the Survival skill for orienteering."
    ],
    "types": {
      "other": 1
    },
    "format": "maze mind",
    "id": "abilities.maze_mind"
  },
  {
    "name": "Phasic Claws",
    "ability_source": "alien_abilities",
    "description": [
      "A nyssholora’s claws ignore half an object’s hardness."
    ],
    "types": {
      "melee": 1,
      "multiattack": 1
    },
    "format": "phasic claws +18 (2d8+19 So; critical wound [DC 18])",
    "id": "abilities.phasic_claws"
  },
  {
    "name": "Telepathy Sense",
    "ability_source": "alien_abilities",
    "description": [
      "A nyssholora can sense any creature within 60 feet of it that has telepathy, limited telepathy, or a similar ability, such as that from a mystic’s telepathic bond. This sense works through walls or other obstacles, functioning like blindsense (vibration) and sense through (vibration)."
    ],
    "types": {
      "sense": 1
    },
    "format": "telepathy sense 60 ft.;",
    "id": "abilities.telepathy_sense"
  },
  {
    "name": "Serene Fighter",
    "ability_source": "alien_abilities",
    "description": [
      "A ja noi is an experienced combatant and can remain calm even in the face of great adversity. Once per day, a ja noi can reroll a Will saving throw."
    ],
    "types": {
      "defensive": 1
    },
    "format": "serene fighter",
    "id": "abilities.serene_fighter"
  },
  {
    "name": "Armor Savant",
    "ability_source": "alien_abilities",
    "description": [
      "Kanabo have an innate mastery of the use of armor. When wearing armor, they gain a +1 racial bonus to AC. When wearing heavy armor, their armor check penalty is 1 less severe than normal."
    ],
    "types": {
      "defensive": 1
    },
    "format": "armor savant",
    "id": "abilities.armor_savant"
  },
  {
    "name": "Light Sensitivity",
    "ability_source": "alien_abilities",
    "description": [
      "An orc is dazzled as long as she remains in an area of bright light."
    ],
    "types": {
      "weakness": 1
    },
    "format": "light sensitivity",
    "id": "abilities.light_sensitivity"
  },
  {
    "name": "Hallucinate",
    "ability_source": "alien_abilities",
    "description": [
      "An orocoran’s stomach fluids are laced with the narcotic black ichor of Aucturn. A creature hit with the orocoran’s projectile vomit must succeed at a DC 16 Will save or be confused (as per",
      "confusion",
      ") for 1d4 rounds."
    ],
    "types": {
      "ranged": 1
    },
    "format": "projectile vomit +17 (2d6+9 A plus hallucinate)",
    "id": "abilities.hallucinate"
  },
  {
    "name": "Projectile Vomit",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, an orocoran can spew a thin stream of vomit at a target within 30 feet. In addition to taking damage, a creature hit with this spray is subject to the orocoran’s hallucinate ability."
    ],
    "types": {
      "ranged": 1
    },
    "format": "projectile vomit +17 (2d6+9 A plus hallucinate)",
    "id": "abilities.projectile_vomit"
  },
  {
    "name": "Slime",
    "ability_source": "alien_abilities",
    "description": [
      "As a swift action, an osharu can excrete slime into an empty adjacent square, causing that square to become difficult terrain. An osharu can use this ability 1d4 times per day before she must rest for at least 8 hours to replenish her slime stores."
    ],
    "types": {
      "other": 1
    },
    "format": "slime",
    "id": "abilities.slime"
  },
  {
    "name": "Susceptible to Salt",
    "ability_source": "alien_abilities",
    "description": [
      "A handful or more of salt or a splash of salt water deals 1d6 damage to an osharu, and full immersion in salt water deals 4d6 damage per round. These effects are negated by the environmental protections built into most armor."
    ],
    "types": {
      "weakness": 1
    },
    "format": "susceptible to salt",
    "id": "abilities.susceptible_to_salt"
  },
  {
    "name": "Nimble",
    "ability_source": "alien_abilities",
    "description": [
      "An off-kilter pahtra doesn’t gain the flat-footed condition or take the normal penalty to attacks, and she can steady herself as a swift action instead of a move action."
    ],
    "types": {
      "defensive": 1
    },
    "format": "nimble",
    "id": "abilities.nimble"
  },
  {
    "name": "Psychic Shriek",
    "ability_source": "alien_abilities",
    "description": [
      "Three times per day as a standard action, a paraforan fragment can vibrate at a frequency that manifests as a painful shriek within the minds of creatures around it. Each non-paraforan creature within a 30-foot radius takes 2d6+6 damage and gains the off-target condition for 1 round. A creature that succeeds at a DC 16 Will save takes half damage, negates the off-target condition, and is immune to the same paraforan fragment’s psychic shriek for 24 hours. This is a mind-affecting effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "psychic shriek",
    "id": "abilities.psychic_shriek"
  },
  {
    "name": "Susceptible to Fascination",
    "ability_source": "alien_abilities",
    "description": [
      "A paraforan fragment automatically fails the saving throw against any effect that imparts the fascinated condition. When a potential threat approaches the paraforan fragment, it can attempt a saving throw against the fascinating effect, though it takes a –4 penalty to the save. A paraforan fragment loses its fast healing ability while it is fascinated and for 1d4 rounds after the fascinated condition ends."
    ],
    "types": {
      "weakness": 1
    },
    "format": "susceptible to fascination",
    "id": "abilities.susceptible_to_fascination"
  },
  {
    "name": "Acclimated",
    "ability_source": "alien_abilities",
    "description": [
      "Phentomites are acclimated to",
      "thin atmospheres and high altitudes",
      ", and they count as Small creatures for the purpose of slow",
      "suffocation",
      "."
    ],
    "types": {
      "defensive": 1
    },
    "format": "acclimated",
    "id": "abilities.acclimated"
  },
  {
    "name": "Heat Tracker",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, a phentomite can alter her vision to detect the latent heat trails left by passing creatures. This allows the phentomite to use the Perception skill to perform the follow tracks task of the Survival skill and also functions as the tracking universal creature rule. While this ability is active, the phentomite takes a –1 penalty to Reflex saving throws. The phentomite can deactivate this ability as a move action."
    ],
    "types": {
      "other": 1
    },
    "format": "heat tracker",
    "id": "abilities.heat_tracker"
  },
  {
    "name": "Evaluate",
    "ability_source": "alien_abilities",
    "description": [
      "A philosopher worm can cast",
      "detect thoughts",
      "as a swift action, and when cast, the spell works as if it had been active for 3 rounds. If the worm reads a creature’s surface thoughts and the creature fails the saving throw against the spell, the worm also learns the creature’s defensive abilities, weaknesses, and active defenses from items or spells."
    ],
    "types": {
      "other": 1
    },
    "format": "evaluate",
    "id": "abilities.evaluate"
  },
  {
    "name": "Reality Storm",
    "ability_source": "alien_abilities",
    "description": [
      "This ability works like the",
      "cosmic eddy",
      "spell (Reflex DC 22), except the damage it deals has the force descriptor. The philosopher worm teleologarch can have only one reality storm present at a time, but this ability can otherwise be used every 1d4 rounds."
    ],
    "types": {
      "offensive": 1
    },
    "format": "reality storm",
    "id": "abilities.reality_storm"
  },
  {
    "name": "Soothing Presence",
    "ability_source": "alien_abilities",
    "description": [
      "A creature in the aura must succeed at a DC 24 Will saving throw to attempt to harm the philosopher worm. A creature that succeeds at the saving throw or is attacked by any philosopher worm is immune to this aura from any philosopher worm for 24 hours. The philosopher worm has a +4 insight bonus to Diplomacy checks made to influence affected insectile creatures of any creature type in this aura. Although the aura is a mind-affecting compulsion, mindless vermin aren’t immune to it."
    ],
    "types": {
      "aura": 1
    },
    "format": "soothing presence (30 ft., Will DC 24)",
    "id": "abilities.soothing_presence"
  },
  {
    "name": "Fire Affinity",
    "ability_source": "alien_abilities",
    "description": [
      "Ifrits have an instinctive affinity for fire, subtly bending it to their will. Once per day, an ifrit making an attack that deals fire damage can roll a single attack roll twice and use the higher result."
    ],
    "types": {
      "offensive": 1
    },
    "format": "fire affinity",
    "id": "abilities.fire_affinity"
  },
  {
    "name": "Celestial Radiance",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, an aasimar can shed light, causing light within 10 feet of him to increase two steps, up to bright, and light for 10 more feet beyond that to increase one step, up to normal. This lasts for 1 minute, but the aasimar can dismiss it as a swift action. Magical darkness can decrease the light level in this area only if it’s from an item or creature of a level or CR higher than that of the aasimar. An aasimar can use this ability once per day, plus a number of times equal to half his CR or level."
    ],
    "types": {
      "other": 1
    },
    "format": "celestial radiance",
    "id": "abilities.celestial_radiance"
  },
  {
    "name": "Earth Affinity",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever an oread deals acid damage (including with spells such as",
      "energy ray",
      "), the oread can change it to bludgeoning damage instead. This doesn’t change anything else about the effect dealing the damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "earth affinity",
    "id": "abilities.earth_affinity"
  },
  {
    "name": "Elemental Assault",
    "ability_source": "alien_abilities",
    "description": [
      "As a swift action, a suli can cause half the damage dealt by a weapon she wields to be acid, cold, electricity, or fire damage for 1 round. A suli can use this ability on her unarmed strikes, causing them to be neither archaic nor nonlethal while the damage alteration persists. This suli soldier can use this ability once per day."
    ],
    "types": {
      "offensive": 1
    },
    "format": "elemental assault",
    "id": "abilities.elemental_assault"
  },
  {
    "name": "Air Affinity",
    "ability_source": "alien_abilities",
    "description": [
      "Sylphs have a +2 racial bonus to Acrobatics checks and, if able to fly, maneuverability one step better than normal."
    ],
    "types": {
      "other": 1
    },
    "format": "air affinity",
    "id": "abilities.air_affinity"
  },
  {
    "name": "Fiendish Gloom",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, the tiefling causes light within 20 feet of her to decrease one step. This gloom lasts for up to 1 minute, but the tiefling can dismiss it as a swift action. Nonmagical light sources can’t increase the light level in this area. Magical light can increase the light level in this area only if it’s from an item or creature of a level or CR higher than that of the tiefling. A tiefling can use this ability once per day, plus a number of times equal to half her CR or level."
    ],
    "types": {
      "offensive": 1
    },
    "format": "fiendish gloom",
    "id": "abilities.fiendish_gloom"
  },
  {
    "name": "Water Affinity",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever an undine deals cold damage while either the undine or her target is swimming, or in precipitation or storms heavy enough to reduce visibility ranges, they deal an amount of additional damage equal to twice their level."
    ],
    "types": {
      "offensive": 1
    },
    "format": "water affinity",
    "id": "abilities.water_affinity"
  },
  {
    "name": "Fleeting",
    "ability_source": "alien_abilities",
    "description": [
      "The chaotic energies that create a rifti degrade, and most riftis cease to exist within 1d100 hours of forming. However, some individuals live much longer."
    ],
    "types": {
      "other": 1
    },
    "format": "fleeting",
    "id": "abilities.fleeting"
  },
  {
    "name": "Random Energy",
    "ability_source": "alien_abilities",
    "description": [
      "A rifti’s unstable shape grants it fluctuating energy attacks and immunities. Each round, to determine which energy applies, roll 1d8: 1–2 acid, 3–4 electricity, 5–6 sonic, 7 cold, 8 fire."
    ],
    "types": {
      "ranged": 1,
      "immunity": 1
    },
    "format": "random energy",
    "id": "abilities.random_energy"
  },
  {
    "name": "Shifting Form",
    "ability_source": "alien_abilities",
    "description": [
      "A rifti’s shape shifts each time it takes a turn. The rifti might look like other Tiny creatures, but it can resemble objects, abstract energies, or shards of matter. These changes don’t affect the rifti’s statistics."
    ],
    "types": {
      "other": 1
    },
    "format": "shifting form",
    "id": "abilities.shifting_form"
  },
  {
    "name": "Endothermic",
    "ability_source": "alien_abilities",
    "description": [
      "A quorlu has resistance 5 to fire that stacks with one other source of fire resistance."
    ],
    "types": {
      "defensive": 1
    },
    "format": "endothermic",
    "id": "abilities.endothermic"
  },
  {
    "name": "Lithic",
    "ability_source": "alien_abilities",
    "description": [
      "A quorlu’s silicon-based physiology grants it immunity to disease and poison, and it gains no benefit from drugs, medicinals, and similar nonmagical substances. It also gains a +2 racial bonus to saving throws against bleed effects. A quorlu doesn’t breathe or suffer the normal environmental effects of being in a vacuum."
    ],
    "types": {
      "defensive": 1
    },
    "format": "lithic",
    "id": "abilities.lithic"
  },
  {
    "name": "Stable",
    "ability_source": "alien_abilities",
    "description": [
      "A quorlu gains a +4 racial bonus to AC against combat maneuvers to bull rush, reposition, or trip."
    ],
    "types": {
      "defensive": 1
    },
    "format": "stable",
    "id": "abilities.stable"
  },
  {
    "name": "Susceptible to Cold",
    "ability_source": "alien_abilities",
    "description": [
      "When a quorlu takes cold damage, it becomes fatigued for 1 round. This effect doesn’t cause a fatigued quorlu to become exhausted."
    ],
    "types": {
      "weakness": 1
    },
    "format": "susceptible to cold",
    "id": "abilities.susceptible_to_cold"
  },
  {
    "name": "Tunneler",
    "ability_source": "alien_abilities",
    "description": [
      "A quorlu can dig through soil at a rate of 5 feet per minute. A quorlu can use this ability combined with its internal heat to dig through stone at a rate of 1 foot per minute. When it digs, a quorlu can leave a tunnel behind."
    ],
    "types": {
      "other": 1
    },
    "format": "tunneler",
    "id": "abilities.tunneler"
  },
  {
    "name": "LFAN",
    "ability_source": "alien_abilities",
    "description": [
      "An LFAN, or Lifting Floret Activation Network, is a biotech augmentation that looks like a cluster of artificial, prehensile “vines” attached to a raxilite’s brain system (the raxilite can add one other brain augmentation to the LFAN). The LFAN is as dexterous and strong as a human hand, and the vines can extend and retract, allowing a raxilite to use one-handed items as if they were a Medium creature with a reach of 5 feet."
    ],
    "types": {
      "other": 1
    },
    "format": "LFAN",
    "id": "abilities.lfan"
  },
  {
    "name": "LFAN Symbiosis",
    "ability_source": "alien_abilities",
    "description": [
      "When two or more raxilites share the same 5-foot space, they can use their LFANs together, allowing them to handle larger objects. Up to four raxilites can work together in this way, each acting as one hand."
    ],
    "types": {
      "other": 1
    },
    "format": "LFAN symbiosis",
    "id": "abilities.lfan_symbiosis"
  },
  {
    "name": "Roar",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a whiskered renkroda can bellow ferociously, causing all enemies within 60 feet to become shaken for 1d4+1 rounds (Will DC 13 negates). If the renkroda hits an opponent with its tail attack, it can activate this ability as a move action before the end of its next turn. After a whiskered renkroda roars, it must wait 1d6 rounds before it can do so again. This is a mind-affecting, sensedependent fear effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "roar",
    "id": "abilities.roar"
  },
  {
    "name": "Upending Charge",
    "ability_source": "alien_abilities",
    "description": [
      "A whiskered renkroda takes no penalty to its attack roll when using the charge action. If it hits, it can immediately initiate a trip combat maneuver (this takes no action)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "upending charge",
    "id": "abilities.upending_charge"
  },
  {
    "name": "Exigency",
    "ability_source": "alien_abilities",
    "description": [
      "An observer-class security robot can expend a large store of energy to temporarily increase its processing power and attempt to avoid an attack. Once per day, it can reroll a failed Reflex saving throw with a +10 circumstance bonus."
    ],
    "types": {
      "defensive": 1
    },
    "format": "exigency",
    "id": "abilities.exigency"
  },
  {
    "name": "Jolting Arc",
    "ability_source": "alien_abilities",
    "description": [
      "Once every 1d4 rounds as a standard action, a patrol-class security robot can shoot an arc of electricity at up to four creatures within 40 feet (no two of which can be more than 30 feet apart). This arc deals 1d8 electricity damage to each target (Reflex DC 13 half)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "jolting arc",
    "id": "abilities.jolting_arc"
  },
  {
    "name": "Nanite Repair",
    "ability_source": "alien_abilities",
    "description": [
      "A patrol-class security robot’s nanites heal it, restoring a number of Hit Points per hour equal to its CR (4 Hit Points per hour for most security robots). Once per day as a full action, a patrol-class security robot can restore 3d8 Hit Points to itself or any touched construct with the technological subtype."
    ],
    "types": {
      "defensive": 1
    },
    "format": "nanite repair;",
    "id": "abilities.nanite_repair"
  },
  {
    "name": "Holographic Camouflage",
    "ability_source": "alien_abilities",
    "description": [
      "An assassin robot uses advanced sensors in conjunction with a holographic projector to blend in with its surroundings. If the assassin robot remains still for 1 round, it gains a +10 bonus to Stealth checks and is treated as having concealment until it moves out of its square; this doesn’t stack with invisibility or similar effects. As a move action, the robot can amplify this camouflage for up to 10 rounds per day, using the duration in 1-round increments. While the camouflage is amplified, the robot is affected as if by the",
      "invisibility",
      "spell."
    ],
    "types": {
      "other": 1
    },
    "format": "holographic camouflage",
    "id": "abilities.holographic_camouflage"
  },
  {
    "name": "Holographic Trick",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, an assassin robot can move up to its speed, blurred by holographic camouflage, and then make an attack with a one-handed melee weapon or small arm. After its movement, the robot can attempt a Stealth check; this check is opposed by a Perception check attempted by its target, and if the robot is successful, its target is flat-footed against the attack and takes 5d8 additional damage on a hit."
    ],
    "types": {
      "offensive": 1
    },
    "format": "holographic trick",
    "id": "abilities.holographic_trick"
  },
  {
    "name": "Retractable Weapons",
    "ability_source": "alien_abilities",
    "description": [
      "When not in use, each of an assassin robot’s weapons is folded inside the robot’s body and hidden from sight. A creature unaware of the robot’s hidden weapons must succeed at a DC 35 Perception check to notice one. An assassin robot can deploy any or all of its weapons as a swift action or as part of making an attack or full attack. Its weapons are mounted, leaving the robot’s hands free, and the robot can’t be disarmed of them. As a swift action, the robot can retract any or all of its weapons."
    ],
    "types": {
      "defensive": 1
    },
    "format": "retractable weapons;",
    "id": "abilities.retractable_weapons"
  },
  {
    "name": "Target Tracking",
    "ability_source": "alien_abilities",
    "description": [
      "As a move action, an assassin robot can lock on to one target it can see. The tracked target doesn’t benefit from concealment against the robot and can’t succeed at Bluff checks against the robot to create a diversion. This tracking ends if the tracked target dies or is destroyed, the robot ceases being able to see the target, or the robot ends it as a move action."
    ],
    "types": {
      "other": 1
    },
    "format": "target tracking",
    "id": "abilities.target_tracking"
  },
  {
    "name": "Aeon Slot",
    "ability_source": "alien_abilities",
    "description": [
      "The body of every Azlanti adjutant robot contains a slot to house a single",
      "aeon stone",
      ", usually in the center of its faceplate. A slotted",
      "aeon stone",
      "doesn’t provide its usual bonus, but instead gives the robot a bonus equal to half the",
      "aeon stone",
      "’s level (minimum +1) to saving throws against effects that deal energy damage and effects that specifically target constructs or electronic systems. As a standard action, the robot can burn out the slotted aeon stone to recover a number of Hit Points equal to 5 times the",
      "aeon stone",
      "’s level. An",
      "aeon stone",
      "burned out in this way is forever nonmagical and does not provide this or any other robot with any bonus to saving throws. Removing or slotting an",
      "aeon stone",
      "into an Azlanti adjutant robot is a full action."
    ],
    "types": {
      "defensive": 1
    },
    "format": "aeon slot (+1, 10 HP)",
    "id": "abilities.aeon_slot"
  },
  {
    "name": "Azlanti Programming",
    "ability_source": "alien_abilities",
    "description": [
      "An Azlanti battle robot’s programming is so meticulous that it is incapable of attacking an Azlanti human. However, its sensors aren’t foolproof and a creature can deceive the robot with a successful Disguise check."
    ],
    "types": {
      "weakness": 1
    },
    "format": "Azlanti programming",
    "id": "abilities.azlanti_programming"
  },
  {
    "name": "Disintegrator Beam",
    "ability_source": "alien_abilities",
    "description": [
      "An Azlanti battle robot has a disintegrator beam as a natural weapon built into one of its arms. This beam has a range increment of 30 feet and prevents the robot from wielding any other weapon that requires two hands."
    ],
    "types": {
      "ranged": 1
    },
    "format": "disintegrator beam +14 (2d6+6 A; critical corrode 1d6)",
    "id": "abilities.disintegrator_beam"
  },
  {
    "name": "Embedded Aeon Stone",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, an aeon stone can be slotted into (or removed from) an Azlanti battle robot’s forehead while the robot is helpless, pinned, or willing. The robot gains the benefit of a slotted aeon stone provided the stone’s item level is no greater than the robot’s CR + 1."
    ],
    "types": {
      "other": 1
    },
    "format": "embedded aeon stone (",
    "id": "abilities.embedded_aeon_stone"
  },
  {
    "name": "Self-Destruct",
    "ability_source": "alien_abilities",
    "description": [
      "When an Azlanti battle robot’s Hit Points are reduced to 10 or fewer, it explodes on its next turn in a 10-foot-radius burst, even if it has already been destroyed. Creatures within range take 3d6 piercing damage (Reflex DC 14 half). As a full action that provokes attacks of opportunity, a creature adjacent to the robot can attempt a DC 24 Engineering check to disarm the self-destruct mechanism before it detonates."
    ],
    "types": {
      "offensive": 1
    },
    "format": "self-destruct (3d6 P, DC 14)",
    "id": "abilities.self-destruct"
  },
  {
    "name": "Falling Crush",
    "ability_source": "alien_abilities",
    "description": [
      "If a keeper robot is at least 20 feet directly above any number of Medium or smaller creatures in a 10-foot square (usually due to its spider climb ability), it can release its grip on the surface as a move action and fall onto those creatures. The keeper robot takes falling damage as normal, but each creature it falls on takes 13d6+29 bludgeoning damage and is pinned. Each crushed target can attempt to escape the pin as normal on its turn, and the pin ends automatically if the keeper robot moves off the target’s square. A target of falling crush can’t take the falling crush damage more than once, unless the keeper robot moves fully off that creature and then falls on it again."
    ],
    "types": {
      "offensive": 1
    },
    "format": "falling crush (13d6+29 B)",
    "id": "abilities.falling_crush"
  },
  {
    "name": "Redirect Power",
    "ability_source": "alien_abilities",
    "description": [
      "A keeper robot can leech power from nearby batteries to recharge its own weapon or unleash the stolen electricity at its foes. A keeper robot can activate this ability once every 1d4 rounds as a full action; when it does, each battery within 30 feet of the robot (excluding the one in its own weapon) loses 2d4 charges. The keeper robot can redirect this power to recharge the battery in its integrated weapon with the same number of charges. Alternatively, the keeper robot can amplify this power, releasing it in a weaponized arc of electricity, dealing 19d6 electricity damage in a 40-foot cone (Reflex DC 23 half)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "redirect power (40-ft. cone, 19d6 E, Reflex DC 23 half, usable every 1d4 rounds)",
    "id": "abilities.redirect_power"
  },
  {
    "name": "Rock Tunneler",
    "ability_source": "alien_abilities",
    "description": [
      "A mining robot can burrow through stone at half speed, and it can choose to leave tunnels when it burrows."
    ],
    "types": {
      "other": 1
    },
    "format": "rock tunneler",
    "id": "abilities.rock_tunneler"
  },
  {
    "name": "Advanced Movement",
    "ability_source": "alien_abilities",
    "description": [
      "Difficult terrain doesn’t hamper a siege robot’s movement."
    ],
    "types": {
      "other": 1
    },
    "format": "advanced movement",
    "id": "abilities.advanced_movement"
  },
  {
    "name": "Autoload",
    "ability_source": "alien_abilities",
    "description": [
      "A siege robot can reload its weapons as part of the same action used to fire them."
    ],
    "types": {
      "offensive": 1
    },
    "format": "autoload",
    "id": "abilities.autoload"
  },
  {
    "name": "Hardened",
    "ability_source": "alien_abilities",
    "description": [
      "A siege robot takes half damage from explosives and collisions."
    ],
    "types": {
      "defensive": 1
    },
    "format": "hardened",
    "id": "abilities.hardened"
  },
  {
    "name": "Limited Flight",
    "ability_source": "alien_abilities",
    "description": [
      "A siege robot’s thruster-based flight works in a vacuum, but in gravity, it can fly a maximum of 10 feet above the ground."
    ],
    "types": {
      "speed": 1
    },
    "format": "fly 20 ft. (Ex, clumsy); limited flight",
    "id": "abilities.limited_flight"
  },
  {
    "name": "Hardware Acceleration",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a swift action, a terminator-class security robot can over-clock its processors to gain greater speed than other security robot models for a number of rounds equal to half its CR (5 rounds for most terminator-class security robots). This extra speed has several benefits: When making a full attack, the robot can also take a separate move action in order to move. This movement can occur before, after, or between the attacks from the full attack, but all movement must occur at the same time. In addition, the robot’s land speed increases to 70 feet. This ability functions as a haste effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "hardware acceleration",
    "id": "abilities.hardware_acceleration"
  },
  {
    "name": "Drone Mods",
    "ability_source": "alien_abilities",
    "description": [
      "A rogue drone has a number of mods equal to the number it would have as a drone built by a mechanic of a level equal to the rogue drone’s CR."
    ],
    "types": {
      "other": 1
    },
    "format": "drone mods (echolocators, enhanced armor, excavator, melee weapon arm, reductive plating, skill subroutine [Athletics], weapon proficiencies [2+2], weapon mounts [2])",
    "id": "abilities.drone_mods"
  },
  {
    "name": "Void Flyer",
    "ability_source": "alien_abilities",
    "description": [
      "A sarcesian can go 1 hour without breathing and can exist in a vacuum without suffering the associated environmental effects. By spending 1 Resolve Point, a sarcesian can extend this duration to a number of hours equal to her CR, or she can double that by spending 2 Resolve Points. When in a vacuum, sarcesians automatically grow wings made from pure energy that grant them a supernatural fly speed of 120 feet (average maneuverability) but that work only in a vacuum."
    ],
    "types": {
      "other": 1
    },
    "format": "void flyer",
    "id": "abilities.void_flyer"
  },
  {
    "name": "Aura of Light",
    "ability_source": "alien_abilities",
    "description": [
      "The light level increases by one step within 10 feet of a shakalta. If the shakalta’s body is mostly covered, such as by opaque armor, this light diminishes to a 5-foot radius. Complete covering can douse the light."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.aura_of_light"
  },
  {
    "name": "Bonded Souls",
    "ability_source": "alien_abilities",
    "description": [
      "Two souls bond to form an adult shakalta. Each soul has its own awareness, identity, and personality, but each can communicate with the other and access the other’s thoughts and memories. When these souls bond, they create one shared permanent physical body out of coherent energy. Each day, after the shakalta rests to regain daily-use abilities, one soul takes active control of the body, which might change slightly in appearance to match the active personality. The other soul is still present but becomes mostly inactive, able to communicate only with the active soul. The inactive soul is also beyond the reach of other outside communication and mind-affecting effects. If a shakalta dies, both souls leave the shared body, but the bonded pair counts as one soul for raise dead and similar life-restoring effects."
    ],
    "types": {
      "other": 1
    },
    "format": "bonded souls",
    "id": "abilities.bonded_souls"
  },
  {
    "name": "Psychic Shunt",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day, as a reaction when a shakalta fails a saving throw against a mind-affecting effect, the active soul can divert the effect to the inactive soul. The active soul is unaffected by the effect, but for the duration of that effect, the shakalta has the off-target condition and takes a –2 penalty to skill checks. While a mind-affecting effect is diverted to the inactive soul, spells can be cast to end the effect as if the whole shakalta were affected by it. If the souls switch active states while either is affected by a mind-affecting effect, the shakalta gains a new saving throw against those effects."
    ],
    "types": {
      "defensive": 1
    },
    "format": "psychic shunt",
    "id": "abilities.psychic_shunt"
  },
  {
    "name": "Star Sustenance",
    "ability_source": "alien_abilities",
    "description": [
      "Shakaltas gain sustenance from the light of stars, and they don’t need water, although they can eat and drink if they wish. A shakalta can go without such light, which starship and space station lights can duplicate, for 1 day plus a number of hours equal to their Constitution score, after which they must attempt Constitution checks as if going without water."
    ],
    "types": {
      "weakness": 1
    },
    "format": "star sustenance",
    "id": "abilities.star_sustenance"
  },
  {
    "name": "Psychometry",
    "ability_source": "alien_abilities",
    "description": [
      "By taking a standard action to touch a creature or object, a shatori gains a +4 racial bonus to their next check to identify the creature, their next check to recall knowledge about the creature or the object, or their next Sense Motive check against the creature. To touch an unwilling creature, the shatori must succeed at a melee attack roll against that creature’s EAC."
    ],
    "types": {
      "other": 1
    },
    "format": "psychometry",
    "id": "abilities.psychometry"
  },
  {
    "name": "Shared Stillness",
    "ability_source": "alien_abilities",
    "description": [
      "Allies within 10 feet of a shatori gain a +1 morale bonus to saving throws against fear effects."
    ],
    "types": {
      "other": 1
    },
    "format": "shared stillness",
    "id": "abilities.shared_stillness"
  },
  {
    "name": "Amplify",
    "ability_source": "alien_abilities",
    "description": [
      "Whenever a shimreen takes energy damage, they can voluntarily take an additional 1d4 damage of the same type by amplifying the energy within their crystalline form. The next time the shimreen hits with a melee attack, they release this energy, dealing an additional amount of damage equal to the extra damage the shimreen took (and of the same type). The shimreen can’t take additional damage in this way again until they release the energy they’re storing. If unused, this stored energy dissipates after 10 minutes. The amount of extra damage the shimreen takes (and deals) increases to 2d4 at 8th level (or CR 8) and 3d4 at 16th level (or CR 16)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "amplify (1d4)",
    "id": "abilities.amplify"
  },
  {
    "name": "Radiant",
    "ability_source": "alien_abilities",
    "description": [
      "A shimreen constantly emits dim, normal, or bright light in a 5-foot radius and is immune to the dazzled condition. A shimreen can adjust their current level of light as a move action, but they can’t extinguish it."
    ],
    "types": {
      "other": 1
    },
    "format": "radiant",
    "id": "abilities.radiant"
  },
  {
    "name": "Shift Limb",
    "ability_source": "alien_abilities",
    "description": [
      "As a swift action, a shimreen can transform one of their hands into a natural weapon that deals piercing damage. While transformed, this hand can’t be used to hold or use anything. The shimreen can reverse the transformation as a swift action."
    ],
    "types": {
      "other": 1
    },
    "format": "shift limb",
    "id": "abilities.shift_limb"
  },
  {
    "name": "Jungle Strider",
    "ability_source": "alien_abilities",
    "description": [
      "Shotalashus are adept at traversing all forms of forest terrain. While in forest terrain, a shotalashu’s speed is not impeded by natural difficult terrain such as undergrowth."
    ],
    "types": {
      "other": 1
    },
    "format": "jungle strider",
    "id": "abilities.jungle_strider"
  },
  {
    "name": "Pack Telepathy",
    "ability_source": "alien_abilities",
    "description": [
      "This functions as the shotalashu mount’s telepathic link ability (see the",
      "shotalashu",
      "entry) except that instead of forming a bond with a single lashunta, a feral shotalashu can create a link with up to 5 other shotalashus in a process that requires no skill check but takes 1 year of close interaction rather than a single hour. When any member of a pack’s telepathic network dies, each other shotalashu directly linked to that creature is dazed for 1 round but takes no damage."
    ],
    "types": {
      "other": 1
    },
    "format": "pack telepathy",
    "id": "abilities.pack_telepathy"
  },
  {
    "name": "Cluster",
    "ability_source": "alien_abilities",
    "description": [
      "Skreelings are born and grow to adulthood in small packs, and they are more comfortable fighting alongside other skreelings, including their siblings. When two or more skreelings flank a single creature, each skreeling attacking that creature receives an additional +1 circumstance bonus to attack rolls. In addition, when a skreeling hits a creature that two or more skreelings are flanking, that creature gains the bleeding condition for 1 damage, in addition to the skreeling’s normal damage. The damage from the bleeding condition increases by 1 for each individual skreeling that successfully hits the creature, but it does not increase if the same skreeling hits multiple times. (For example, a single creature hit by two flanking skreelings gains the bleeding condition for 2 damage, but the same creature hit multiple times by the same skreeling only gains the bleeding condition for 1 damage)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "cluster",
    "id": "abilities.cluster"
  },
  {
    "name": "Aglow",
    "ability_source": "alien_abilities",
    "description": [
      "A solar wisp increases the light level by one step out to a radius of 10 feet × half the solar wisp’s CR."
    ],
    "types": {
      "other": 1
    },
    "format": "aglow (20 ft.)",
    "id": "abilities.aglow"
  },
  {
    "name": "Conflagration",
    "ability_source": "alien_abilities",
    "description": [
      "Once every 1d4 rounds as a standard action, a mature solar wisp can hurl a portion of its burning form at a grid intersection within 120 feet, at which point the flames detonate, dealing 10d6 fire damage to all creatures within a 20-foot-radius burst. An affected creature can attempt a DC 24 Reflex saving throw to halve the damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "conflagration",
    "id": "abilities.conflagration"
  },
  {
    "name": "Gravitational Pull Aura",
    "ability_source": "alien_abilities",
    "description": [
      "A creature within 120 feet of a mature solar wisp has its speed reduced by half when it moves away from the solar wisp, and can move at double its speed when moving toward the solar wisp."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.gravitational_pull_aura"
  },
  {
    "name": "Solar Ray",
    "ability_source": "alien_abilities",
    "description": [
      "A mature solar wisp can project an intense ray of light as a ranged attack against a target within 240 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "solar ray +34 (8d8+19 F; critical burn 6d6)",
    "id": "abilities.solar_ray"
  },
  {
    "name": "Stellar Heat",
    "ability_source": "alien_abilities",
    "description": [
      "A creature adjacent to a mature solar wisp takes 3d12 fire damage from the intense heat that the elemental radiates. A creature that succeeds at DC 24 Fortitude save takes half this damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "stellar heat",
    "id": "abilities.stellar_heat"
  },
  {
    "name": "Shapable",
    "ability_source": "alien_abilities",
    "description": [
      "Given 1 minute, a spathinae colony can alter their shape. The colony can form and control up to four limbs. If the spathinae colony loses a limb, they can use this ability to “regrow” the limb. At least two of these limbs must be used for locomotion, or the colony’s land speed is reduced by 10 feet. If the colony has multiple limbs that operate like arms and hands, they can hold more objects at the ready, but they can’t make additional attacks. A spathinae colony can alter their shape to use armor and gear normally designed for almost any Small or Medium creature. However, a spathinae colony wearing armor not adjusted for them or powered armor can use neither their swarm flexibility ability nor the colony’s natural fly speed."
    ],
    "types": {
      "other": 1
    },
    "format": "shapable",
    "id": "abilities.shapable"
  },
  {
    "name": "Spathinae Defenses",
    "ability_source": "alien_abilities",
    "description": [
      "A spathinae colony has a +2 racial bonus to saving throws against bleed, critical hit effects, paralysis, sleep, and stunning. An effect that states it has a greater effect on swarms works on a spathinae colony as if they were a swarm. However, the swarm defenses universal creature rule does not apply to spathinae colonies."
    ],
    "types": {
      "defensive": 1
    },
    "format": "spathinae defenses",
    "id": "abilities.spathinae_defenses"
  },
  {
    "name": "Swarm Flexibility",
    "ability_source": "alien_abilities",
    "description": [
      "A spathinae colony has compression and gains a +4 racial bonus to KAC against bull rush, grapple, reposition, and trip combat maneuvers. In addition, the colony can always take 10 on the escape and tumble tasks of the Acrobatics skill and gains a +4 racial bonus to Acrobatics checks for those tasks."
    ],
    "types": {
      "other": 1
    },
    "format": "specialization (explorer) swarm flexibility",
    "id": "abilities.swarm_flexibility"
  },
  {
    "name": "Balancing Gaze",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, an aspecna can force each chaotic, evil, good, or lawful creature within 30 feet to attempt a DC 25 Will saving throw. Creatures that fail this save gain the staggered condition for 1d4 rounds, and the DCs of their spells and abilities are reduced by 2 for the same duration. Creatures that succeed at this save are immune to that aspecna’s balancing gaze for 24 hours. This is a sense‑dependent effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "balancing gaze",
    "id": "abilities.balancing_gaze"
  },
  {
    "name": "Bloom Beam",
    "ability_source": "alien_abilities",
    "description": [
      "An aspecna’s bloom beam is a ranged attack with a range of 120 feet, the blast weapon special property, and the stunned critical hit effect."
    ],
    "types": {
      "ranged": 1
    },
    "format": "bloom beam +27 (3d12+18 F; critical stunned)",
    "id": "abilities.bloom_beam"
  },
  {
    "name": "Hyperflux",
    "ability_source": "alien_abilities",
    "description": [
      "The area surrounding an aspecna crackles with constant uncertainty and potential for change as it shuffles reality, reorganizing and optimizing the planar energies on which it draws. As a move action, an aspecna can change the type of energy damage (from fire to sonic, for instance) done by its bloom beam and spell-like abilities for 1 minute."
    ],
    "types": {
      "offensive": 1
    },
    "format": "hyperflux",
    "id": "abilities.hyperflux"
  },
  {
    "name": "Seek Outcome",
    "ability_source": "alien_abilities",
    "description": [
      "An aspecna can peer into the causal nexus of ongoing events to calculate the most efficient course of action. An aspecna can take 10 on any skill check, even during combat or if stress or distractions would normally prevent it from doing so. In addition, three times per day, an aspecna can reroll a failed ability check, attack roll, or saving throw."
    ],
    "types": {
      "other": 1
    },
    "format": "seek outcome",
    "id": "abilities.seek_outcome"
  },
  {
    "name": "Dusk Ray",
    "ability_source": "alien_abilities",
    "description": [
      "An iridia’s dusk ray is a ranged attack with a range increment of 60 feet and the line weapon special property."
    ],
    "types": {
      "ranged": 1
    },
    "format": "dusk ray +18 (1d10+8 C & E)",
    "id": "abilities.dusk_ray"
  },
  {
    "name": "Squox Tricks",
    "ability_source": "alien_abilities",
    "description": [
      "A squox can use Acrobatics to jump instead of Athletics. In addition, a squox can use its Acrobatics bonus as its attack bonus when it attempts a dirty trick, disarm, or trip combat maneuver. If the squox succeeds at a dirty trick maneuver, it can choose only between the entangled and off-target conditions. A squox’s tail, two front paws, and mouth count as hands free for a disarm attempt."
    ],
    "types": {
      "offensive": 1
    },
    "format": "squox tricks",
    "id": "abilities.squox_tricks"
  },
  {
    "name": "Camouflage",
    "ability_source": "alien_abilities",
    "description": [
      "A stridermander can alter the color and texture of its fur to blend into its environment. Whenever a stridermander remains motionless for 1 round, it gains a +10 bonus to Stealth checks (this bonus doesn’t stack with the invisibility spell or similar effects). If the stridermander moves more than 10 feet or takes a hostile action (such as attacking or casting a spell), it loses this bonus until it once again spends 1 round remaining still."
    ],
    "types": {
      "defensive": 1
    },
    "format": "camouflage",
    "id": "abilities.camouflage"
  },
  {
    "name": "Feeding Tendril",
    "ability_source": "alien_abilities",
    "description": [
      "A stridermander’s secondary mouth is similar to a skittermander whelp’s, but it has a more powerful and developed feeding tendril. As a standard action, a stridermander can strike at a creature its size or smaller up to 10 feet away with this tendril. In addition to dealing damage, if the stridermander hits the target’s KAC + 4, it grapples the target and pulls the target adjacent to the stridermander; this movement doesn’t provoke attacks of opportunity. The stridermander doesn’t need to have a limb free to perform or maintain this grapple, but it can only grapple one target at a time. The stridermander can maintain this grapple with the same attack as a move action on subsequent rounds."
    ],
    "types": {
      "melee": 1
    },
    "format": "feeding tendril +23 (1d6+18 P)",
    "id": "abilities.feeding_tendril"
  },
  {
    "name": "Gorge",
    "ability_source": "alien_abilities",
    "description": [
      "When a stridermander hits with its bite attack against a creature it has grappled with its feeding tendril, it deals additional damage equal to its Strength modifier."
    ],
    "types": {
      "offensive": 1
    },
    "format": "gorge (+8)",
    "id": "abilities.gorge"
  },
  {
    "name": "Bristle Nova",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day as a standard action, a tashtari alpha can cause its filaments to flare with intense light. Each creature within 60 feet must succeed at a DC 15 Fortitude save or be blinded for 1d4 rounds. Creatures that succeed at this save are instead dazzled for 1 round. This ability has no effect on sightless creatures. Tashtaris and tashtari alphas are immune to the effects of this ability."
    ],
    "types": {
      "offensive": 1
    },
    "format": "bristle nova",
    "id": "abilities.bristle_nova"
  },
  {
    "name": "Muzzle Beam",
    "ability_source": "alien_abilities",
    "description": [
      "As an attack, a tashtari alpha can unleash a focused ray of light from its mouth that can burn a target like the beam of a laser rifle. This ray has a range increment of 120 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "muzzle beam +18 (2d6+7 F; critical burn 1d6)",
    "id": "abilities.muzzle_beam"
  },
  {
    "name": "Flashback",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day, a telia can reroll a failed Intelligence-based skill check."
    ],
    "types": {
      "other": 1
    },
    "format": "flashback",
    "id": "abilities.flashback"
  },
  {
    "name": "Retract",
    "ability_source": "alien_abilities",
    "description": [
      "A telia that takes the total defense action gains a +6 bonus to their Armor Class instead of the usual +4 bonus, and they also gain the unflankable universal creature rule until the start of their next turn."
    ],
    "types": {
      "defensive": 1
    },
    "format": "retract",
    "id": "abilities.retract"
  },
  {
    "name": "Stinger",
    "ability_source": "alien_abilities",
    "description": [
      "As a ranged attack, a Swarm antecursor can launch a poisoned stinger from its tail with a range increment of 50 feet. Each stinger is coated with a paralytic neurotoxin (see below)."
    ],
    "types": {
      "ranged": 1
    },
    "format": "stinger +10 (1d4+3 P plus paralytic neurotoxin)",
    "id": "abilities.stinger"
  },
  {
    "name": "Consume",
    "ability_source": "alien_abilities",
    "description": [
      "A creature struck by a Swarm ceretoram’s tentacle must succeed at a DC 18 Fortitude save or have some of its biological matter siphoned off by the attack, taking an additional 1d8 piercing damage. The ceretoram then regains Hit Points equal to double this additional damage."
    ],
    "types": {
      "melee": 1
    },
    "format": "tentacle +15 (1d8+12 P plus consume; critical staggered [DC 18])",
    "id": "abilities.consume"
  },
  {
    "name": "Remote Pulse",
    "ability_source": "alien_abilities",
    "description": [
      "As a reaction when a creature fails its save against a ceretoram’s",
      "mind thrust",
      "spell-like ability, the ceretoram can immediately cast its",
      "synaptic pulse",
      "spell-like ability, centering the effect on the target of the",
      "mind thrust",
      ". That creature isn’t subject to the effects of the",
      "synaptic pulse",
      "."
    ],
    "types": {
      "offensive": 1
    },
    "format": "remote pulse",
    "id": "abilities.remote_pulse"
  },
  {
    "name": "Acid Burst",
    "ability_source": "alien_abilities",
    "description": [
      "When a convecyte dies, its protective plates crack and explode, showering an area with their acidic contents. Every creature within a 20-foot burst (including those within the convecyte) takes 2d4+4 acid damage (Reflex DC 11 half)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "acid burst (2d4+4 A, DC 11)",
    "id": "abilities.acid_burst"
  },
  {
    "name": "Swarm Carrier",
    "ability_source": "alien_abilities",
    "description": [
      "A convecyte can carry a number of creatures under its chitinous layers, giving each creature DR 10/— and full cover from attacks while they rest inside, though such creatures can’t act while inside a convecyte. A convecyte can carry four Small or two Medium creatures this way and can deposit them in adjacent squares as a swift action."
    ],
    "types": {
      "other": 1
    },
    "format": "Swarm carrier",
    "id": "abilities.swarm_carrier"
  },
  {
    "name": "Corrosive Jet",
    "ability_source": "alien_abilities",
    "description": [
      "The Swarm dissolver can spew a jet of corrosive chemicals with a range of 30 feet. This attack has the line and unwieldy weapon special properties."
    ],
    "types": {
      "ranged": 1
    },
    "format": "corrosive jet +23 (3d8+11 A & F; critical corrode 2d4)",
    "id": "abilities.corrosive_jet"
  },
  {
    "name": "Wing Gust",
    "ability_source": "alien_abilities",
    "description": [
      "A Swarm dissolver’s vestigial wings have surprising power. As a standard action, a Swarm dissolver can beat its wings rapidly to create a powerful gust of wind in a 30-foot cone. All nonmagical flames in the cone are extinguished, and any Medium or smaller creatures in the area must succeed at a DC 18 Reflex save or be pushed 10 feet away from the Swarm dissolver and knocked prone."
    ],
    "types": {
      "offensive": 1
    },
    "format": "wing gust",
    "id": "abilities.wing_gust"
  },
  {
    "name": "Acidic Grease",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a dramovire can cover a 10-foot square within 20 feet with a layer of acidic grease sprayed from its proboscis. Each creature in the area must succeed at a DC 16 Reflex save or fall prone. A creature can walk within or through the area of grease at half its normal speed with a successful DC 16 Acrobatics check to balance; failure means the creature can’t move that round and must succeed at a DC 16 Reflex saving throw or fall prone, while failure by 5 or more means it automatically falls prone. A creature that doesn’t move on its turn doesn’t need to attempt the check. A creature that ends its turn within the area takes 4d6 acid damage, plus 4 additional acid damage at the end of its next turn. The pool of acidic grease lasts for a number of minutes equal to the dramovire’s CR."
    ],
    "types": {
      "offensive": 1
    },
    "format": "acidic grease (DC 16, 8 minutes)",
    "id": "abilities.acidic_grease"
  },
  {
    "name": "Snagging Protrusions",
    "ability_source": "alien_abilities",
    "description": [
      "The limbs of a dramovire are covered with small protrusions designed to make it easy to grasp its prey. A creature that successfully escapes from a dramovire’s grapple takes 3d4 slashing damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "snagging protrusions (3d4 S)",
    "id": "abilities.snagging_protrusions"
  },
  {
    "name": "Bioelectric Arc",
    "ability_source": "alien_abilities",
    "description": [
      "As a ranged attack, an effigene can unleash a blast of electrical energy with a range increment of 30 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "bioelectric arc +13 (1d4+5 E; critical arc 1d4)",
    "id": "abilities.bioelectric_arc"
  },
  {
    "name": "Invigorate Swarm",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, an effigene can manipulate the bioelectrical energy of an allied Swarm creature within 30 feet to cause unexpected movement. That creature can immediately take a guarded step or move up to its speed."
    ],
    "types": {
      "offensive": 1
    },
    "format": "invigorate Swarm",
    "id": "abilities.invigorate_swarm"
  },
  {
    "name": "Pummel",
    "ability_source": "alien_abilities",
    "description": [
      "When a Swarm escutchide hits with its gore attack, it deals normal damage. If the attack roll result equals or exceeds the target’s KAC + 4, the escutchide can either knock the target prone or move the target 5 feet in any direction."
    ],
    "types": {
      "melee": 1
    },
    "format": "gore +15 (1d6+10 P plus pummel)",
    "id": "abilities.pummel"
  },
  {
    "name": "Shattering Rumble",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a Swarm molitera can focus its vibrational emanations into a painful 30-foot cone. Each creature in the cone takes 4d6 sonic damage (Fortitude DC 14 half)."
    ],
    "types": {
      "offensive": 1
    },
    "format": "shattering rumble (4d6 So, DC 14)",
    "id": "abilities.shattering_rumble"
  },
  {
    "name": "Stone Tunneler",
    "ability_source": "alien_abilities",
    "description": [
      "A Swarm molitera can burrow through solid rock as easily as dirt and can leave behind a 10-foot-wide, 10-foot-tall tunnel if it chooses."
    ],
    "types": {
      "other": 1
    },
    "format": "stone tunneler",
    "id": "abilities.stone_tunneler"
  },
  {
    "name": "Adhesive Cannon",
    "ability_source": "alien_abilities",
    "description": [
      "As a ranged attack, a nauphage can fire blobs of electrically charged glue with a range increment of 30 feet. In addition to taking damage, a creature struck with this glue is entangled for 1d4 rounds; such a creature can escape with a successful DC 18 Acrobatics check or a DC 13 Strength check attempted as a standard action. This weapon can’t be disarmed and produces its own ammunition, so it never runs out."
    ],
    "types": {
      "ranged": 1
    },
    "format": "adhesive cannon +7 (1d4+2 E plus entangle)",
    "id": "abilities.adhesive_cannon"
  },
  {
    "name": "Organic Rig",
    "ability_source": "alien_abilities",
    "description": [
      "One of the nauphage’s arms ends in slender appendages that can be configured to perform a variety of tasks. A nauphage always counts as having the appropriate tool or basic kit for any Computers or Engineering check it attempts."
    ],
    "types": {
      "other": 1
    },
    "format": "organic rig",
    "id": "abilities.organic_rig"
  },
  {
    "name": "Storage Sac",
    "ability_source": "alien_abilities",
    "description": [
      "A nauphage can store up to 2 cubic feet of items weighing no more than 4 bulk in total in a storage sac. It can transfer a single object between its sac and a claw as a swift action."
    ],
    "types": {
      "other": 1
    },
    "format": "storage sac",
    "id": "abilities.storage_sac"
  },
  {
    "name": "Ear-Splitting Shriek",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a Swarm revulsor can let out a shriek that can split eardrums and disrupt other auditory receptors. Each creature within a 30-foot cone takes 4d6 sonic damage (Reflex DC 13 half) and is deafened for 1d4 minutes (Fortitude DC 13 negates). This shriek also ignores 4 hardness when damaging objects."
    ],
    "types": {
      "offensive": 1
    },
    "format": "ear-splitting shriek (30‑ft. cone, 4d6 So plus deafen, DC 13)",
    "id": "abilities.ear-splitting_shriek"
  },
  {
    "name": "Acid Cannon",
    "ability_source": "alien_abilities",
    "description": [
      "A corrovox has an organic acid cannon grafted onto its forearm that can fire blobs of organic acid at a range increment of 40 feet. This weapon can’t be disarmed and produces its own ammunition, so it never runs out."
    ],
    "types": {
      "ranged": 1
    },
    "format": "acid cannon +12 (1d4+3 A; critical corrode 1d4)",
    "id": "abilities.acid_cannon"
  },
  {
    "name": "Psychic Assault",
    "ability_source": "alien_abilities",
    "description": [
      "A corrovox can unleash a burst of harmful mental chatter at a target within 30 feet as a standard action. The target takes an amount of damage equal to 1d4 × the corrovox’s CR (3d4 damage for most corrovoxes). A successful DC 12 Will save halves this damage."
    ],
    "types": {
      "offensive": 1
    },
    "format": "psychic assault",
    "id": "abilities.psychic_assault"
  },
  {
    "name": "Arm Spike",
    "ability_source": "alien_abilities",
    "description": [
      "A spike projects from one of the mindreaper’s hands. The mindreaper cannot wield a weapon with this hand, and it can’t be disarmed of this spike."
    ],
    "types": {
      "melee": 1
    },
    "format": "arm spike +14 (1d8+8 P; critical staggered [DC 17])",
    "id": "abilities.arm_spike"
  },
  {
    "name": "Trepan",
    "ability_source": "alien_abilities",
    "description": [
      "As a full action, a mindreaper can use its arm spike to pierce the skull of a helpless creature. The mindreaper makes one attack with its arm spike, scoring a critical hit if the attack succeeds. If this attack kills the target, the mindreaper siphons out a portion of the target’s brain along with an impression of the creature’s memories. A mindreaper can also use this ability to extract brain matter and memories from the remains of a creature killed within the last hour. This ability can be used only against living or recently killed creatures with a brain or close biological equivalent."
    ],
    "types": {
      "other": 1,
      "offensive": 1
    },
    "format": "trepan",
    "id": "abilities.trepan"
  },
  {
    "name": "Trepan Analysis",
    "ability_source": "alien_abilities",
    "description": [
      "A mindreaper that has extracted brain matter with its trepan ability can analyze the memories stored within. Doing so functions as",
      "speak with dead",
      ", except the mindreaper has an hour after extracting the memories to ask the six questions, which need not be asked all at one time. Asking a question takes a full action. Only one mindreaper can extract memories from a given creature. A mindreaper can retain only one set of memories at a time; if it uses its trepan ability on another creature, any previously stored brain matter is lost."
    ],
    "types": {
      "other": 1
    },
    "format": "trepan analysis",
    "id": "abilities.trepan_analysis"
  },
  {
    "name": "Arm Blade",
    "ability_source": "alien_abilities",
    "description": [
      "A thresher lord has massive blades grafted onto its forearms, replacing its normal hands. A thresher lord can’t wield any other weapons, but neither can it be disarmed."
    ],
    "types": {
      "melee": 1
    },
    "format": "arm blade +23 (2d10+18 S; critical bleed 1d8)",
    "id": "abilities.arm_blade"
  },
  {
    "name": "Blade Storm",
    "ability_source": "alien_abilities",
    "description": [
      "When making a full attack entirely with melee weapons, a thresher lord takes a –3 penalty to each attack roll instead of the normal –4 penalty. In addition, a thresher lord can make up to three melee attacks instead of two attacks when making a full attack. If it does so, it takes a –5 penalty to these attacks."
    ],
    "types": {
      "offensive": 1
    },
    "format": "blade storm",
    "id": "abilities.blade_storm"
  },
  {
    "name": "Arm Barb",
    "ability_source": "alien_abilities",
    "description": [
      "As a ranged attack, a vorphoma can shoot a finger-sized barb from one of its arms with a range increment of 60 feet. A vorphoma can shoot a total of 8 barbs before it must take 10 minutes to regrow them."
    ],
    "types": {
      "ranged": 1
    },
    "format": "arm barb +5 (1d4+1 P plus venom)",
    "id": "abilities.arm_barb"
  },
  {
    "name": "Venom",
    "ability_source": "alien_abilities",
    "description": [
      "A living creature that takes damage from an arm barb must succeed at a DC 12 Fortitude save or be sickened for 1d3 rounds."
    ],
    "types": {
      "ranged": 1
    },
    "format": "arm barb +5 (1d4+1 P plus venom)",
    "id": "abilities.venom"
  },
  {
    "name": "Maul",
    "ability_source": "alien_abilities",
    "description": [
      "If the troll hits the same target with two claw attacks during the same turn, it can attempt a bite attack against that target with a –6 penalty to the attack roll."
    ],
    "types": {
      "offensive": 1
    },
    "format": "maul",
    "id": "abilities.maul"
  },
  {
    "name": "Void Hide",
    "ability_source": "alien_abilities",
    "description": [
      "The troll can reffect some effects back at attackers or casters within 100 feet by spending 1 Resolve Point to do so, limited by the following parameters. If an attack misses the troll by 5 or fewer, as a reaction the troll can reflect the attack back at the attacker. The reflected attack deals the damage the troll would have taken, up to 30 damage (Reflex DC 20 for half). Similarly, if a spell of 4th level or lower targets the troll directly and fails to overcome the troll’s SR, as a reaction the troll can reflect the spell back at its caster as if the caster had been the target. This ability doesn’t work on effects that include the troll as one of multiple targets."
    ],
    "types": {
      "defensive": 1
    },
    "format": "void hide;",
    "id": "abilities.void_hide"
  },
  {
    "name": "Cling",
    "ability_source": "alien_abilities",
    "description": [
      "Each creature that takes damage from a dredger troop’s troop attack must succeed at a DC 13 Reflex save or gain the flat-footed and off-target conditions until the end of the troop’s next turn as dredgers cling to the target’s body, throwing off their aim and balance."
    ],
    "types": {
      "melee": 1
    },
    "format": "troop attack (1d4+8 S plus cling [DC 13])",
    "id": "abilities.cling"
  },
  {
    "name": "Bulwark",
    "ability_source": "alien_abilities",
    "description": [
      "When a trox fights defensively or takes the total defense action, he can grant half the bonus to AC granted by that action to an adjacent ally."
    ],
    "types": {
      "defensive": 1
    },
    "format": "bulwark",
    "id": "abilities.bulwark"
  },
  {
    "name": "Frenzy",
    "ability_source": "alien_abilities",
    "description": [
      "Once per day when a significant enemy causes an ally to take Hit Point damage, a trox can fly into a frenzy, gaining a +2 racial bonus to melee attack rolls and a –2 penalty to AC for 1 minute."
    ],
    "types": {
      "offensive": 1
    },
    "format": "frenzy",
    "id": "abilities.frenzy"
  },
  {
    "name": "Grappler",
    "ability_source": "alien_abilities",
    "description": [
      "Trox gain a +2 racial bonus to grapple combat maneuvers."
    ],
    "types": {
      "offensive": 1
    },
    "format": "grappler",
    "id": "abilities.grappler"
  },
  {
    "name": "Vesitigal Arms",
    "ability_source": "alien_abilities",
    "description": [
      "A trox’s four vestigial arms can be used to hold, draw, or put away items of negligible bulk, but not to make attacks, wield weapons, or use items."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.vesitigal_arms"
  },
  {
    "name": "Staggered",
    "ability_source": "alien_abilities",
    "description": [
      "An occult zombie is always considered staggered and can never take more than a single move or standard action in a round. It can’t take full actions."
    ],
    "types": {
      "weakness": 1
    },
    "format": "staggered",
    "id": "abilities.staggered"
  },
  {
    "name": "Deft Claws",
    "ability_source": "alien_abilities",
    "description": [
      "A jiang-shi’s claw attack has the grab ability (Starfinder Alien Archive 155) and the operative weapon special property."
    ],
    "types": {
      "offensive": 1
    },
    "format": "deft claws",
    "id": "abilities.deft_claws"
  },
  {
    "name": "Drain Chi",
    "ability_source": "alien_abilities",
    "description": [
      "When a jiang-shi succeeds at a grapple combat maneuver, it can drain “chi,” or life energy, by drinking its victim’s breath. A victim must succeed at DC 16 Fortitude save or gain 1 negative level and be staggered for 1d4 rounds."
    ],
    "types": {
      "offensive": 1
    },
    "format": "drain chi",
    "id": "abilities.drain_chi"
  },
  {
    "name": "Hopping Gait",
    "ability_source": "alien_abilities",
    "description": [
      "A jiang-shi moves by hopping, and its land speed is reduced by 10 feet from its base creature’s speed (this adjustment is already included in the statistics above). A jiang-shi ignores difficult terrain and can’t be tripped. Other speeds (such as fly and swim speeds) are unaffected by this ability."
    ],
    "types": {
      "other": 1
    },
    "format": "hopping gait",
    "id": "abilities.hopping_gait"
  },
  {
    "name": "Jiang-Shi Weaknesses",
    "ability_source": "alien_abilities",
    "description": [
      "A jiang-shi is held at bay by cooked rice, mirrors, or ringing a handbell. It must stay at least 5 feet away from the object of its revulsion and cannot touch or make melee attacks against a creature brandishing such an object. Holding a jiang-shi at bay is a standard action. After being held at bay for 1 round, a jiang-shi can attempt a DC 20 Will save at the beginning of its turn to act normally."
    ],
    "types": {
      "weakness": 1
    },
    "format": "jiang-shi weaknesses",
    "id": "abilities.jiang-shi_weaknesses"
  },
  {
    "name": "Prayer Scroll",
    "ability_source": "alien_abilities",
    "description": [
      "The holographic prayer scroll at a jiang-shi’s brow grants immunity to any effects from spell gems or other items that store spells, as if the jiang-shi had unbeatable spell resistance. It also grants the jiangshi fast healing 5 and prevents the jiang-shi from being destroyed. When reduced to 0 Hit Points, a jiang-shi crumbles to dust, but it re-forms in 1 minute with 1 Hit Point in the nearest unoccupied space. Scattering the dust or mixing rice into the dust with a dose of vinegar before the jiang-shi re-forms destroys it permanently."
    ],
    "types": {
      "defensive": 1
    },
    "format": "prayer scroll;",
    "id": "abilities.prayer_scroll"
  },
  {
    "name": "Deathless Vitality",
    "ability_source": "alien_abilities",
    "description": [
      "Varculaks are immune to disease, and they neither breathe nor suffer the normal environmental effects of being in a vacuum. They gain a +2 racial bonus to saving throws against ability damage, ability drain, bleed, death effects, energy drain, exhaustion, fatigue, negative levels, paralysis, poison, sleep, and stunning. In addition, effects that heal the living heal varculaks. A varculak needs to eat and drink."
    ],
    "types": {
      "defensive": 1
    },
    "format": "deathless vitality",
    "id": "abilities.deathless_vitality"
  },
  {
    "name": "Deathless Weakness",
    "ability_source": "alien_abilities",
    "description": [
      "A varculak can be raised from the dead and always returns as a varculak. When dying, a varculak must spend 1 additional Resolve Point (maximum 4) to stabilize and stay in the fight. Further, while at 0 Hit Points, a varculak subjected to an effect that restores Hit Points regains only half as many as the effect normally restores (minimum 1)."
    ],
    "types": {
      "weakness": 1
    },
    "format": "deathless weakness",
    "id": "abilities.deathless_weakness"
  },
  {
    "name": "Grave Touch",
    "ability_source": "alien_abilities",
    "description": [
      "A varculak imparts the leech critical hit effect to any melee weapon it wields, but the saving throw DC is 10 + the varculak’s level + its Strength modifier, and the duration of the effect is 1d4 rounds. In addition, when a creature fails its save against this leech critical hit effect, the varculak regains a number of Hit Points equal to half its CR or level (minimum 0). If the weapon already has a critical hit effect, the varculak must choose which to apply on a critical hit."
    ],
    "types": {
      "offensive": 1
    },
    "format": "grave touch (DC 13)",
    "id": "abilities.grave_touch"
  },
  {
    "name": "Silver Susceptibility",
    "ability_source": "alien_abilities",
    "description": [
      "Kinetic attacks with silver weapons bypass any DR a varculak has. If a varculak takes a critical hit from such an attack, the varculak must succeed at a Fortitude saving throw against the weapon’s critical hit DC or be staggered for 1 round."
    ],
    "types": {
      "weakness": 1
    },
    "format": "silver susceptibility",
    "id": "abilities.silver_susceptibility"
  },
  {
    "name": "Torpor",
    "ability_source": "alien_abilities",
    "description": [
      "A varculak needs rest like a living humanoid but sleeps very heavily. When asleep, varculaks are hard to rouse, taking a –15 penalty to Perception checks. It takes a full action to awaken a varculak who is asleep, although these creatures awaken normally if wounded."
    ],
    "types": {
      "other": 1
    },
    "format": "torpor",
    "id": "abilities.torpor"
  },
  {
    "name": "Unnerving Visage",
    "ability_source": "alien_abilities",
    "description": [
      "Living members of the varculak’s former species find these undead disturbing. The varculak gains a +2 racial bonus to Intimidate checks made against members of that species but takes a –2 penalty to Bluff and Diplomacy checks made against them."
    ],
    "types": {
      "other": 1
    },
    "format": "unnerving visage (human)",
    "id": "abilities.unnerving_visage"
  },
  {
    "name": "Paired Pain",
    "ability_source": "alien_abilities",
    "description": [
      "As a reaction after taking damage, an anchorite can telepathically link with a willing allied velstrac that it can see within 30 feet. When either of the velstracs paired in this way takes further damage, that damage is divided evenly between the two. A velstrac of a higher CR can share its damage with an anchorite while refusing to take the anchorite’s shared damage. An anchorite already paired with another velstrac can’t use this ability to create a new pair. The pairing lasts for 1 minute, until one of the pair dies, or until one of the pair ends it as a move action. The pairing also ends if one partner is ever more than 30 feet from the other."
    ],
    "types": {
      "defensive": 1
    },
    "format": "paired pain",
    "id": "abilities.paired_pain"
  },
  {
    "name": "Unnerving Gaze",
    "ability_source": "alien_abilities",
    "description": [
      "The anchorite’s visage causes viewers to see themselves as the subject of the velstrac’s selfmutilation. A creature that fails a DC 13 Will save against this gaze is shaken for 1 round. This is a mind-affecting, fear effect."
    ],
    "types": {
      "offensive": 1
    },
    "format": "unnerving gaze (30 ft., DC 13)",
    "id": "abilities.unnerving_gaze"
  },
  {
    "name": "Lingering Touch",
    "ability_source": "alien_abilities",
    "description": [
      "A creature that takes damage from a velstrac cantor’s claw must succeed at a DC 18 Will saving throw or the pain lingers in its mind, dealing 1d4 additional damage (2d4 if the cantor scored a critical hit) at the start of each of its turns for 1 minute. At the end of each of its turns, the target can attempt another saving throw to end this effect. Each of the cantor’s additional successful attacks against a creature suffering this effect extends the duration by 1 round. Any form of magical healing ends this effect immediately. This is a mind-affecting effect."
    ],
    "types": {
      "melee": 1
    },
    "format": "claw +18 (2d6+9 S plus lingering touch)",
    "id": "abilities.lingering_touch"
  },
  {
    "name": "Waking Nightmare",
    "ability_source": "alien_abilities",
    "description": [
      "Once per minute as a full action, a cantor can mouth a soundless scream to create an illusory double of itself that is Large and even more horrifying. Creatures within 30 feet of and able to see the cantor must succeed at a DC 18 Will saving throw or believe this illusory double to be real. At the same moment, the cantor becomes invisible (as per greater invisibility). These effects last as long as at least one creature believes the illusion, but no longer than 1 minute. Both effects also end if the cantor is ever more than 30 feet away from the illusion at the end of its turn. The illusion appears to attack each round on the cantor’s turn, and the cantor usually attacks the same target, gaining the benefits of both invisibility and stealth. After a creature attacks the illusion, the creature can attempt another save to disbelieve the effect. A creature exposed to this effect is immune to the same cantor’s waking nightmare for 24 hours."
    ],
    "types": {
      "offensive": 1
    },
    "format": "waking nightmare",
    "id": "abilities.waking_nightmare"
  },
  {
    "name": "Pain Dependency",
    "ability_source": "alien_abilities",
    "description": [
      "A sexton is addicted to pain. If it doesn’t take damage every 4 hours, it gains the sickened and fatigued conditions until the next time it takes damage."
    ],
    "types": {
      "weakness": 1
    },
    "format": "pain dependency",
    "id": "abilities.pain_dependency"
  },
  {
    "name": "Shadow Spine",
    "ability_source": "alien_abilities",
    "description": [
      "As a ranged attack, a sexton can fire the spines of solidified shadowstuff that protrude from its back at its foes. This attack has a range increment of 40 feet and a maximum range of 200 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "shadow spine +21 (3d8+11 C; critical staggered [DC 18])",
    "id": "abilities.shadow_spine"
  },
  {
    "name": "Caustic Remains",
    "ability_source": "alien_abilities",
    "description": [
      "The remains of an asteroid louse are caustic and stay so for 5 rounds. This acid affects inorganic material and flesh. Creatures or items that touch the remains take 1d4 acid damage that treats hardness as 10 lower than it is. Anything in contact with the acid for a full round instead takes 8 acid damage."
    ],
    "types": {
      "other": 1
    },
    "format": "caustic remains",
    "id": "abilities.caustic_remains"
  },
  {
    "name": "Implant",
    "ability_source": "alien_abilities",
    "description": [
      "A comet wasp swarm can choose not to use its swarm attack on (and deal no damage to) a helpless or paralyzed living creature in its space. Instead of doing so, the swarm implants eggs in that creature, afflicting it with comet wasp gestation."
    ],
    "types": {
      "offensive": 1
    },
    "format": "implant",
    "id": "abilities.implant"
  },
  {
    "name": "Acid Spit",
    "ability_source": "alien_abilities",
    "description": [
      "Once per round as a standard action, the planetoid beetle can spit acid as a ranged attack that has the line property and a range of 60 feet."
    ],
    "types": {
      "ranged": 1
    },
    "format": "acid spit +19 (4d6+4 A; critical corrode 1d6)",
    "id": "abilities.acid_spit"
  },
  {
    "name": "Disorienting Aura",
    "ability_source": "alien_abilities",
    "description": [
      "A warpmoth swarm creates an oscillating light (colloquially called its warp) that is disorienting. A creature that is within this aura, can see the light, and fails a DC 14 Will saving throw can move at only half speed, rounded down to the nearest 5-foot increment. This is a mind-affecting effect."
    ],
    "types": {
      "aura": 1
    },
    "format": true,
    "id": "abilities.disorienting_aura"
  },
  {
    "name": "Skin Mimic",
    "ability_source": "alien_abilities",
    "description": [
      "Verthani can manipulate the pigments in their skin at will and with astonishing precision, creating bright decorative patterns or deceptive camouflage. A verthani who stays stationary for 1 round gains a +10 racial bonus to Stealth checks (this bonus doesn’t stack with the",
      "invisibility",
      "spell or similar effects). If the verthani takes any action, he loses this bonus until he once again spends 1 round remaining still. A verthani wearing clothing or armor that covers more than one-quarter of his body can’t use this ability."
    ],
    "types": {
      "other": 1
    },
    "format": "skin mimic",
    "id": "abilities.skin_mimic"
  },
  {
    "name": "Buoy",
    "ability_source": "alien_abilities",
    "description": [
      "As a standard action, a vlaka can spend 1 Resolve Point to restore 1 RP to an ally within 30 feet. A vlaka can’t use this ability again until she has taken a 10-minute rest to regain Stamina Points. This is a sense-dependent, mind-affecting ability."
    ],
    "types": {
      "unknown": 1
    },
    "id": "abilities.buoy"
  },
  {
    "name": "Deaf",
    "ability_source": "alien_abilities",
    "description": [
      "This vlaka tracker cannot attempt Perception checks to listen and is immune to effects that rely on hearing to function."
    ],
    "types": {
      "other": 1,
      "sense": 1
    },
    "format": "deafened",
    "id": "abilities.deaf"
  },
  {
    "name": "Boxed",
    "ability_source": "alien_abilities",
    "description": [
      "A weaponized devil-in-a-box has an attached box with a lid. While inside its box or motionless, the creature looks like a normal toy.",
      "As a move action, a weaponized devil-in-a-box can pull itself partially into its box, gaining partial cover. It takes a –2 penalty to attack rolls and can move at only half speed while doing so. As a full action, a weaponized devil-in-a-box can pull itself fully into its box, granting itself total cover. While withdrawn in this way, the devil-in-a-box can’t move or attack, and it can’t see. In either case, the devil-in-a-box can emerge from its box as a move action.",
      "The box has hardness 10 and 20 Hit Points, and a creature that targets the container with a melee or ranged attack automatically hits it. A devil-in-a-box whose box has the broken condition takes a –2 penalty to AC. If the box is destroyed, the penalty increases to –4, and the devil-in-a-box is staggered until a new box is attached."
    ],
    "types": {
      "defensive": 1
    },
    "format": "boxed;",
    "id": "abilities.boxed"
  },
  {
    "name": "Mobile Reach",
    "ability_source": "alien_abilities",
    "description": [
      "Provided it emerges fully from its box or moves before it attacks, a weaponized devil-in-a-box’s reach increases to 5 feet."
    ],
    "types": {
      "offensive": 1
    },
    "format": "mobile reach",
    "id": "abilities.mobile_reach"
  },
  {
    "name": "Casting Unit",
    "ability_source": "alien_abilities",
    "description": [
      "A weaponized gamedroid gains its spells from a special amalgamation of spell chips known as a casting unit. Some of the spells a weaponized gamedroid can cast vary, usually based on a theme, but like non-weaponized gamedroids, they typically use",
      "holographic image",
      "to build a gaming environment,",
      "disguise self",
      "to change their appearance in that environment,",
      "psychokinetic hand",
      "to manipulate the player in minor ways, and",
      "token spell",
      "for some special effects. The gamedroid can concentrate on",
      "holographic image",
      "as a swift action on each of its turns, and it can cast spells while so doing. In addition, when a gamedroid casts",
      "disguise self",
      ", it can appear to be as little as 1 foot in diameter or as big as 8 feet tall."
    ],
    "types": {
      "offensive": 1
    },
    "format": "casting unit",
    "id": "abilities.casting_unit"
  },
  {
    "name": "Sound Modulation",
    "ability_source": "alien_abilities",
    "description": [
      "A weaponized gamedroid can change its voice and other sounds it makes. This trait grants the gamedroid a +2 circumstance bonus to Disguise checks if a change in sound helps the disguise."
    ],
    "types": {
      "other": 1
    },
    "format": "sound modulation",
    "id": "abilities.sound_modulation"
  },
  {
    "name": "Snow Stride",
    "ability_source": "alien_abilities",
    "description": [
      "A wolliped treats heavy snow as difficult terrain and snow as normal terrain."
    ],
    "types": {
      "speed": 1
    },
    "format": "50 ft. (45 ft. in armor); snow stride",
    "id": "abilities.snow_stride"
  },
  {
    "name": "Spit",
    "ability_source": "alien_abilities",
    "description": [
      "Once per hour, a wolliped can regurgitate, spitting this vomit as a ranged attack (targeting EAC) at a target within 10 feet. On a hit, the target must succeed at a DC 16 Fortitude save or be sickened for 1d6 rounds."
    ],
    "types": {
      "offensive": 1
    },
    "format": "spit (1/hour; ranged +19)",
    "id": "abilities.spit"
  },
  {
    "name": "Elemental Burst",
    "ability_source": "alien_abilities",
    "description": [
      "A wysp conductor can channel a fraction of its innate elemental energy into a ranged attack with a maximum range of 60 feet. A wysp conductor’s elemental type might change the damage type of this attack (see Wysp Template Grafts below)."
    ],
    "types": {
      "ranged": 1
    },
    "format": "elemental burst +17 (2d6+8 B)",
    "id": "abilities.elemental_burst"
  },
  {
    "name": "Living Battery",
    "ability_source": "alien_abilities",
    "description": [
      "As an immediate action, a wysp can kill itself to cause a creature benefiting from its resonance to regain a number of Hit Points equal to 3 times that creature’s CR. If the wysp does this, its death cannot be prevented, and it can be restored to life only by miracle or wish."
    ],
    "types": {
      "other": 1
    },
    "format": "living battery",
    "id": "abilities.living_battery"
  },
  {
    "name": "Resonance",
    "ability_source": "alien_abilities",
    "description": [
      "The elemental energy of a wysp resonates with the bodies of creatures that share its elemental subtype. All such creatures within 30 feet gain a +1 morale bonus to damage rolls (or a +2 morale bonus if they also have the elemental subtype). The wysp is similarly affected, and this bonus is already included in its statistics."
    ],
    "types": {
      "aura": 1
    },
    "format": "resonance (30 ft.)",
    "id": "abilities.resonance"
  },
  {
    "name": "Mental Projection",
    "ability_source": "alien_abilities",
    "description": [
      "A yithian elder can use its spell-like abilities as if it were in the location of a creature that is party to the yithian’s telepathic bond."
    ],
    "types": {
      "other": 1
    },
    "format": "mental projection",
    "id": "abilities.mental_projection"
  },
  {
    "name": "Mind Swap Mastery",
    "ability_source": "alien_abilities",
    "description": [
      "When a yithian casts mind swap, the duration is permanent (D). The yithian takes its senses and defensive abilities with it to a new body and doesn’t gain the awkward trait. In addition, when the yithian returns to its own body, the",
      "mind swap",
      "target must succeed at a DC 20 Will saving throw or forget being in the yithian’s body."
    ],
    "types": {
      "other": 1
    },
    "format": "mind swap mastery",
    "id": "abilities.mind_swap_mastery"
  },
  {
    "name": "Telepathic Bond",
    "ability_source": "alien_abilities",
    "description": [
      "As the mystic class."
    ],
    "types": {
      "other": 1
    },
    "format": "telepathic bond",
    "id": "abilities.telepathic_bond"
  }
]